#Wed Nov 05 17:43:42 EST 2008
SHRC029=M\u00E9moire insuffisante sur le syst\u00E8me
SHRC028=Acc\u00E8s refus\u00E9
SHRC027=Nom du cache partag\u00E9 trop long
SHRC026=Impossible de cr\u00E9er un cache de la taille demand\u00E9e \: v\u00E9rifiez vos param\u00E8tres SHMMAX et SHMMIN
SHRC025=erreur de connexion de la m\u00E9moire partag\u00E9e
SHRC024=erreur de d\u00E9connexion de la m\u00E9moire partag\u00E9e
SHRC023=Le cache n'existe pas
SHRC022=Erreur lors de la cr\u00E9ation de la r\u00E9gion de m\u00E9moire partag\u00E9e
SHRC021=Un code d'erreur inconnu a \u00E9t\u00E9 retourn\u00E9
SHRC020=Une erreur s'est produite lors de l'ouverture du s\u00E9maphore
J9TI029=Signale l'\u00E9v\u00E9nement asynchrone sur une seule unit\u00E9 d'ex\u00E9cution ou sur toutes les unit\u00E9s d'ex\u00E9cution
J9TI028=Signale la fin d'un dump RAS.
J9TI027=Signale le d\u00E9but d'un dump RAS.
J9TI026=D\u00E9clenche un dump \u00E0 l'aide de la configuration RAS donn\u00E9e.
J9TI025=Autoriser l'interface JNI directe pour les \u00E9v\u00E9nements d'entr\u00E9e et de sortie de m\u00E9thode (cela peut \u00EAtre \u00E0 l'origine de la g\u00E9n\u00E9ration non fiable de rapport d'entr\u00E9e/sortie)
J9TI024=La m\u00E9thode s'arr\u00EAte sans la valeur de retour.
J9TI023=Obtient des informations \u00E9tendues du cadre pour une liste de processus.
J9TI022=Obtient des informations \u00E9tendues du cadre pour toutes les traces de la pile.
J9TI021=Obtient des informations \u00E9tendues du cadre.
J9VM066=type d'argument non concordant
J9TI020=Extrait l'ID unit\u00E9 d'ex\u00E9cution du syst\u00E8me d'exploitation \u00E0 partir d'une jthread
J9VM065=cet objet n'est pas une instance de la classe d\u00E9clarante
J9VM064=setDumpOption requiert %s
J9VM063=seekDumpAgent requiert %s
J9VM062=removeDumpAgent requiert %s
J9VM061=insertDumpAgent requiert %s
J9VM060=runNamedDump(%1$s) requiert %2$s
SHRC019=longueur demand\u00E9e trop faible
SHRC018=impossible d'allouer de la m\u00E9moire
SHRC017=Code d'erreur \: %d
SHRC016=Erreur du cache de classes partag\u00E9es \:
SHRC015=Erreur du cache de classes partag\u00E9es \: indicateur non valide
SHRC014=Echec de la suppression du s\u00E9maphore du cache "%s"
SHRC013=Echec du retrait de la m\u00E9moire du cache partag\u00E9 "%s"
SHRC012=Impossible de retirer le cache partag\u00E9 "%s" \: des machines JVM y sont encore connect\u00E9es
SHRC011=Erreur \: Impossible d'ouvrir le cache de classes partag\u00E9es
SHRC010=Le cache partag\u00E9 "%s" est d\u00E9truit
J9TI019=D\u00E9finit le mode de notification des \u00E9v\u00E9nements \u00E9tendus, ce qui autorise les s\u00E9lections au niveau des unit\u00E9s d'ex\u00E9cution
J9TI018=D\u00E9finit une m\u00E9thode pour la notification s\u00E9lective d'entr\u00E9e et de sortie.
J9TI017=Contr\u00F4le diverses options de compilation et de machine virtuelle.
J9TI016=Autorisation de la mise en ligne en pr\u00E9sence d'\u00E9v\u00E9nements de m\u00E9thode d'entr\u00E9e/sortie (cela peut \u00EAtre \u00E0 l'origine de la g\u00E9n\u00E9ration non fiable de rapport d'entr\u00E9e/sortie)
J9TI015=Demande un dump JLM (Java Lock Monitor).
J9TI014=Contr\u00F4le Java Lock Monitor (JLM) (COM_IBM_JLM_START, COM_IBM_JLM_START_TIME_STAMP, COM_IBM_JLM_STOP, COM_IBM_JLM_STOP_TIME_STAMP).
J9VM059=-Xscmaxaot n'est pas pris en compte en l'absence de -Xshareclasses
J9TI013=Autorise les rappels pour les allocations instrumentables (celles non signal\u00E9es par VMObjectAlloc).
J9VM058=-Xscminaot n'est pas pris en compte en l'absence de -Xshareclasses
J9TI012=Ajouter une option -Xdump dynamique
J9VM057=Taille maximale de la m\u00E9moire cache du moniteur d\u00E9pass\u00E9e
J9TI011=Ajouter une option -Xtrace dynamique
J9VM056=Version sup\u00E9rieure
J9TI010=Entr\u00E9e de m\u00E9thode comprenant des informations \u00E9tendues sur le type de m\u00E9thode.
J9VM055=Erreur bloquante \: Version sup\u00E9rieure de JXE diff\u00E9rente de %d
J9VM054=Echec de la cr\u00E9ation d'une unit\u00E9 d'ex\u00E9cution \: retVal %1$d, errno %2$d
J9VM053=Option mal form\u00E9e %s d\u00E9tect\u00E9e dans -Xoptionsfile
J9VM052=\   -Xjni\:arrayCacheMax\=[<x>|unlimited] d\u00E9finit la taille maximale du tableau mis en cache\n
J9VM051=Syntaxe \:\n
J9VM050=-Xjni \: option non identifi\u00E9e --> '%s'
SHRC009=Cache partag\u00E9 ouvert \: %1$s taille \: %2$d octets
SHRC008=Cache partag\u00E9 cr\u00E9\u00E9 \: %1$s taille \: %2$d octets
SHRC007=Impossible de retirer le cache de classes partag\u00E9es "%s"
SHRC006=Lors des %1$d derni\u00E8res minutes, %2$d caches sont arriv\u00E9s \u00E0 expiration
SHRC005=Aucun cache de classes partag\u00E9es disponible
SHRC004=Impossible de d\u00E9truire le cache "%s"
SHRC003=heure de la derni\u00E8re d\u00E9connexion
SHRC002=en cours d'utilisation
SHRC001=ID m\u00E9moire partag\u00E9e du syst\u00E8me d'exploitation
SHRC000=Cache partag\u00E9
J9TI009=Indique la fin d'une phase de compilation JIT. (Non prot\u00E9g\u00E9 contre les rappels)
J9TI008=Indique le d\u00E9but d'une phase de compilation JIT. (Non prot\u00E9g\u00E9 contre les rappels)
J9TI007=Obtenir toutes les fonctions \u00E9tendues disponibles via capabilities_ptr.
J9TI006=Renoncer aux fonctions \u00E9tendues de capabilities_ptr.
J9TI005=Ajouter les nouvelles fonctions \u00E9tendues \u00E0 partir de capabilities_ptr.
J9TI004=Retourner via capabilities_ptr les fonctions \u00E9tendues disponibles actuellement.
J9VM049=Dur\u00E9es de conservation JLM non prises en charge
J9TI003=Echec de Agent_OnLoad pour la biblioth\u00E8que %s
J9VM048=Dur\u00E9es de conservation JLM prises en charge
J9TI002=Agent_OnLoad introuvable dans la biblioth\u00E8que %s
J9VM047=JLM non pris en charge
J9TI001=La biblioth\u00E8que d'agents %1$s n'a pas pu \u00EAtre ouverte (%2$s)
J9VM046=JLM pris en charge
J9TI000=M\u00E9moire insuffisante lors de la tentative de chargement de la biblioth\u00E8que d'agents %s
J9VM045=Moniteurs de syst\u00E8me \u00E0 trois niveaux non pris en charge
J9VM044=Moniteurs de syst\u00E8me \u00E0 trois niveaux pris en charge
J9VM043=-----------------------
J9VM042=Configuration de l'utilisation des unit\u00E9s d'ex\u00E9cution
J9VM041=nombre d'arguments incorrect
J9VM040=d\u00E9passement de capacit\u00E9 dans la pile du syst\u00E8me d'exploitation
CFRE118=octets suppl\u00E9mentaires apr\u00E8s EOF
CFRE117=la zone ne peut \u00EAtre \u00E0 la fois final ou volatile
CFRE116=le bytecode d'invoke doit r\u00E9f\u00E9rencer un \u00E9l\u00E9ment Methodref
CFRE115=dimensions de tableau > 255
CFRE114=nom de zone non valide
CFRE113=EOF inattendu
CFRE112=VM ne prend pas en charge la v\u00E9rification dynamique
CFRE111=UTF8 incorrect
CFRE110=constante incompatible pour la zone
J9VM039=-Xscmx n'est pas pris en compte en l'absence de -Xshareclasses
J9VM038=-Xthr \: option non identifi\u00E9e --> '%s'
J9VM037=Echec de l'allocation du moniteur
J9VM036=division par z\u00E9ro
J9VM035=Impossible d'allouer OutOfMemoryError
J9VM034=JVMRI requiert un moteur de trace ex\u00E9cut\u00E9 avec l'option -Xtrace
J9VM033=Erreur bloquante \: \u00E9chec de l'initialisation de %s
J9VM032=Erreur bloquante \: impossible de charger %1$s \: %2$s
J9VM031=La classe %2$.*1$s obligatoire doit r\u00E9sider dans le chemin des classes d'amor\u00E7age mais figure dans le chemin des classes d'application dans %4$.*3$s
J9VM030=UTF8 incorrect dans la fonction JNI
CFRE109=signature de m\u00E9thode non valide
CFRE108=l'index de la m\u00E9thode englobante doit faire r\u00E9f\u00E9rence \u00E0 un nom et un type
CFRE107=d\u00E9calage hors plage dans le bytecode de jump
CFRE106=m\u00E9thode en double
CFRE105=superClass doit \u00EAtre une classe
CFRE104=la zone ne peut \u00EAtre que l'un au plus de ces types \: public, private ou protected
CFRE103=la m\u00E9thode de type abstract ne doit pas \u00EAtre private, static, final, native, synchronized ou strict
CFRE102=signature de zone non valide
CFRE101=d\u00E9calage hors plage dans le bytecode de switch
CFRE100=trop de dimensions demand\u00E9es dans le bytecode de multianewarray
J9VM029=\tat (m\u00E9thode inconnue)
J9VM028=\tat %2$.*1$s.%4$.*3$s (%6$.*5$s\:%7$u)
J9VM027=\tat %2$.*1$s.%4$.*3$s (%6$.*5$s)
J9VM026=\tat %2$.*1$s.%4$.*3$s (source inconnue)
J9VM025=\tat %2$.*1$s.%4$.*3$s (m\u00E9thode native)
J9VM024=Exception dans l'unit\u00E9 d'ex\u00E9cution "%.*s"
J9VM023=Ceci indique que soit JAVA_HOME est incorrect, soit les biblioth\u00E8ques de classe ne sont pas install\u00E9es
J9VM022=Echec de la mappe de pile, r\u00E9sultat \= %p - abandon de la machine virtuelle en cours
J9VM021=M\u00E9moire satur\u00E9e pour la mappe de pile de l'interpr\u00E9teur - abandon de la machine virtuelle en cours
J9VM020=Recherche effectu\u00E9e dans %.*s
J2JX110=Le fichier JAR %s a d\u00E9j\u00E0 \u00E9t\u00E9 converti
J9VM019=Erreur bloquante \: Impossible de trouver et d'initialiser la classe requise %.*s
J9VM018=Allocation de m\u00E9moire impossible pour le pool de tables de chargement de biblioth\u00E8que partag\u00E9e
J9VM017=Allocation de m\u00E9moire impossible pour le tableau d'options de ligne de commande
J9VM016=Erreur d'arr\u00EAt de la biblioth\u00E8que %1$s(%2$d) \: %3$s
J9VM015=Erreur d'initialisation de la biblioth\u00E8que %1$s(%2$d) \: %3$s
J9VM014=Erreur d'arr\u00EAt dans la fonction %1$s(%2$d) \: %3$s
J9VM013=Erreur d'initialisation dans la fonction %1$s(%2$d) \: %3$s
J9VM012=Impossible de d\u00E9charger %1$s \: %2$s
J2JX109=\  -E xxx\=yyy                d\u00E9finit la propri\u00E9t\u00E9 syst\u00E8me xxx sur la valeur de la variable d'environnement yyy au moment de l'ex\u00E9cution
J9VM011=Impossible de charger %1$s \: %2$s
J2JX108=\  -g[\:lines,source,vars]    g\u00E9n\u00E8re un sous-ensemble (lignes, source, et/ou variables) d'informations de d\u00E9bogage dans JXE
J9VM010=Echec de l'initialisation de %s
J2JX107=\  -g\:nosym                  inclut des informations de d\u00E9bogage dans JXE
J2JX106=\  -g\:sym                    g\u00E9n\u00E8re un fichier .sym pour le d\u00E9bogage, aucune information de d\u00E9bogage dans JXE
J2JX105=\  -nog                      ne g\u00E9n\u00E8re aucune information de d\u00E9bogage pour JXE
J2JX104=\  -g                        identique \u00E0 -g\:sym
J2JX103=Impossible de compiler la m\u00E9thode \: %2$.*1$s/%4$.*3$s%6$.*5$s jitErr 0%7$x
J2JX102=Impossible de compiler la m\u00E9thode native \: %2$.*1$s/%4$.*3$s%6$.*5$s
J2JX101=Impossible de compiler la m\u00E9thode abstraite \: %2$.*1$s/%4$.*3$s%6$.*5$s
J2JX100=%s n'est pas pris en charge dans cette configuration
J9VM009=Echec de J9VMDllMain
J9VM008=J9VMDllMain introuvable
J9VM007=Option de ligne de commande non identifi\u00E9e \: %s
J9VM006=Option de ligne de commande incorrecte \: %s
J9VM005=Valeur incorrecte pour la variable d'environnement \: %s
J9VM004=Impossible de charger la biblioth\u00E8que requise par \: %s
J9VM003=Compilateur JIT "%s" introuvable. L'interpr\u00E9teur va \u00EAtre utilis\u00E9.
J9VM002=Fichier des options introuvable
J9VM001=Valeur mal form\u00E9e pour -Xservice
J9VM000=Valeur mal form\u00E9e pour IBM_JAVA_OPTIONS
EXEL091=\n  -Xcheck[\:option[\:...]]  contr\u00F4le des v\u00E9rifications ; \u00E9xecutez -Xcheck\:help pour plus de d\u00E9tails
EXEL090=\  -Xscmaxaot<x>   d\u00E9finir l'espace maximal du cache de classes partag\u00E9es autoris\u00E9 pour les donn\u00E9es AOT sur <x>
EXEL089=\  -Xscminaot<x>   d\u00E9finir l'espace minimal du cache de classes partag\u00E9es r\u00E9serv\u00E9 aux donn\u00E9es AOT sur <x>
EXEL088=
EXEL087=\  -Xjni\:<options>               d\u00E9finir les options JNI
EXEL086=\n -Xtrace[\:option,...]  contr\u00F4ler les traces ; \u00E9xecutez -Xtrace\:help pour plus de d\u00E9tails
EXEL085=\nAVERTISSEMENT \: L'argument de ligne de commande "%s" est obsol\u00E8te.\nAVERTISSEMENT \: Utilisez plut\u00F4t "-jxe <chemin>".\n
EXEL084=Impossible de faire une copie de sauvegarde du fichier \: %s
EXEL083=Impossible d'ouvrir le fichier \: %s
EXEL082=\  -Xlp<x>         d\u00E9finir la taille des pages volumineuses sur <x>
EXEL081=java version "%1$s/%2$s"
EXEL080=java version "%s"
EXEL079=\  -Xscmx<x>       d\u00E9finir la taille du nouveau cache de classes partag\u00E9es sur <x>
EXEL078=\  -Xshareclasses[\:options]  activer le partage de donn\u00E9es de classe (utiliser l'aide pour plus de d\u00E9tails)\n
EXEL077=\  -Xssi<x>        d\u00E9finir l'incr\u00E9ment de pile d'unit\u00E9s d'ex\u00E9cution Java sur <x>
EXEL076=JIT  - %s\n
EXEL075=\  -Xquickstart    am\u00E9liorer la dur\u00E9e du d\u00E9marrage en diff\u00E9rant les optimisations
EXEL074=Impossible de rediriger la console vers \: %1$s\:%2$d
EXEL073=Erreur interne de la VM \: Echec de la cr\u00E9ation de la VM Java
EXEL072=Erreur de d\u00E9marrage de la VM \: M\u00E9moire insuffisante
EXEL071=Nom de la classe principale introuvable
EXEL070=La version de l'image ROM est erron\u00E9e
EXEL069=Image ROM introuvable
EXEL068=Erreur interne de la VM \: Echec de l'initialisation de l'\u00E9l\u00E9ment de tableau pour %s
EXEL067=Erreur interne de la VM \: Echec de la cr\u00E9ation de java/lang/String pour l'argument %s
EXEL066=Erreur interne de la VM \: \: Echec de la cr\u00E9ation du tableau d'octets pour l'argument %s
EXEL065=Erreur interne de la VM \: Echec de la cr\u00E9ation du tableau d'arguments
EXEL064=La m\u00E9thode main doit \u00EAtre d\u00E9clar\u00E9e en tant que m\u00E9thode de type public, static et void.
EXEL063=M\u00E9thode main() non impl\u00E9ment\u00E9e dans la classe %s
EXEL062=Erreur VM interne \: M\u00E9moire insuffisante pour la conversion de la cha\u00EEne en caract\u00E8res UTF du nom de classe %s
EXEL061=Erreur interne de la VM \: Echec de la cr\u00E9ation de java/lang/String pour le nom de classe %s
EXEL060=Erreur interne de la VM \: Echec de la cr\u00E9ation du tableau d'octets pour le nom de classe %s
JVMP000=La tentative d'instrumentation de %.*s via JVMPI a \u00E9t\u00E9 refus\u00E9e
SHRC199=\ Stockage de %2$.*1$s r\u00E9ussi.
SHRC198=Stockage du code AOT pour ROMMethod 0x%1$p dans le cache partag\u00E9...
SHRC197=Recherche du code AOT pour ROMMethod 0x%1$p dans le cache partag\u00E9...
SHRC196=[-Xshareclasses sortie prolixe AOT activ\u00E9e]
SHRC195=Activer la sortie prolixe AOT
SHRC194=\tpour ROMClass %2$.*1$s \u00E0 0x%3$p.
SHRC193=%1$d \: 0x%2$p AOT \: %4$.*3$s
SHRC192=La valeur de -Xscmaxaot est sup\u00E9rieure \u00E0 celle de -Xscmx, une valeur illimit\u00E9e lui a donc \u00E9t\u00E9 attribu\u00E9e
SHRC191=La valeur de -Xscminaot est sup\u00E9rieure \u00E0 celle de -Xscmx, une valeur \u00E9gale \u00E0 celle de -Xscmx lui a donc \u00E9t\u00E9 attribu\u00E9e
EXEL059=Erreur interne de la VM \: Classe java/lang/String introuvable
SHRC190=La valeur de -Xscminaot ne doit pas \u00EAtre sup\u00E9rieure \u00E0 celle de -Xscmaxaot
EXEL058=Erreur interne de la VM \: M\u00E9moire insuffisante
EXEL057=
EXEL056=IBM est une marque d'IBM Corp.\nJava ainsi que toutes les marques et logos incluant Java\nsont des marques de Sun Microsystems, Inc. \n
EXEL055=Cible \: %s
EXEL054=(c) Copyright IBM Corp. 1991, %s  All rights reserved
EXEL053=El\u00E9ments sous licence - Propri\u00E9t\u00E9 d'IBM\n\\nJ9 - Machine virtuelle pour la plateforme Java, version %s
EXEL052=\nAVERTISSEMENT \: L'argument de ligne de commande "%s" est obsol\u00E8te.\nAVERTISSEMENT \: Utilisez plut\u00F4t l'argument -X.
EXEL051=\nAVERTISSEMENT \: L'argument de ligne de commande "%s" est obsol\u00E8te.\nAVERTISSEMENT \: Utilisez "-classpath <chemin>" ou "-cp <chemin>".
EXEL050=\  -Xrdbginfo\:<h\u00F4te>\:<port>      activer le serveur d'informations de d\u00E9bogage distant
SHRC189=Nombre de m\u00E9thodes AOT       \= %d
SHRC188=Octets AOT          \= %d
SHRC187=D\u00E9sactiver le stockage de donn\u00E9es AOT dans le cache partag\u00E9
SHRC186=\tPartition %.*s dans ModContext %.*s
SHRC185=\tModContext %.*s
SHRC184=\tPartition %.*s
SHRC183=Impossible de cr\u00E9er la table de hachage dans ScopeManagerImpl
SHRC182=Impossible de cr\u00E9er le moniteur dans ScopeManagerImpl
SHRC181=Impossible d'entrer le mutex de table de hachage ScopeManagerImpl
EXEL049=
SHRC180=Impossible d'allouer de la m\u00E9moire pour l'entr\u00E9e de table de hachage dans ScopeManagerImpl
EXEL048=\  -Xrunjdwp\:<options>               activer les options standard JDWP de d\u00E9bogage
EXEL047=\n  -Xdbg\:<options>               activer les options standard JDWP de d\u00E9bogage
EXEL046=\  -Xlp                          activer la prise en charge de pages volumineuses
EXEL045=\  -Xnocompactgc                 d\u00E9sactiver la compression
EXEL044=\  -Xcompactgc                   activer la compression
EXEL043=\  -Xcompactexplicitgc           activer la compression lors de chaque GC syst\u00E8me
EXEL042=\  -Xnocompactexplicitgc         d\u00E9sactiver la compression lors d'un GC syst\u00E8me
EXEL041=\  -Xalwaysclassgc               activer le d\u00E9chargement de classe dynamique \u00E0 chaque GC
EXEL040=\  -Xclassgc                     activer le d\u00E9chargement de classe dynamique
SHRC179=Le segment ROMClass est endommag\u00E9. Erreur de lecture du ROMClass \u00E0 0x%p
SHRC178=
SHRC177=
SHRC176=
SHRC175=
SHRC174=
SHRC173=D\u00E9finir le r\u00E9pertoire des fichiers de contr\u00F4le JVM (avanc\u00E9)
SHRC172=Les restrictions du syst\u00E8me d'exploitation font qu'il n'est pas possible de cr\u00E9er le cache de taille demand\u00E9e
SHRC171=z/OS ne peut pas cr\u00E9er de cache avec la taille demand\u00E9e \: v\u00E9rifiez vos param\u00E8tres syst\u00E8me z/OS BPXPRMxx
EXEL039=\  -Xnoclassgc                   d\u00E9sactiver le d\u00E9chargement de classe dynamique
SHRC170=Indiquer le nom du cache partag\u00E9\n\t(%%u remplace le nom d'utilisateur)
EXEL038=\  -Xgcthreads<x>                d\u00E9finir le nombre d'unit\u00E9s d'ex\u00E9cution GC
EXEL037=\nLes arguments des options suivantes sont exprim\u00E9s sous forme de nombres d\u00E9cimaux.\n
EXEL036=\  -Xmaxf<x>       pourcentage maximal de segment libre apr\u00E8s GC
EXEL035=\  -Xminf<x>       pourcentage minimal de segment libre apr\u00E8s GC
ZIPS001=Impossible d'ouvrir %s (export manquant)
EXEL034=Une valeur de 0.3 repr\u00E9sente une demande de 30%%\n
ZIPS000=Impossible d'ouvrir %1$s (%2$s)
EXEL033=\nLes arguments des options suivantes sont exprim\u00E9s sous forme de d\u00E9cimaux entre 0 et 1.
EXEL032=\  -Xmaxe<x>       d\u00E9finir la taille maximale pour l'expansion du segment sur <x>
EXEL031=\  -Xmine<x>       d\u00E9finir la taille minimale pour l'expansion du segment sur <x>
EXEL030=\  -Xss<x>         d\u00E9finir la taille de la pile d'unit\u00E9s d'ex\u00E9cution sur <x>
SHRC169=Modification d\u00E9tect\u00E9e dans %2$.*1$s...\n\t...%3$d classes en cache ont \u00E9t\u00E9 marqu\u00E9es comme p\u00E9rim\u00E9es
SHRC168=Nombre total d'octets de classes partag\u00E9es lus \= %1$lld. Nombre total d'octets stock\u00E9s \= %2$d
SHRC167=D\u00E9sactive le partage de classes
SHRC166=Connect\u00E9 au cache "%1$s", taille \=%2$d octets
SHRC165=[-Xshareclasses sortie prolixe de l'API auxiliaire activ\u00E9e]
SHRC164=[-Xshareclasses sortie d'E-S prolixe activ\u00E9e]
SHRC163=[-Xshareclasses sortie prolixe activ\u00E9e]
J9RI023=
SHRC162=Le d\u00E9lai d'attente du mutex de cr\u00E9ation lors de l'ouverture de la m\u00E9moire partag\u00E9e a \u00E9t\u00E9 d\u00E9pass\u00E9
J9RI022=JVMRI en cours d'initialisation ne peut pas allouer de moniteur dump jvri
SHRC161=Le d\u00E9lai d'attente du mutex de cr\u00E9ation lors de la cr\u00E9ation de la m\u00E9moire partag\u00E9e a \u00E9t\u00E9 d\u00E9pass\u00E9
EXEL029=\  -Xss<x>        d\u00E9finir la taille maximale de la pile d'unit\u00E9s d'ex\u00E9cution Java sur <x>
J9RI021=jvmri->RunDumpRoutine n'est pas pris en charge.
SHRC160=Le d\u00E9lai d'attente du mutex de cr\u00E9ation lors de l'ouverture du s\u00E9maphore a \u00E9t\u00E9 d\u00E9pass\u00E9
EXEL028=\  -Xiss<x>        d\u00E9finir la taille initiale de la pile d'unit\u00E9s d'ex\u00E9cution Java sur <x>
J9RI020=jvmri->CreateThread \: impossible d'allouer un moniteur priv\u00E9
EXEL027=\  -Xmso<x>        d\u00E9finir la taille de la pile d'unit\u00E9s d'ex\u00E9cution syst\u00E8me sur <x>
EXEL026=\  -Xmrx<x>        d\u00E9finir la taille maximale de l'ensemble m\u00E9moris\u00E9 sur <x>
EXEL025=\  -Xmr<x>         d\u00E9finir la taille de l'ensemble m\u00E9moris\u00E9 sur <x>
EXEL024=\  -Xmx<x>         d\u00E9finir la taille maximale de m\u00E9moire sur <x>
EXEL023=\  -Xms<x>         d\u00E9finir la taille m\u00E9moire initiale sur <x>
EXEL022=\  -Xms<x>         d\u00E9finir l'ancienne taille d'espace sur <x>
EXEL021=\  -Xmoi<x>        d\u00E9finir l'ancien incr\u00E9ment d'espace sur <x>
EXEL020=\  -Xmox<x>         d\u00E9finir l'ancienne taille d'espace maximale sur <x>
SHRC159=Cache de classes partag\u00E9es "%1$s" ouvert
J9RI019=jvmri->InjectOutOfMemory non pris en charge.
SHRC158=Cache de classes partag\u00E9es "%1$s" cr\u00E9\u00E9
J9RI018=jvmri->NotifySignal \: \u00E9mission du signal %d.
SHRC157=Impossible d'allouer les %1$d octets de m\u00E9moire partag\u00E9e demand\u00E9s \n\tLa m\u00E9moire partag\u00E9e maximale autoris\u00E9e a \u00E9t\u00E9 allou\u00E9e (%2$d octets) \n\t(Pour augmenter la m\u00E9moire partag\u00E9e disponible, modifiez la valeur du param\u00E8tre syst\u00E8me SHMMAX)
J9RI017=Impossible d'allouer l'agent de nettoyage dans jvmri->SetOutOfMemoryHook, fonction non enregistr\u00E9e.
SHRC156=Erreur lors de la copie du nom de groupe dans le nom de cache
J9RI016=jvmri->SetOutOfMemoryHook appel\u00E9 avec rappel vide, fonction non enregistr\u00E9e.
SHRC155=Erreur lors de la copie du nom d'utilisateur dans le nom de cache
J9RI015=jvmri->RunDumpRoutine \: componentId hors limites.
SHRC154=Caract\u00E8re d'\u00E9chappement %.*s non valide pour le nom du cache
J9RI014=jvmri->RunDumpRoutine \: r\u00E9cup\u00E9ration de donn\u00E9es de composant impossible.
SHRC153=Indiquer le nom du cache partag\u00E9\n\t(%%g remplace le nom de groupe et %%u le nom d'utilisateur)
J9RI013=jvmri->ReleaseRasInfo \: structure poss\u00E9dant une zone de type non prise en charge.
SHRC152=Toujours d\u00E9marrer la machine JVM ind\u00E9pendamment des erreurs/avertissements
J9RI012=jvmri->ReleaseRasInfo appel\u00E9 avec structure RasInfo vide.
SHRC151=Supprimer tous les messages
EXEL019=\  -Xmos<x>        d\u00E9finir l'ancienne taille d'espace initiale sur <x>
J9RI011=L'une des zones de type de la structure RasInfo n'est pas prise en charge.
SHRC150=Activer la sortie prolixe pour l'API auxiliaire
EXEL018=\  -Xmo<x>         d\u00E9finir l'ancienne taille d'espace initiale/maximale sur <x>
J9RI010=jvmri->GetRasInfo \: allocation de m\u00E9moire impossible.
EXEL017=\  -Xmo<x>         d\u00E9finir l'ancienne taille d'espace sur <x>
EXEL016=\  -Xmnx<x>         d\u00E9finir la nouvelle taille d'espace maximale sur <x>
EXEL015=\  -Xmns<x>        d\u00E9finir la nouvelle taille d'espace initiale sur <x>
EXEL014=\  -Xmn<x>         d\u00E9finir la nouvelle taille d'espace initiale/maximale sur <x>
EXEL013=\  -Xmn<x>         d\u00E9finir la nouvelle taille d'espace sur <x>
EXEL012=\  -Xmco<x>        d\u00E9finir l'incr\u00E9ment de segment de classe ROM sur <x>
EXEL011=\  -Xmca<x>        d\u00E9finir l'incr\u00E9ment de segment de classe RAM sur <x>
EXEL010=Les valeurs suivies de "k" (kilo) ou de "m" (m\u00E9ga) seront trait\u00E9es en cons\u00E9quence.\n
SHRC149=Activer la sortie prolixe pour la recherche et le stockage
J9RI009=jvmri->GetRasInfo \: allocation de m\u00E9moire impossible.
SHRC148=Autoriser l'acc\u00E8s de groupe \u00E0 la m\u00E9moire cache (valeur par d\u00E9faut \: user)
J9RI008=jvmri->GetRasInfo \: r\u00E9cup\u00E9ration de composants impossible.
SHRC147=Caract\u00E8re %.*s incorrect pour le nom de cache
J9RI007=jvmri->GetRasInfo \: allocation de m\u00E9moire impossible.
SHRC146=Recherche de la classe %1$s dans le cache partag\u00E9 pour l'ID chargeur de classe %2$d de jeton %4$.*3$s...
J9RI006=jvmri->GetRasInfo appel\u00E9 avec structure RasInfo vide.
SHRC145=Recherche de la classe %1$s dans le cache partag\u00E9 pour l'ID chargeur de  classe %2$d d'URL %4$.*3$s...
J9RI005=jvmri->GetComponentDataArea \: composant %s sans dataArea sous cette machine virtuelle.
SHRC144=Stockage de la classe %2$.*1$s dans le cache partag\u00E9 pour l'ID chargeur  de classe %3$d de jeton %5$.*4$s...
J9RI004=jvmri->DynamicVerbosegc non pris en charge.
SHRC143=Stockage de la classe %2$.*1$s dans le cache partag\u00E9 pour l'ID chargeur de classe %3$d d'URL %5$.*4$s...
J9RI003=Impossible d'allouer l'agent de nettoyage dans jvmri->DumpRegister, fonction non enregistr\u00E9e.
SHRC142=\t\u00E0 0x%1$p\t\t%2$x \!\= %3$x
J9RI002=jvmri->DumpRegister appel\u00E9 avec rappel vide, fonction non enregistr\u00E9e.
SHRC141=octets diff\u00E9rents \:
EXEL009=\nLes arguments des options suivantes sont exprim\u00E9s en octets.
J9RI001=Erreur interne lors de la suppression de l'agent de nettoyage dans jvmri->DumpDeregister, il se peut que la fonction ne soit pas d\u00E9senregistr\u00E9e.
SHRC140=taille \:\t%1$d\t\t\t%2$d\n
EXEL008=\  -Xfuture        activer les contr\u00F4les draconiens pour anticiper le comportement par d\u00E9faut
J9RI000=jvmri->CreateThread \: impossible d'allouer la m\u00E9moire des arguments d'unit\u00E9 d'allocation
EXEL007=\  -Xnoaot         ne pas ex\u00E9cuter le code pr\u00E9compil\u00E9
EXEL006=\  -Xnojit         d\u00E9sactiver le compilateur JIT
EXEL005=\  -Xint           ex\u00E9cuter en mode interpr\u00E9t\u00E9 uniquement (\u00E9quivalent de -Xnojit -Xnoaot)
EXEL004=\n  -Xrun<library>[\:options]  charger la biblioth\u00E8que d'agents native\n                            (obsol\u00E8te ; utiliser -agentlib)\n
EXEL003=\  -Xbootclasspath/a\:<chemin>  adjoindre <chemin> au chemin d'acc\u00E8s aux classes d'amor\u00E7age
EXEL002=\  -Xbootclasspath/p\:<chemin>  placer <chemin> au d\u00E9but du chemin d'acc\u00E8s aux classes d'amor\u00E7age
EXEL001=\  -Xbootclasspath\:<chemin>    d\u00E9finir le chemin d'acc\u00E8s aux classes d'amor\u00E7age sur <chemin>
EXEL000=Les options suivantes ne sont pas standard et font l'objet de modification sans pr\u00E9avis.\n
JDBG021=option de d\u00E9bogage non identifi\u00E9e
JDBG020=option de d\u00E9bogage non identifi\u00E9e \: "%s"
SHRC139=\n\tROMClass en cours de stockage\tROMClass dans le cache
SHRC138=Plusieurs \u00E9l\u00E9ments ROMClass orphelins trouv\u00E9s pour %.*s
SHRC137=MODE SANS ECHEC \: Avertissement \: Diff\u00E9rences entre ROMClass %.*s et l'\u00E9l\u00E9ment ROMClass du cache
SHRC136=Impossible de cr\u00E9er le moniteur dans SH_ROMClassManagerImpl
SHRC135=Impossible de cr\u00E9er la table de hachage dans SH_ROMClassManagerImpl
SHRC134=Impossible de cr\u00E9er le pool dans SH_ROMClassManagerImpl
SHRC133=Impossible d'entrer le mutex de table de hachage ROMClassManager
SHRC132=Impossible d'allouer de la m\u00E9moire pour l'entr\u00E9e de table de hachage dans ROMClassManagerImpl
SHRC131=Impossible d'allouer de la m\u00E9moire pour l'\u00E9l\u00E9ment de liste li\u00E9e dans ROMClassManagerImpl
SHRC130=Tentative d'allocation alors que la validation est en attente
JDBG019=Liste de translation %zx non tri\u00E9e
JDBG018=ignorer l'option de d\u00E9bogage non identifi\u00E9e
JDBG017=
JDBG016=Echec de la connexion JVM
JDBG015=D\u00E9bogage du serveur de r\u00E9ponse
JDBG014=impossible d'allouer le pool vm->debuggerClassReferences
JDBG013=impossible d'allouer le pool vm->debuggerReferences
JDBG012=Echec de j9dbg_init_server
JDBG011=impossible d'allouer debugServer
JDBG010=Exemple \: java -Xrunjdwp\:transport\=dt_socket,address\=localhost\:8000\n
SHRC129=Tentative d'attribution de la valeur -1 \u00E0 readerCount
SHRC128=Echec de SH_CompositeCache\:\:exitMutex avec le code retour %d
SHRC127=Echec de SH_CompositeCache\:\:enterMutex avec le code retour %d
SHRC126=Demande d'ajout d'un nombre trop important d'\u00E9l\u00E9ments dans ClasspathItem
SHRC125=Impossible d'allouer de la m\u00E9moire pour la m\u00E9moire tampon de cha\u00EEnes dans SH_CacheMap
SHRC124=Cache rempli \u00E0 %1$d%%\n
SHRC123=%% classes p\u00E9rim\u00E9es                    \= %1$d%%\n
SHRC122=Nombre de classes p\u00E9rim\u00E9es    \= %d
SHRC121=Nombre de jetons           \= %d
SHRC120=Nombres d'URL             \= %d
JDBG009=j9methodids\=y|n                utiliser id m\u00E9thode j9               n\n
JDBG008=onuncaught\=y|n                  d\u00E9bog. exceptions non intercept\u00E9es ?            n
JDBG007=onthrow\=<nom exception>         d\u00E9bogage en cas d'exception     n\u00E9ant
JDBG006=server\=y|n                      \u00E9coute du d\u00E9bogueur ?            n
JDBG005=address\=<adr \u00E9coute/connexion>  sp\u00E9cif. transport               "localhost\:8888"
JDBG004=transport\=<nom>                 sp\u00E9cif. transport               n\u00E9ant
JDBG003=suspend\=y|n                     attendre au d\u00E9marrage ?           y
JDBG002=---------------------           -----------                     -------
JDBG001=Nom d'option et valeur          Description                     Valeur par d\u00E9faut
JDBG000=Syntaxe de -Xrunjdwp \: -Xrunjdwp\:[help]|[<option>\=<valeur>, ...]\n
SHRC119=Nombre de chemins d'acc\u00E8s aux classes       \= %d
SHRC118=Nombre de classes ROM      \= %d
SHRC117=%% m\u00E9tadonn\u00E9es utilis\u00E9es      \= %1$d%%\n
SHRC116=octets de m\u00E9tadonn\u00E9es     \= %d
SHRC115=octets ROMClass     \= %d
SHRC114=octets disponibles         \= %d
SHRC113=taille de cache         \= %d
SHRC112=pointeur d'allocation \= 0x%p\n
SHRC111=adresse de fin            \= 0x%p
SHRC110=\nadresse de base           \= 0x%p
EXEX026=\  -jxe <fichierJXE>   place le fichier JXE dans le chemin d'acc\u00E8s aux classes et ex\u00E9cute la classe\n                    de d\u00E9marrage du fichier JXE.s
EXEX025=Syntaxe \: \t%s [-jxe] [options] <fichierJXE> [arguments...]
EXEX024=%s JXE ne contient aucune classe de d\u00E9marrage.
EXEX023=Impossible d'initialiser les utilitaires JXE.
EXEX022=
EXEX021=
EXEX020=
SHRC109=\!STALE\!
VERB026=Entr\u00E9e de chemin d'acc\u00E8s aux classes non valide \: %s (endian JXE oppos\u00E9 non pris en charge)
SHRC108=\t%.*s
VERB025=Entr\u00E9e de chemin d'acc\u00E8s aux classes non valide \: %s (en-t\u00EAte d'image JXE corrompu)
SHRC107=\t%.*s
VERB024=Entr\u00E9e de chemin d'acc\u00E8s aux classes non valide \: %s (rom.classes manquant pour JXE)
SHRC106=%1$d \: 0x%2$p TOKEN
VERB023=Entr\u00E9e de chemin d'acc\u00E8s aux classes non valide \: %s (erreur inconnue)
SHRC105=%1$d \: 0x%2$p URL
VERB022=Entr\u00E9e de chemin d'acc\u00E8s aux classes non valide \: %s (type de fichier inconnu)
SHRC104=%1$d \: 0x%2$p CLASSPATH
VERB021=Entr\u00E9e de chemin d'acc\u00E8s aux classes non valide \: %s (type de fichier non pris en charge)
SHRC103=\tJeton 0x%p
VERB020=Entr\u00E9e de chemin d'acc\u00E8s aux classes non valide \: %s (fichier corrompu)
SHRC102=\tURL 0x%p
SHRC101=\tIndex %1$d dans le chemin d'acc\u00E8s aux classes 0x%2$p
SHRC100=%1$d \: 0x%2$p ROMCLASS \: %4$.*3$s \u00E0 0x%5$p.
CDRT002=PC d\u00E9faillant \: %1$p (d\u00E9calage %2$p), m\u00E9ta-donn\u00E9es \= %3$p
CDRT001=M\u00E9thode \: %2$.*1$s.%4$.*3$s%6$.*5$s (%7$p)
CDRT000=Impossible de localiser la mappe de pile JIT - abandon de la machine virtuelle en cours
EXEX019=
EXEX018=
EXEX017=Erreur de mappage de jxe dans flash
EXEX016=Param\u00E8tres jxespace non valides.
EXEX015=Erreur de d\u00E9marrage de la VM \: M\u00E9moire insuffisante
EXEX014=Pour conna\u00EEtre la syntaxe, ex\u00E9cutez %s -help
EXEX013=Erreur interne de la VM \: Echec de la cr\u00E9ation de la VM Java
EXEX012=Option -jar indisponible pour cette biblioth\u00E8que de classe
EXEX011=
EXEX010=%s requiert un param\u00E8tre
PORT019=Impossible de cr\u00E9er le r\u00E9pertoire %s.  Les classes partag\u00E9es seront d\u00E9sactiv\u00E9es jusqu'\u00E0 la cr\u00E9ation de ce r\u00E9pertoire.
PORT018=Echec de l'op\u00E9ration \: %1$d (\u00E9chec de %2$s \: %3$d)
PORT017=Echec de l'op\u00E9ration \: %d
VERB019=Entr\u00E9e de chemin d'acc\u00E8s aux classes non valide \: %s (\u00E9chec lecture fichier)
PORT016=Erreur interne %i
VERB018=Entr\u00E9e de chemin d'acc\u00E8s aux classes non valide \: %s (\u00E9chec E-S fichier)
PORT015=Impossible de r\u00E9soudre les r\u00E9f\u00E9rences de biblioth\u00E8que partag\u00E9e - une biblioth\u00E8que partag\u00E9e pr\u00E9requise peut manquer
VERB017=cache de classes partag\u00E9es max autoris\u00E9 pour AOT
PORT014=biblioth\u00E8que partag\u00E9e non trouv\u00E9e
VERB016=cache de classes partag\u00E9es min r\u00E9serv\u00E9 pour AOT
PORT013=table de biblioth\u00E8ques partag\u00E9es non trouv\u00E9e
VERB015=taille du cache de classes partag\u00E9es
PORT012=Erreur \: bit PACE d\u00E9fini dans la fonction 68K.
VERB014=m\u00E9moire maximale
PORT011=M\u00E9moire satur\u00E9e
VERB013=incr\u00E9ment de segment des classes ROM
PORT010=Permission refus\u00E9e
VERB012=incr\u00E9ment de segment des classes RAM
VERB011=taille de pile des unit\u00E9s d'ex\u00E9cution Java
VERB010=taille maximale de pile des unit\u00E9s d'ex\u00E9cution Java
EXEX009=\  -verify          activer la v\u00E9rification des fichiers de classe.\n  -X               imprimer l'aide sur les options non standard.
EXEX008=\  -verbose[\:class,gc,stack,sizes]\n                   activer la sortie prolixe (par d\u00E9faut\=class).\n
EXEX007=\  -jcl\:<config>[\:options]\n                   indiquer la biblioth\u00E8que partag\u00E9e JCL \u00E0 utiliser (par exemple, cdc, cldc, ...).\n
EXEX006=\  -debug\:<options> activer le d\u00E9bogage, <options> JDWP standard.\n
EXEX005=\  -D<prop>\=<val>   d\u00E9finir la valeur d'une propri\u00E9t\u00E9 syst\u00E8me.\n
EXEX004=\  -jxespace\:<adrPhysique>,<taille>,<adrLogique>\n                   mapper la r\u00E9gion de m\u00E9moire pour les jxe, (valeurs hexad\u00E9cimales).\n  -jxeaddr\:<adrLogique>\n                   ex\u00E9cuter un jxe directement depuis la m\u00E9moire, (adresse hexad\u00E9cimale).
EXEX003=\  -jxe\:<fichier_jxe>   ex\u00E9cuter le fichier jxe nomm\u00E9.
EXEX002=\n[options]\n  -classpath <chemin>\n  -cp <chemin>       d\u00E9finir le chemin d'acc\u00E8s aux classes sur <chemin>.
EXEX001=Syntaxe \:\t%s [options] -jxe\:<fichier_jxe> [arguments...]
EXEX000=Syntaxe \:\t%s [options] classname [arguments...]
PORT009=Fichier introuvable
PORT008=Architecture de module incorrecte
PORT007=Il ne s'agit pas d'un module
VERB009=incr\u00E9ment de pile des unit\u00E9s d'ex\u00E9cution Java
PORT006=Format de module incorrect
VERB008=taille initiale de pile des unit\u00E9s d'ex\u00E9cution Java
PORT005=Impossible de charger le module
VERB007=taille de pile d'unit\u00E9s d'ex\u00E9cution du syst\u00E8me d'exploitation
PORT004=Echec de la r\u00E9solution de symboles
VERB006=Echec de l'initialisation
PORT003=Impossible de charger le module d\u00E9pendant %s
VERB005=Erreur \: Nom de fichier manquant pour -Xverbosegclog
PORT002=Erreur inconnue lors du chargement de la biblioth\u00E8que partag\u00E9e
VERB004=Erreur \: Le nombre de cycles associ\u00E9 \u00E0 -Xverbosegclog doit \u00EAtre positif
PORT001=Echec de l'allocation de m\u00E9moire.
VERB003=Erreur \: Le nombre de fichiers associ\u00E9 \u00E0 -Xverbosegclog doit \u00EAtre positif
PORT000=
VERB002=Pile prolixe \: L'utilisation maximale des piles Java/C \u00E9tait de  %1$zd/%2$zd octets
VERB001=
VERB000=Pile prolixe \: "%2$.*1$s" a utilis\u00E9 %3$zd/%4$zd octets sur les piles Java/C
MECK002=Une erreur s'est produite lors de la cr\u00E9ation de la structure de donn\u00E9es du site d'appel. Les informations de site d'appel ne seront pas affich\u00E9es
MECK001=Option -Xcheck\:memory non reconnue \: %s
MECK000=Une erreur s'est produite lors de l'initialisation de l'utilitaire -Xcheck\:memory
CFRE099=modificateurs de m\u00E9thode non autoris\u00E9s
CFRE098=la signature de la variable locale doit \u00EAtre une cha\u00EEne
CFRE097=entr\u00E9e de classe interne en double dans l'attribut InnerClasses
CFRE096=la cible n'est pas une instruction dans le bytecode de switch
CFRE095=les annotations doivent \u00EAtre des interfaces
CFRE094=le bytecode d'instanceof doit faire r\u00E9f\u00E9rence \u00E0 une classe
CFRE093=la m\u00E9thode ne peut \u00EAtre que l'un de ces types au plus \: public, private ou protected
CFRE092=signature non valide
CFRE091=le PC de d\u00E9marrage du gestionnaire d'exception n'est pas une instruction
CFRE090=le bytecode de new ne peut pas cr\u00E9er de tableau
CFRE089=nom et type attendus
CFRE088=le nom de variable locale doit \u00EAtre une cha\u00EEne
CFRE087=le bytecode de m\u00E9thode d'interface doit r\u00E9f\u00E9rencer un \u00E9l\u00E9ment InterfaceMethodref
CFRE086=la m\u00E9thode contient deux attributs Code
CFRE085=le nom interne doit \u00EAtre une cha\u00EEne
CFRE084=aucune erreur
CFRE083=la classe est de type abstract et final
CFRE082=la m\u00E9thode <init> ne doit pas \u00EAtre de type static, final, synchronized, native ou abstract
CFRE081=le fichier source doit \u00EAtre de type UTF8
CFRE080=signature de m\u00E9thode non valide
J2JX099=Option(s) incompl\u00E8te(s) sur la ligne de commande. La premi\u00E8re \u00E9tait \: %s
J2JX098=Argument [%1$s] non valide pour l'option \: %2$s
DUMP024=La pr\u00E9paration de segment de m\u00E9moire demand\u00E9e n'a pas \u00E9t\u00E9 effectu\u00E9e car un acc\u00E8s exclusif n'a pas \u00E9t\u00E9 demand\u00E9 ou n'a pas pu \u00EAtre obtenu.
J2JX097=Option(s) non identifi\u00E9e(s) sur la ligne de commande. La premi\u00E8re \u00E9tait \: %s
DUMP023=La compression de segment de m\u00E9moire demand\u00E9e n'a pas \u00E9t\u00E9 effectu\u00E9e car un acc\u00E8s exclusif n'a pas \u00E9t\u00E9 demand\u00E9 ou n'a pas pu \u00EAtre obtenu.
J2JX096=Impossible de trouver la fonction j9bcv_verifyCreateStackAttributes
DUMP022=Le vidage des segments de m\u00E9moire demand\u00E9 n'a pas \u00E9t\u00E9 effectu\u00E9 car un acc\u00E8s exclusif n'a pas \u00E9t\u00E9 demand\u00E9 ou n'a pas pu \u00EAtre obtenu.
J2JX095=Impossible de trouver la fonction j9bcv_verifyClassStructure
DUMP021=Plusieurs heapdumps \u00E0 la fois ont \u00E9t\u00E9 demand\u00E9s, mais %%id est absent du libell\u00E9 du fichier \: les dumps vont se remplacer les uns les autres
J2JX094=Echec de l'ouverture du v\u00E9rificateur de DLL %1$s \: %2$s
DUMP020=Le dump %s a \u00E9t\u00E9 \u00E9crit
J2JX093=Aucun fichier de classe indiqu\u00E9 sur la ligne de commande
J2JX092=Erreur interne li\u00E9e \u00E0 la machine virtuelle nouvellement cr\u00E9\u00E9e
J2JX091=Cr\u00E9ation de la machine virtuelle Java r\u00E9ussie
J2JX090=Tentative de cr\u00E9ation d'une machine virtuelle Java utilisable avec AOT
CFRE079=PC du gestionnaire d'exception non valide
CFRE078=l'index de la classe de la m\u00E9thode englobante doit faire r\u00E9f\u00E9rence \u00E0 une classe
CFRE077=les interfaces doivent \u00EAtre de type abstract
CFRE076=nombre magique incorrect
CFRE075=signature de variable locale non valide
CFRE074=aucun attribut Code indiqu\u00E9
CFRE073=attribut StackMap/StackMapTable trouv\u00E9 hors de l'attribut Code
CFRE072=entr\u00E9es non tri\u00E9es dans le bytecode de lookupswitch
CFRE071=le tableau de bytecode est vide
CFRE070=PC de num\u00E9ro de ligne non valide
DUMP019=JVM a demand\u00E9 un dump %s
DUMP018=L'\u00E9v\u00E9nement demand\u00E9 n'est pas disponible \: ex\u00E9cutez la commande avec -Xdump\:indicateur dynamique
DUMP017=Abandon en cours \: Impossible de compresser le fichier (%s)
DUMP016=Abandon en cours \: Impossible de cr\u00E9er le fichier (%s)
J2JX089=Erreur interne \: %1$s introuvable dans %2$s
DUMP015=Abandon en cours \: Impossible d'ouvrir ou de lire (%s)
J2JX088=Erreur interne \: \u00E9chec de l'ouverture de %1$s \: %2$s
DUMP014=Action de la VM non identifi\u00E9e \: ...%s
J2JX087=Erreur interne \: impossible de d\u00E9terminer le nom de l'ex\u00E9cutable
DUMP013=Ev\u00E9nement de dump trait\u00E9 "%1$s", d\u00E9tails "%3$.*2$s".
J2JX086=%1$i enregistr\u00E9s dans le fichier de symboles %2$s
DUMP012=Erreur dans le dump %1$s \: %2$s
J2JX085=Erreur interne \: code erreur non pris en charge \u00E0 partir de create rom class %d
DUMP011=Le dump %1$s a g\u00E9n\u00E9r\u00E9 le processus %2$d
J2JX084=
DUMP010=Dump %1$s \u00E9crit dans %2$s
J2JX083=Inclusion de  %s dans AOT
J2JX082=Exclusion de %s de AOT
J2JX081=Erreur \: %s
J2JX080=Erreur de v\u00E9rification dans la m\u00E9thode %1$i (%3$.*2$s%5$.*4$s) pour le PC %6$i
CFRE069=longueur d'attribut sup\u00E9rieure aux donn\u00E9es d'attribut
CFRE068=nom de classe non valide
CFRE067=balise d'entr\u00E9e de pool de constantes inconnue
CFRE066=plusieurs attributs InnerClasses
CFRE065=attributs de m\u00E9thode eglobante multiples
CFRE064=le descripteur doit \u00EAtre une cha\u00EEne de type UTF8
CFRE063=le bytecode d'invoke appelle une m\u00E9thode non valide
CFRE062=nombre maximum de variables locales inf\u00E9rieur \u00E0 la taille des arguments
CFRE061=le nom doit \u00EAtre une cha\u00EEne de type UTF8
CFRE060=le PC de fin du gestionnaire d'exception n'est pas une instruction ni la fin d'un tableau de bytecodes
DUMP009=Dump %s non disponible
DUMP008=utilisation de "%s"
DUMP007=JVM demande un dump %1$s en utilisant '%2$s'
DUMP006=Traitement de l'\u00E9v\u00E9nement de dump en cours "%1$s", d\u00E9tails "%3$.*2$s" - Veuillez patienter.
J2JX079=Erreur \: %1$s \u00E0 %2$i
DUMP005=Ex\u00E9cutable manquant
J2JX078=Action recommand\u00E9e \:
DUMP004=Nom de fichier manquant
J2JX077=Fichier de classe incorrect
DUMP003=Dump nomm\u00E9 non identifi\u00E9 \: %s
J2JX076=Fichier de classe incorrect \: %s
DUMP002=Zone libell\u00E9 non reconnue \: %%%1$c
J2JX075=Nom d'entr\u00E9e trop long \: %s
DUMP001=Ev\u00E9nement de dump non identifi\u00E9 \: ...%s
J2JX074=Tentative d'ajour d'une entr\u00E9e en double au JXE \: %s
DUMP000=Option de dump non identifi\u00E9e \: -Xdump\:%s
J2JX073=Traitement du fichier \: %s
J2JX072=Impossible d'ouvrir le r\u00E9pertoire %s
J2JX071=Traitement du r\u00E9pertoire \: %s
J2JX070=augmentation de l'espace \: %i octets
CFRE059=le PC du gestionnaire d'exception n'est pas une instruction
CFRE058=index de variable locale non compris dans la plage autoris\u00E9e lors du retour de sous-routine
CFRE057=le type du gestionnaire d'exception doit \u00EAtre une classe
CFRE056=nombre d'arguments de bytecode d'invokeinterface incorrect
CFRE055=PC de fin du gestionnaire d'exception non valide
CFRE054=le bytecode de zone doit r\u00E9f\u00E9rencer un \u00E9l\u00E9ment Fieldref
CFRE053=la m\u00E9thode contient plus de 255 emplacements d'argument
CFRE052=la classe externe doit \u00EAtre une classe
CFRE051=la constante cha\u00EEne doit \u00EAtre une cha\u00EEne
CFRE050=la m\u00E9thode de l'interface doit \u00EAtre d\u00E9clar\u00E9e public et abstract
J2JX069=taille m\u00E9moire estim\u00E9e \: %i octets
J2JX068=taille de fichier \: %i octets
J2JX067=Aucune classe valide trouv\u00E9e dans %s
J2JX066=Impossible d'ouvrir le fichier \: %s
J2JX065=Erreur de fermeture du fichier zip \: %s
J2JX064=Les valeurs valides de l'option -precompileTarget sont \:
J2JX063=Valeurs par d\u00E9faut \:
J2JX062=classfile(s)                les fichiers se terminant par .class, .jar ou .zip\n                            seront examin\u00E9s et ajout\u00E9s au jxe\n
SHRC287=
J2JX061=Options de compilation AOT \:\n  -[no]precompile           [ne pas] marquer toutes les m\u00E9thodes pour pr\u00E9-compilation\n  -[no]precompileMethod xxx [ne pas] marquer les m\u00E9thodes nomm\u00E9es pour pr\u00E9-compilation\n  -[no]compileAheadOfTime   compiler \u00E0 l'avance la m\u00E9thode marqu\u00E9e\n  -precompileTarget xxx     g\u00E9n\u00E9rer un jxe pour l'architecture et le syst\u00E8me d'exploitation cible xxx\n  -precompileOptions xxx    transmettre  xxx au moteur de pr\u00E9-compilation\n  -[no]precompileResolve    [ne pas] tenter de r\u00E9soudre les r\u00E9f\u00E9rences externes lors de la pr\u00E9-compilation\n  -[no]stripBytecode        [ne pas] effectuer un strip sur le bytecode pour les m\u00E9thodes compil\u00E9es aot\n
SHRC286=Cache de classes partag\u00E9es %1$s ouvert en lecture seule
J2JX060=\  -j2se                     option utilisable avec jar2jxe dans un environnement J2SE\n
SHRC285=Cache permanent de classes partag\u00E9es %1$s ouvert en lecture seule
SHRC284=Impossible de cr\u00E9er un cache en mode de lecture seule
CFRE049=le bytecode de checkcast doit faire r\u00E9f\u00E9rence \u00E0 une classe
SHRC283=Ouvrez le cache avec des droits en lecture seule
CFRE048=index de variable locale non compris dans la plage autoris\u00E9e lors du stockage
SHRC282=La taille de page du syst\u00E8me d'exploitation est incompatible avec ce cache. Tentative de recr\u00E9ation du cache.
CFRE047=la classe de l'interface doit uniquement \u00EAtre \: public, abstract ou annotation
SHRC281=Tentative de suppression de tous les caches dans cacheDir %s
CFRE046=remplissage de bytecode de switch incorrect
SHRC280=Cr\u00E9ation d'une liste de tous les caches dans cacheDir %s
CFRE045=index de pool de constantes non compris dans la plage autoris\u00E9e
CFRE044=l'emplacement r\u00E9serv\u00E9 du bytecode d'invokeinterface n'est pas \u00E9gal \u00E0 z\u00E9ro
CFRE043=le bytecode ne peut pas \u00EAtre \u00E9largi
CFRE042=taille du tableau de bytecode > 65535
CFRE041=version inf\u00E9rieure incorrecte
CFRE040=longueur d'attribut inf\u00E9rieure aux donn\u00E9es d'attribut
J2JX059=\  -[no]tools                le r\u00E9pertoire des outils est [n'est pas] ajout\u00E9 \u00E0 la liste des r\u00E9pertoires d'extensions
J2JX058=\  -padJxe                   adjoindre le jxe avec xxx octets suppl\u00E9mentaires
J2JX057=\  -[no]segmented            [ne pas] g\u00E9n\u00E9rer des jxe \u00E0 segments multiples\n  -maxSegmentSize xxx       taille maximale des jxe segment\u00E9s (nombre hexad\u00E9cimal)\n  -maxSegmentSize seg\=xxx   taille maximale d'un jxe segment\u00E9 pr\u00E9cis (nombre hexad\u00E9cimal)\n  -locate xxx               localiser l'image \u00E0 l'adresse xxx (nombre hexad\u00E9cimal)\n  -locate seg\=xxx           localiser l'image d'un segment \u00E0 l'adresse hexad\u00E9cimale xxx
J2JX056=\  -fileExtension xxx        consid\u00E9rer les fichiers termin\u00E9s par .xxx comme des fichiers .jar
J2JX055=\  -vmOption xxx             utiliser vmOption xxx lors de l'ex\u00E9cution de jxe
J2JX054=\  -versionName xxx          d\u00E9finir le nom de version de jxe sur xxx
SHRC279=Recr\u00E9er le cache partag\u00E9 au d\u00E9marrage
J2JX053=\  -description xxx          d\u00E9finir la description du jxe sur xxx
SHRC278=L'utilitaire "%s" ne peut pas fonctionner sur un cache de classes incompatible "%s". Utilisez une machine JVM de niveau correct.
J2JX052=\  -uuid xxx                 d\u00E9finir l'UUID du jxe sur xxx
SHRC277=Pour ex\u00E9cuter l'utilitaire "%s" sur le cache de classes non permanent "%s", vous devez \u00E9galement utiliser la sous-option "nonpersistent"
J2JX051=\  -D xxx\=yyy                d\u00E9finir la propri\u00E9t\u00E9 syst\u00E8me xxx sur yyy
SHRC276=Pour ex\u00E9cuter l'utilitaire "%s" sur le cache de classes permanent "%s", n'utilisez pas la sous-option "nonpersistent"
J2JX050=\  -startupClass xxx         d\u00E9finir la classe de d\u00E9marrage en xxx\n  -noStartupClass           indiquer que le jxe ne poss\u00E8de pas de classe de d\u00E9marrage
SHRC275=D\u00E9finir l'emplacement des fichiers de cache JVM
SHRC274=Protection de page de m\u00E9moire d\u00E9sactiv\u00E9e pour le cache
CFRE039=index de variable locale non compris dans la plage autoris\u00E9e lors du chargement
SHRC273=Protection de page de m\u00E9moire par d\u00E9faut activ\u00E9e pour le cache
CFRE038=la m\u00E9thode contient deux attributs Exceptions
SHRC272=Protection de page de m\u00E9moire compl\u00E8te activ\u00E9e pour le cache
CFRE037=temp contient un type incorrect
SHRC271=Sous-option non reconnue pour l'option mprotect\=
CFRE036=la cible n'est pas une instruction dans le bytecode de jump
SHRC270=Configurer la protection des pages de m\u00E9moire cache
CFRE035=le bytecode de new doit faire r\u00E9f\u00E9rence \u00E0 une classe
CFRE034=bytecode incomplet
CFRE033=la plage de gestionnaires d'exception est vide
CFRE032=la superclasse de l'interface doit \u00EAtre java.lang.Object
CFRE031=l'exception \u00E9mise doit \u00EAtre une classe
CFRE030=superclasse de valeur null
J2JX049=\  -srcDir xxx               inclure tous les fichiers de l'arborescence de r\u00E9pertoires xxx
J2JX048=\  -outputFormat xxx         d\u00E9finir le format de sortie sur xxx (c, bin ou jar)
J2JX047=\  -o xxx                    d\u00E9finir le nom de fichier de sortie de base sur xxx
J2JX046=\  -be                       g\u00E9n\u00E9rer une sortie big-endian\n  -le                       g\u00E9n\u00E9rer une sortie little-endian
J2JX045=\  -version                  imprimer la version de ce programme
J2JX044=\  -[no]profile              [ne pas] g\u00E9n\u00E9rer un fichier .prf pour le profilage
SHRC269=Le syst\u00E8me ne prend pas en charge la protection des pages de m\u00E9moire
J2JX043=
SHRC268=[-Xshareclasses mise en cache des entries retransform\u00E9es d\u00E9sactiv\u00E9e]
J2JX042=\  -[no]verify               [ne pas] v\u00E9rifier le format de fichier de classe
SHRC267=D\u00E9sactiver la mise en cache de classes figurant dans le chemin d'acc\u00E8s aux classes d'amor\u00E7age
J2JX041=\  -q                        mode silencieux\n  -[no]logo                 [ne pas] imprimer le message de copyright\n  -verbose                  mode prolixe
SHRC266=[-Xshareclasses mise en cache des classes retransform\u00E9es activ\u00E9e]
J2JX040=Syntaxe \:\t%s [options] fichier(s) de classe\n\n[options]\n  -help, -?                 imprimer la syntaxe
SHRC265=Mettre en cache les classes retransform\u00E9es \u00E0 l'aide de JVMTI
SHRC264=Ne pas arrondir les zones de cache aux limites des pages
CFRE029=le bytecode de multianewarray doit faire r\u00E9f\u00E9rence \u00E0 une classe
SHRC263=Activer les pages pour la sortie prolixe de CompositeCache
CFRE028=le bytecode de ldc* doit faire r\u00E9f\u00E9rence \u00E0 une constante
SHRC262=Octets de donn\u00E9es         \= %d
CFRE027=le bytecode de multianewarray doit faire r\u00E9f\u00E9rence \u00E0 une classe array
SHRC261=Activer la sortie prolixe pour les donn\u00E9es internes de type cha\u00EEne
CFRE026=type de bytecode de newarray non reconnu
SHRC260=Echec de la cr\u00E9ation du pool dans ByteDataManager
CFRE025=la zone contient deux attributs ConstantValue
CFRE024=le nom de classe doit \u00EAtre une cha\u00EEne
CFRE023=pool de constantes vide
CFRE022=thisClass doit \u00EAtre une classe
CFRE021=zone en double
CFRE020=PC de d\u00E9but du gestionnaire d'exception non valide
J2JX039=IBM est une marque d'IBM Corp.\nJava ainsi que toutes les marques et logos incluant Java\n sont des marques de Sun Microsystems, Inc.
J2JX038=El\u00E9ments sous licence - Propri\u00E9t\u00E9 d'IBM
J2JX037=
J2JX036=Cible \: %s\n
J2JX035=(c) Copyright IBM Corp. 1991, 2005  All Rights Reserved
J2JX034=J9 Java JAR to JXE, Version %s
SHRC259=Impossible d'entrer le mutex de table de hachage Manager
J2JX033=Erreur interne \: \u00E9chec de la compilation de la classe rom d'erreurs
SHRC258=Impossible d'allouer de la m\u00E9moire pour l'entr\u00E9e de table de hachage dans Manager
J2JX032=Nombre impair de guillemets dans la liste de param\u00E8tres
SHRC257=Impossible d'allouer de la m\u00E9moire pour l'\u00E9l\u00E9ment de liste li\u00E9e dans Manager
J2JX031=Lecture du fichier JAR termin\u00E9 \: %s
SHRC256=Le cache partag\u00E9 permanent "%1$s" a \u00E9t\u00E9 d\u00E9truit
J2JX030=Erreur de lecture de %1$s depuis %2$s
SHRC255=Erreur de mise \u00E0 jour de l'heure de la derni\u00E8re d\u00E9connexion du fichier de cache de classes partag\u00E9es lors de l'arr\u00EAt de la JVM
SHRC254=Erreur lors de la d\u00E9finition de la longueur du fichier de cache de classes partag\u00E9es
CFRE019=d\u00E9but de PC de variable locale non valide
SHRC253=Erreur lors de l'\u00E9criture de l'en-t\u00EAte du fichier de cache de classes partag\u00E9es
CFRE018=la classe interne doit \u00EAtre une classe
SHRC252=Erreur lors de la recherche dans le fichier de cache de classes partag\u00E9es
CFRE017=plusieurs attributs StackMap/StackMapTable
SHRC251=N'effectuez pas l'auto-suppression des caches \u00E0 partir d'ID de g\u00E9n\u00E9ration diff\u00E9rents
CFRE016=index de variable locale non compris dans la plage autoris\u00E9e lors de l'incr\u00E9ment
SHRC250=Le cache ne peut \u00EAtre ouvert en lecture seule, car il n'a pas encore \u00E9t\u00E9 initialis\u00E9
CFRE015=les interfaces doivent \u00EAtre des classes
CFRE014=attribut de code indiqu\u00E9 pour une m\u00E9thode abstraite ou native
CFRE013=longueur du PC de variable locale non valide
CFRE012=la constante doit \u00EAtre une valeur
CFRE011=le bytecode de anewarray doit faire r\u00E9f\u00E9rence \u00E0 une classe
CFRE010=nombre n\u00E9gatif de paires correspondance/d\u00E9calage dans le bytecode de lookupswitch
J2JX029=Traitement en cours \: %s
J2JX028=Erreur de lecture de l'entr\u00E9e \u00E0 partir de %s
J2JX027=Impossible d'ouvrir ou de lire %s
J2JX026=
J2JX025=Tentative d'ajout de la classe en double \u00E0 JXE %s
J2JX024=fichier de classe ajout\u00E9 \: %s
SHRC249=Erreur \: le niveau de modification de l'en-t\u00EAte du fichier de cache de classes partag\u00E9es est incorrect
J2JX023=tentative d'ajout du fichier de classe %s en cours
SHRC248=Erreur \: la version de l'en-t\u00EAte du fichier de cache de classes partag\u00E9es est incorrecte
J2JX022=%s incorrect
SHRC247=Erreur \: l'identificateur de l'en-t\u00EAte du fichier de cache de classes partag\u00E9es est incorrect
J2JX021=Impossible de charger %1$s \: %2$s
SHRC246=Cache permanent des classes partag\u00E9es %1$s connect\u00E9
J2JX020=Taille de ncpRef [%1$x] passant de %2$u \u00E0 %3$u entr\u00E9es
SHRC245=Erreur lors du mappage du fichier de cache de classes partag\u00E9es
SHRC244=Erreur lors de l'obtention de la longueur du fichier de cache de classes partag\u00E9es
CFRE009=la zone de l'interface doit \u00EAtre d\u00E9clar\u00E9e comme \: public, static et final
SHRC243=Erreur lors de la lib\u00E9ration du verrou en lecture de la connexion au fichier de cache de classes partag\u00E9es
CFRE008=haut < bas dans le bytecode de tableswitch
SHRC242=Erreur lors de la mise \u00E0 jour de l'heure de la derni\u00E8re d\u00E9connexion du fichier de cache de classes partag\u00E9es
CFRE007=signature de zone incorrecte
SHRC241=Erreur \: Impossible de supprimer le fichier de cache de classes partag\u00E9es
CFRE006=attribut StackMap/StackMapTable non valide
SHRC240=Erreur \: impossible d'acqu\u00E9rir le verrou en \u00E9criture de la connexion au fichier de cache de classes partag\u00E9es
CFRE005=interface en double
CFRE004=bytecode inconnu
CFRE003=version sup\u00E9rieure incorrecte
CFRE002=nom de m\u00E9thode non valide
CFRE001=%1$s; classe\=%3$.*2$s, d\u00E9calage\=%4$u
CFRE000=%1$s; classe\=%3$.*2$s, m\u00E9thode\=%5$.*4$s%7$.*6$s, pc\=%8$u
J2SE000=\n
J2JX019=Taille de la m\u00E9moire tampon [%1$x] passant de %2$u \u00E0 %3$u
J2JX018=Cr\u00E9ation de %s r\u00E9ussie
J2JX017=Echec de l'\u00E9criture de donn\u00E9es vers le fichier \: %s
J2JX016=Echec de cr\u00E9ation/effacement de fichier \: %s
J2JX015=Code erreur inconnu \: %d
J2JX014=Echec de l'initialisation d'AOT
SHRC239=Erreur \: impossible d'acqu\u00E9rir le verrou en \u00E9criture de l'en-t\u00EAte du fichier de cache de classes partag\u00E9es
J2JX013=Erreur interne \: \u00E9chec d'inversion de l'ordre des octets
J9CL015=Echec de la cr\u00E9ation d'une trace de pile (sans doute, \u00E0 cause d'un manque de m\u00E9moire du syst\u00E8me d'exploitation)
SHRC238=Erreur \: le cache de classes partag\u00E9es n'est pas connect\u00E9
J2JX012=UUID fourni incorrect
J9CL014=
SHRC237=Cache permanent des classes partag\u00E9es %1$s ouvert
J2JX011=Erreur interne \: entr\u00E9e ZIP ouverte
J9CL013=Echec de l'allocation du moniteur syst\u00E8me
J9GC063=Impossible d'ouvrir le fichier '%s' en \u00E9criture
SHRC236=Cache permanent des classes partag\u00E9es %1$s cr\u00E9\u00E9
J2JX010=Erreur interne \: \u00E9chec de la lecture
J9CL012=
J9GC062=La valeur de %s doit \u00EAtre une puissance de deux
SHRC235=Erreur lors de la lib\u00E9ration du verrou en lecture de la connexion au fichier de cache de classes partag\u00E9es
J9CL011=Echec du processus de traitement en parall\u00E8le pour l'unit\u00E9 d'ex\u00E9cution syst\u00E8me
J9GC061=taille maximale d'espace m\u00E9moire sectoris\u00E9
SHRC234=Erreur lors de l'acquisition du verrou en lecture de la connexion au fichier de cache de classes partag\u00E9es
J9CL010=Impossible d'allouer JNIEnv
J9GC060=taille d'espace m\u00E9moire p\u00E9renne
SHRC233=Erreur lors de la cr\u00E9ation de l'en-t\u00EAte du fichier de cache de classes partag\u00E9es
SHRC232=Impossible de cr\u00E9er un cache en mode de lecture seule
SHRC231=Erreur lors de la d\u00E9finition de la longueur du fichier de cache de classes partag\u00E9es
SHRC230=Erreur lors de l'initialisation de l'en-t\u00EAte des donn\u00E9es du cache partag\u00E9
J2JX009=Erreur interne \: \u00E9chec de la recherche
J2JX008=Erreur interne \: aucune entr\u00E9e
J2JX007=Erreur interne \: entr\u00E9e en double
J9CL009=Unit\u00E9 d'ex\u00E9cution d\u00E9j\u00E0 lanc\u00E9e
J9GC059=-Xgcpolicy\:metronome n'est pas autoris\u00E9 sans l'option -Xrealtime
J2JX006=M\u00E9moire satur\u00E9e
J9CL008=Valeur de d\u00E9lai en nanosecondes hors intervalle
J9GC058=Echec de l'allocation de l'espace m\u00E9moire p\u00E9renne
J2JX005=Erreur interne \: tailles diff\u00E9rentes
J9CL007=La valeur du d\u00E9lai est n\u00E9gative
J9GC057=%1$s ne doit pas \u00EAtre sup\u00E9rieur \u00E0 %2$s
J2JX004=Erreur interne \: CRC diff\u00E9rents
J9CL006=Aucune donn\u00E9e de pr\u00E9-v\u00E9rification pour java/lang/Object
J9GC056=tailles de page volumineuses disponibles \:
SHRC229=Erreur \: en-t\u00EAte non valide dans le fichier de cache de classes partag\u00E9es
J2JX003=Erreur interne \: argument de fonction incorrect
J9CL005=Version de biblioth\u00E8que de classes incompatible \: machine virtuelle v%1$i requise, v%2$i identifi\u00E9e
J9GC055=taille de page volumineuse
SHRC228=Erreur lors de la mise \u00E0 jour de l'heure de la derni\u00E8re connexion au cache de classes partag\u00E9es
J2JX002=%1$d m\u00E9thode(s) sur %2$d pr\u00E9compil\u00E9e(s) pour la cible %3$s.
J9CL004=Version de biblioth\u00E8que de classes incompatible \: v%1$i attendue pour JCL, v%2$i identifi\u00E9e
J9GC054=La taille de page volumineuse %1$zu%2$s n'est pas une taille prise en charge, %3$zu%4$s utilis\u00E9 \u00E0 la place.
SHRC227=Erreur lors de l'acquisition du verrou d'\u00E9criture de l'en-t\u00EAte du fichier de cache de classes partag\u00E9es
J2JX001=Ressource stock\u00E9e \: %s
J9CL003=Version de biblioth\u00E8que de classes incompatible \: JCL %1$x, VM %2$x
J9GC053=m\u00E9moire maximale
SHRC226=Erreur lors de l'ouverture du fichier de cache de classes partag\u00E9es
J2JX000=Tentative d'ajout de fichier de ressources [%s] en double, fichier ignor\u00E9.
J9CL002=Classes issues d'une biblioth\u00E8que non-J9 ou de JXE r\u00E9duit de fa\u00E7on incorrecte
J9GC052=incr\u00E9ment de segment des classes ROM
SHRC225=Erreur lors de l'obtention du chemin du fichier de cache
J9CL001=Tentative d'ex\u00E9cution avec -jcl\:%s
J9GC051=incr\u00E9ment de segment des classes RAM
SHRC224=M\u00E9moire insuffisante pour la copie locale du nom du cache
J9CL000=Biblioth\u00E8que de classe incompatible
J9GC050=m\u00E9moire maximale approximable
SHRC223=Impossible de cr\u00E9er/utiliser des caches de classes partag\u00E9es permanents, car le verrouillage de fichiers n'est pas pris en charge
SHRC222=Les caches de classes partag\u00E9es permanents ne peuvent pas \u00EAtre cr\u00E9\u00E9s/utilis\u00E9s car le mappage de m\u00E9moire ne prend pas en charge les fonctions requises
SHRC221=Message d'erreur de la plateforme \: %1$s
SHRC220=Code d'erreur au niveau du port \= %1$d
J9GC049=taille d'ensemble m\u00E9moris\u00E9
J9GC048=ancien incr\u00E9ment d'espace
J9GC047=ancienne taille d'espace maximale
J9GC046=ancienne taille d'espace initiale
SHRC219=[-Xshareclasses acc\u00E8s de groupe activ\u00E9 pour les nouveaux caches]
J9GC045=taille de m\u00E9moire initiale
SHRC218=[-Xshareclasses cache permanent d\u00E9sactiv\u00E9]
J9GC044=nouvelle taille d'espace maximale
SHRC217=[-Xshareclasses cache permanent activ\u00E9]
J9GC043=nouvelle taille d'espace initiale
SHRC216=Cr\u00E9er un cache de classes partag\u00E9es non permanent
J9GC042=La somme de %1$s et de %2$s est trop petite pour %3$s
SHRC215=Cr\u00E9er un cache de classes partag\u00E9es permanent
J9GC041=Type fvtest inconnu \: %s
SHRC214=Impossible d'entrer le mutex de table de hachage ByteDataManager
J9GC040=Option inconnue \: %s
SHRC213=Impossible d'allouer de la m\u00E9moire pour l'entr\u00E9e de table de hachage dans ByteDataManagerImpl
SHRC212=Stockage de donn\u00E9es de type octet pour la cl\u00E9 %.*s dans le cache partag\u00E9...
SHRC211=Recherche de donn\u00E9es de type octet pour la cl\u00E9 %.*s dans le cache partag\u00E9...
SHRC210=[-Xshareclasses sortie prolixe des donn\u00E9es de type octet activ\u00E9e]
J9GC039=*** %1$s obsol\u00E8te \: pr\u00E9f\u00E9rez %2$s ***
J9GC038=La valeur %s indiqu\u00E9e est trop \u00E9lev\u00E9e
J9GC037=%1$s n'est pas pris en charge avec des valeurs autres que %2$zu
J9GC036=La valeur de %1$s doit \u00EAtre sup\u00E9rieure \u00E0 %2$zu
SHRC209=Activer la sortie prolixe des donn\u00E9es de type octet
J9GC035=%s doit \u00EAtre suivi d'une valeur num\u00E9rique
SHRC208=Impossible d'allouer de la m\u00E9moire pour le pool d'\u00E9l\u00E9ments de table de hachage dans CompiledMethodManagerImpl
J9GC034=La valeur de %1$s doit \u00EAtre comprise de %2$zu \u00E0 %3$zu
SHRC207=Impossible d'entrer le mutex de table de hachage CompiledMethodManager
J9GC033=La valeur de %1$s doit \u00EAtre comprise de %2$.2f \u00E0 %3$.2f
SHRC206=Impossible d'allouer de la m\u00E9moire pour l'entr\u00E9e de table de hachage dans CompiledMethodManagerImpl
J9GC032=La configuration syst\u00E8me ne prend pas en charge l'option "%s"
SHRC205=Echec de la cr\u00E9ation d'un \u00E9l\u00E9ment de table de hachage dans CompiledMethodManagerImpl
J9GC031='%1$s' et '%2$s' sont incompatibles
SHRC204=Impossible de cr\u00E9er le mutex de table de hachage dans le gestionnaire de classes partag\u00E9es
J9GC030=La valeur de %1$s (%2$.2f) doit \u00EAtre au moins inf\u00E9rieure de %3$s \u00E0 la valeur de %4$s (%5$.2f)
SHRC203=Impossible de cr\u00E9er la table de hachage dans le gestionnaire de classes partag\u00E9es
SHRC202=Echec de l'initialisation des pools dans le gestionnaire de classes partag\u00E9es
SHRC201=\ Remplacement de %2$.*1$s r\u00E9ussi.
SHRC200=\ Recherche de %2$.*1$s r\u00E9ussie.
J9GC029=Erreur d'option \: '%s'
J9GC028=Option trop \u00E9lev\u00E9e \: '%s'
J9GC027=Option mal form\u00E9e \: '%s'
J9GC026=-Xverbosegclog n'a pas r\u00E9ussi \u00E0 allouer des structures internes
JNCK094=Erreur JNI dans %1$s \: Les donn\u00E9es r\u00E9f\u00E9renc\u00E9es par l'argument \#%2$d ont \u00E9t\u00E9 modifi\u00E9es lors de l'ex\u00E9cution de %3$s. Ces donn\u00E9es ont peut-\u00EAtre \u00E9t\u00E9 modifi\u00E9es par une autre unit\u00E9 d'ex\u00E9cution ou par un appel imbriqu\u00E9. Le r\u00E9sultat %4$s est peut-\u00EAtre incorrect et la machine virtuelle peut devenir instable
J9GC025=
JNCK093=Erreur JNI dans %s \: La m\u00E9thode n'est pas constructeur
J9GC024=La somme de %1$s et de %2$s est trop \u00E9lev\u00E9e pour le segment
JNCK092=\tvalist         v\u00E9rifier la r\u00E9utilisation de va_list
J9GC023=La somme de %1$s et de %2$s doit \u00EAtre \u00E9gale \u00E0 %3$s
JNCK091=Conseil d\u00E9tect\u00E9 dans le cadre de gestionnaire d'un \u00E9v\u00E9nement JVMPI ou JVMTI\n
J9GC022=La somme de %1$s et de %2$s est trop \u00E9lev\u00E9e pour %3$s
JNCK090=Avertissement d\u00E9tect\u00E9 dans le cadre de gestionnaire d'un \u00E9v\u00E9nement JVMPI ou JVMTI\n
J9GC021=La taille de %1$s doit \u00EAtre \u00E9gale \u00E0 %2$s
J9GC020=Taille de %s trop \u00E9lev\u00E9e pour le segment
JITM007=Le code AOT n'est pas compatible avec les param\u00E8tres de JVMPI/JVMTI. Le code AOT du cache de classes partag\u00E9es est ignor\u00E9.
JITM006=Le code AOT du cache de classes partag\u00E9es utilise une r\u00E8gle GC diff\u00E9rente de celle de la JVM en cours. Le code AOT du cache de classes partag\u00E9es est ignor\u00E9.  Le code AOT du cache de classes partag\u00E9es est ignor\u00E9.
JITM005=Un code AOT g\u00E9n\u00E9r\u00E9 avec une autre version de la JVM ne peut pas s'ex\u00E9cuter sur cette version de la JVM. Le code AOT du cache de classes partag\u00E9es est ignor\u00E9.
JITM004=Le code AOT du cache de classes partag\u00E9es ne peut pas s'ex\u00E9cuter sur ce processeur. Le code AOT du cache de classes partag\u00E9es est ignor\u00E9.
JITM003=Echec de l'initialisation de l'ex\u00E9cution de AOT. Le code AOT du cache de classes partag\u00E9es est ignor\u00E9.
JITM002=Erreur de stockage du code AOT dans le cache de classes partag\u00E9es. Le code AOT du cache de classes partag\u00E9es est ignor\u00E9.
JITM001=Espace insuffisant pour le code AOT dans le cache de classes partag\u00E9es. Nouveau code AOT non g\u00E9n\u00E9r\u00E9.
JITM000=Mat\u00E9riel non pris en charge [%d].
JNCK089=Erreur d\u00E9tect\u00E9e dans le cadre de gestionnaire d'un \u00E9v\u00E9nement JVMPI ou JVMTI\n
JNCK088=Avertissement JNI dans %1$s \: L'argument \#%2$d est une r\u00E9f\u00E9rence faible. Une r\u00E9f\u00E9rence faible peut avoir la valeur NULL \u00E0 tout moment. La r\u00E9f\u00E9rence doit \u00EAtre promue \u00E0 l'aide de NewLocalRef ou NewGlobalRef et doit \u00EAtre compar\u00E9e \u00E0 NULL avant l'appel \u00E0 %3$s
J9GC019=Taille de %1$s trop \u00E9lev\u00E9e pour %2$s
JNCK087=Erreur JNI dans %1$s \: L'argument \#%2$d n'est pas une ressource java/lang/reflect/Method ou java/lang/reflect/Constructor
J9GC018=Taille de %1$s trop faible pour %2$s
JNCK086=Avertissement JNI dans %1$s \: L'argument \#%2$d n'est pas une ressource java/nio/Buffer. %3$s renverra un code erreur
J9GC017=Taille de %1$s trop faible, taille minimale requise \: %2$zu %3$so
JNCK085=Conseil d\u00E9tect\u00E9 dans JNI_OnLoad, biblioth\u00E8que %.*s\n
J9GC016=Echec de l'allocation du segment survivant dans l'espace m\u00E9moire par d\u00E9faut
JNCK084=Avertissement d\u00E9tect\u00E9 dans JNI_OnLoad, biblioth\u00E8que %.*s\n
J9GC015=Echec de l'allocation de l'espace m\u00E9moire par d\u00E9faut
JNCK083=Erreur d\u00E9tect\u00E9e dans JNI_OnLoad, biblioth\u00E8que %.*s\n
J9GC014=Echec de l'allocation des segments de m\u00E9moire des classes de la machine virtuelle
JNCK082=Conseil d\u00E9tect\u00E9 dans le cadre ext\u00E9rieur d'une unit\u00E9 d'ex\u00E9cution connect\u00E9e\n
J9GC013=Echec de l'allocation des segments de m\u00E9moire des objets de la machine virtuelle
JNCK081=Avertissement d\u00E9tect\u00E9 dans le cadre ext\u00E9rieur d'une unit\u00E9 d'ex\u00E9cution connect\u00E9e\n
J9GC012=Echec de l'allocation des segments de m\u00E9moire de la machine virtuelle
JNCK080=Erreur d\u00E9tect\u00E9e dans le cadre ext\u00E9rieur d'une unit\u00E9 d'ex\u00E9cution connect\u00E9e\n
J9GC011=Echec de l'initialisation du pool d'espaces m\u00E9moire
J9GC010=Echec de l'initialisation de la gestion du finaliseur
VRFY040=le v\u00E9rificateur n'a pas pu allouer de m\u00E9moire native
JNCK079=Conseil d\u00E9tect\u00E9 dans %2$.*1$s.%4$.*3$s%6$.*5$s\n
JNCK078=Avertissement d\u00E9tect\u00E9 dans %2$.*1$s.%4$.*3$s%6$.*5$s\n
J9GC009=Echec de l'initialisation du mutex pour les statistiques du r\u00E9cup\u00E9rateur de place
JNCK077=Erreur d\u00E9tect\u00E9e dans %2$.*1$s.%4$.*3$s%6$.*5$s\n
J9GC008=Echec de l'initialisation des extensions de module
JNCK076=Erreur jnichk interne dans %s \: M\u00E9moire satur\u00E9e
J9GC007=Echec de l'initialisation, impossible d'analyser la ligne de commande
JNCK075=Erreur jnichk interne dans %1$s \: Descripteur 0x%2$x non identifi\u00E9
J9GC006=Echec de l'initialisation, m\u00E9moire satur\u00E9e
JNCK074=Conseil JNI dans %s \: La m\u00E9moire tampon semble ne pas \u00EAtre modifi\u00E9e. Utilisez JNI_ABORT au lieu du mode 0.
J9GC005=Echec de l'initialisation
JNCK073=Conseil JNI dans %1$s \: JNI_ABORT a \u00E9t\u00E9 indiqu\u00E9 mais n'a pas \u00E9t\u00E9 trait\u00E9 en raison de la modification des donn\u00E9es.\n(Donn\u00E9es d'origine \: CRC\=0x%2$x, nouvelles donn\u00E9es \: CRC\=0x%3$x).\nPuisque %4$s a renvoy\u00E9 le contenu r\u00E9el du tableau, les modifications ne seront pas annul\u00E9es. Il se peut que ce ne soit pas l'objectif vis\u00E9.
J9GC004=Echec de l'instanciation du r\u00E9cup\u00E9rateur de place global
JNCK072=Conseil JNI dans %1$s \: JNI_COMMIT a \u00E9t\u00E9 indiqu\u00E9 mais ne sera pas pris en compte.\nPuisque %2$s a renvoy\u00E9 le contenu r\u00E9el du tableau, la m\u00E9moire tampon ne sera plus valide apr\u00E8s cet appel. Il se peut que ce ne soit pas l'objectif vis\u00E9.
J9GC003=Echec de l'instanciation du r\u00E9partiteur de t\u00E2ches
JNCK071=Avertissement JNI \: La m\u00E9moire situ\u00E9e \u00E0 0x%1$p acquise par %2$s n'a pas \u00E9t\u00E9 lib\u00E9r\u00E9e avant le retour depuis le code natif. Il s'agit probablement d'une fuite de m\u00E9moire.
J9GC002=Echec de l'instanciation du segment. %1$zu%2$s demand\u00E9
JNCK070=Avertissement JNI dans %1$s \: Donn\u00E9es de tableau originales modifi\u00E9es entre %2$s et %3$s.\n(Donn\u00E9es d'origine \: CRC\=0x%4$x, nouvelles donn\u00E9es \: CRC\=0x%5$x).\nDu fait que %6$s a renvoy\u00E9 une copie du contenu du tableau, le nouveau contenu sera perdu.
J9GC001=Echec de l'instanciation du segment
J9GC000=Erreur interne, m\u00E9moire satur\u00E9e
VRFY039=bytecode inconnu
VRFY038=invokespecial sur une cible non valide
VRFY037=objet non initialis\u00E9 pendant un branchement en arri\u00E8re
VRFY036=pile en sous capacit\u00E9
VRFY035=aucune erreur
SHRC099=%1$d \: 0x%2$p ORPHAN \: %4$.*3$s \u00E0 0x%5$p.
VRFY034=PC cible non valide
SHRC098=\nStatistiques actuelles du cache "%s" \: \n
VRFY033=zone de type non compatible
SHRC097=Le cache partag\u00E9 "%s" est corrompu. Aucune nouvelle machine JVM ne sera autoris\u00E9e \u00E0 se connecter au cache.\n\tLes machines JVM existantes pourront continuer \u00E0 fonctionner, mais ne pourront pas mettre \u00E0 jour le cache.
VRFY032=r\u00E9cepteur incorrect pour <init>
SHRC096=Le cache partag\u00E9 "%s" est satur\u00E9. Utilisez -Xscmx pour d\u00E9finir la taille du cache.
VRFY031=tentative d'ex\u00E9cuter iinc sur un non entier
SHRC095=Les tentatives d'appel de markStale sur les \u00E9l\u00E9ments de cache partag\u00E9 ont \u00E9chou\u00E9
VRFY030=type incorrect sur la pile
SHRC094=El\u00E9ment orphelin trouv\u00E9 mais ROMClass local transmis \u00E0 addROMClassToCache
SHRC093=Fin inattendue d\u00E9tect\u00E9e d'une autre machine JVM lors de la mise \u00E0 jour
SHRC092=Echec ADD lors de la lecture du cache
SHRC091=Lecture de donn\u00E9es corrompues pour l'\u00E9l\u00E9ment 0x%p (type de donn\u00E9es non valide)
SHRC090=Impossible d'obtenir le mutex de cache dans le d\u00E9marrage SH_CacheMap
JNCK069=Avertissement JNI dans %1$s \: Fin hors intervalle (%2$d + %3$d > %4$d)
JNCK068=Avertissement JNI dans %1$s \: D\u00E9but ou index hors intervalle (%2$d >\= %3$d)
JNCK067=Avertissement JNI dans %1$s \: Longueur n\u00E9gative de r\u00E9gion (%2$d) indiqu\u00E9e
JNCK066=Avertissement JNI dans %1$s \: Index ou d\u00E9but n\u00E9gatif (%2$d) indiqu\u00E9
JNCK065=Avertissement JNI dans %1$s \: Passage automatique de la capacit\u00E9 de cadre de r\u00E9f\u00E9rences locales de %2$d \u00E0 %3$d. Les r\u00E9f\u00E9rences %4$d sont utilis\u00E9es.\nUtilisez EnsureLocalCapacity ou PushLocalFrame pour augmenter de mani\u00E8re explicite le cadre.
JNCK064=Avertissement JNI dans %1$s \: Passage automatique de la capacit\u00E9 du pool de r\u00E9f\u00E9rences faibles globales de %2$d en %3$d.\nIl peut s'agit d'un indicateur de perte de m\u00E9moire.
JNCK063=Avertissement JNI dans %1$s \: Passage automatique de la capacit\u00E9 du pool de r\u00E9f\u00E9rences globales de %2$d \u00E0 %3$d.\nIl peut s'agit d'un indicateur de perte de m\u00E9moire.
JNCK062=Erreur JNI dans %s \: Cette fonction ne doit pas \u00EAtre appel\u00E9e \u00E0 l'int\u00E9rieur d'une section critique
JNCK061=Avertissement JNI dans %1$s \: L'argument \#%2$d est une signature de zone mal form\u00E9e ("%3$s")
JNCK060=Avertissement JNI dans %1$s \: L'argument \#%2$d est une signature de m\u00E9thode mal form\u00E9e ("%3$s")
VRFY029=returnAddress non valide pour l'instruction ret
VRFY028=dimension incorrecte
VRFY027=r\u00E9cepteur incompatible avec la classe d\u00E9clarante
VRFY026=EOF inattendu
VRFY025=acc\u00E8s incorrect \u00E0 des donn\u00E9es prot\u00E9g\u00E9es
SHRC089=Impossible de cr\u00E9er le mutex d'actualisation dans SH_CacheMap
VRFY024=les arguments sont de type non compatible
SHRC088=Impossible de cr\u00E9er un cache en tant que ROMImageSegment dans SH_CacheMap
VRFY023=param\u00E8tre tableswitch non entier
SHRC087=Echec de MarkStale lors de ClasspathManager\:\:update()
VRFY022=les sous-routines doivent \u00EAtre r\u00E9analys\u00E9es pour chaque jsr
SHRC086=Impossible d'entrer le mutex de la table de hachage ClasspathManager
VRFY021=l'objet \u00E9mis ne peut pas \u00EAtre \u00E9mis
SHRC085=Impossible d'allouer de la m\u00E9moire pour l'en-t\u00EAte d'\u00E9l\u00E9ment de liste li\u00E9e
VRFY020=arguments appel\u00E9s de type non compatible
SHRC084=Impossible d'allouer de la m\u00E9moire pour l'\u00E9l\u00E9ment de liste li\u00E9e
SHRC083=Impossible d'allouer de la m\u00E9moire pour le tableau identifiedClasspaths dans SH_ClasspathManagerImpl2
SHRC082=Impossible de cr\u00E9er identifiedMutex dans SH_ClasspathManagerImpl2
SHRC081=Impossible de cr\u00E9er cpeTableMutex dans SH_ClasspathManagerImpl2
SHRC080=Impossible d'allouer de la m\u00E9moire pour l'entr\u00E9e de table de hachage
JNCK059=Avertissement JNI dans %1$s \: L'argument \#%2$d est un identificateur mal form\u00E9 ("%3$s")
JNCK058=Avertissement JNI dans %1$s \: Apr\u00E8s avoir appel\u00E9 %2$s et avant d'appeler %3$s, recherchez les exceptions \u00E0 l'aide de ExceptionCheck, ExceptionClear ou ExceptionOccurred
JNCK057=Erreur JNI dans %1$s \: N'utilisez pas %2$s pour lib\u00E9rer la m\u00E9moire 0x%3$p acquise \u00E0 l'aide de %4$s
JNCK056=Erreur JNI dans %1$s \: 0x%2$p de m\u00E9moire re\u00E7u de l'objet 0x%3$p ; lib\u00E9ration de 0x%4$p
VMUT002=(erreur d'acc\u00E8s)
JNCK055=Erreur JNI dans %1$s \: Le pointeur 0x%2$p n'a \u00E9t\u00E9 renvoy\u00E9 par aucune fonction JNI ou a d\u00E9j\u00E0 \u00E9t\u00E9 lib\u00E9r\u00E9
VMUT001=(unit\u00E9 d'ex\u00E9cution sans nom)
JNCK054=Erreur JNI dans %1$s \: Option de mode %2$d non identifi\u00E9e
VMUT000=(m\u00E9moire insuffisante)
JNCK053=Erreur JNI \: La section critique doit \u00EAtre lib\u00E9r\u00E9e avant le retour de la fonction
JNCK052=Erreur JNI dans %1$s \: La classe %3$.*2$s est obsol\u00E8te
JNCK051=Erreur VM interne dans %1$s \: Les octets transmis %2$p sont de taille inf\u00E9rieure aux octets de r\u00E9f\u00E9rence JNI %3$p
JNCK050=Erreur JNI dans %s \: PopLocalFrame appel\u00E9 sans cadre local sur la pile
VRFY019=\u00E9chec chargement de classe
VRFY018=nombre maximum de piles d\u00E9pass\u00E9
VRFY017=<init> n'appelle pas ce <init> ni super <init>
VRFY016=param\u00E8tre de d\u00E9calage du bytecode non entier
VRFY015=return multiples pour un m\u00EAme jsr
SHRC079=Impossible de cr\u00E9er la table de hachage dans SH_ClasspathManagerImpl2
VRFY014=bytecode retourn\u00E9 incompatible avec le type retourn\u00E9
SHRC078=Impossible de cr\u00E9er le pool linkedListHdr dans SH_ClasspathManagerImpl2
VRFY013=violation de contrainte de chargement de classe
SHRC077=Impossible de cr\u00E9er le pool linkedListImpl dans SH_ClasspathManagerImpl2
VRFY012=forme de la pile incoh\u00E9rente
SHRC076=Recherche de la classe %1$s dans le cache partag\u00E9 de l'ID chargeur de classe %2$d...
VRFY011=param\u00E8tre lookupswitch non entier
SHRC075=\ Echec.
VRFY010=plusieurs jsr utilisant un seul return
SHRC074=\ R\u00E9ussite.
SHRC073=Stockage de la classe %2$.*1$s dans le cache partag\u00E9 pour l'ID chargeur de classe %3$d d'URL %5$.*4$s (index %6$d)...
SHRC072=Option de ligne de commande "%s" non reconnue
SHRC071=L'option de ligne de commande "%s" requiert une sous-option
SHRC070=Mises \u00E0 jour incr\u00E9mentielles d\u00E9sactiv\u00E9es
JNCK049=Erreur JNI dans %s \: r\u00E9utilisation de va_list d\u00E9tect\u00E9e
JNCK048=Erreur JNI dans %s \: R\u00E9cepteur non \u00E9ligible
JNCK047=Erreur JNI dans %s \: Argument clazz incorrect
JNCK046=Erreur JNI dans %1$s \: Le type de retour ('%2$c') de la m\u00E9thode est erron\u00E9
JNCK045=Erreur JNI dans %s \: La m\u00E9thode n'est pas statique
JNCK044=Erreur JNI dans %s \: La m\u00E9thode est statique
JNCK043=Erreur JNI dans %1$s \: Argument \#%2$d ; %3$s introuvable
JNCK042=Erreur JNI dans %1$s \: L'argument \#%2$d n'est pas une sous-classe de %3$s
JNCK041=Erreur JNI dans %1$s \: L'argument \#%2$d se trouve hors intervalle pour un %3$s (0x%4$x > 0x%5$x)
JNCK040=Erreur JNI dans %1$s \: L'argument \#%2$d se trouve hors intervalle pour un %3$s (0x%4$x < 0x%5$x)
VRFY009=tableau de type non compatible
VRFY008=index de tableau non entier
VRFY007=m\u00E9thode de type final remplac\u00E9e
VRFY006=nouvelle taille de tableau non entier
VRFY005=variable locale de type non compatible
SHRC069=R\u00E9duction des conflits de stockages concurrents d\u00E9sactiv\u00E9e
VRFY004=la mise en ligne de jsr a rencontr\u00E9 un trop grand nombre de jsr
SHRC068=Mise en cache locale des chemins d'acc\u00E8s aux classes d\u00E9sactiv\u00E9e
VRFY003=la classe ne contient pas de donn\u00E9es de pr\u00E9-v\u00E9rification
SHRC067=V\u00E9rification de l'horodatage d\u00E9sactiv\u00E9e
VRFY002=s\u00E9quence bytecode non valide
SHRC066=Verrouillage des tables de hachage locales d\u00E9sactiv\u00E9
VRFY001=%1$s; classe\=%3$.*2$s, m\u00E9thode\=%5$.*4$s%7$.*6$s
SHRC065=Impossible d'allouer le pool dans shrinit
VRFY000=%1$s; classe\=%3$.*2$s, m\u00E9thode\=%5$.*4$s%7$.*6$s, pc\=%8$u
SHRC064=Impossible de cr\u00E9er configMonitor dans shrinit
SHRC063=Impossible d'allouer de la m\u00E9moire pour sharedClassConfig dans shrinit
SHRC062=Erreur lors de la copie du nom d'utilisateur dans le nom de cache par d\u00E9faut
SHRC061=Le nom de cache ne doit pas d\u00E9passer 64 caract\u00E8res. Cache non cr\u00E9\u00E9.
SHRC060=Impossible d'allouer de la m\u00E9moire pour la m\u00E9moire tampon de cha\u00EEnes dans shrinit\:\:hookFindSharedClass
JNCK039=Erreur JNI dans %1$s \: L'argument \#%2$d est NULL
JNCK038=Erreur JNI dans %1$s \: L'argument \#%2$d (0x%3$p) n'est pas une r\u00E9f\u00E9rence d'objet valide. Son type est \: %4$s\n
JNCK037=Erreur JNI dans %1$s \: L'argument \#%2$d (0x%3$p) n'est pas une r\u00E9f\u00E9rence locale. Son type est \: %4$s
JNCK036=Erreur JNI dans %1$s \: L'argument \#%2$d (0x%3$p) n'est pas une r\u00E9f\u00E9rence globale faible. Son type est \: %4$s
JNCK035=Erreur JNI dans %1$s \: L'argument \#%2$d (0x%3$p) n'est pas une r\u00E9f\u00E9rence globale. Son type est \: %4$s
JNCK034=Erreur JNI dans %1$s \: L'argument \#%2$d n'est pas un %3$s
JNCK033=Erreur JNI dans %1$s \: L'argument \#%2$d n'est pas un jarray
JNCK032=Erreur JNI dans %1$s \: L'argument \#%2$d n'est pas un jobjectArray
JNCK031=Erreur JNI dans %1$s \: L'argument \#%2$d est NULL
JNCK030=Erreur JNI dans %s \: Cette fonction ne peut \u00EAtre appel\u00E9e tandis que le GC est d\u00E9sactiv\u00E9 (elle a probablement \u00E9t\u00E9 appel\u00E9e \u00E0 partir d'un \u00E9v\u00E9nement JVMPI ou JVMTI)
JDTS000=Ecoute du transport dt_socket \u00E0 l'adresse \: %d
SHRC059=Impossible d'allouer de la m\u00E9moire pour ClasspathItem dans shrinit\:\:hookFindSharedClass
SHRC058=Impossible d'allouer de la m\u00E9moire pour ClasspathItem dans shrinit\:\:hookStoreSharedClass
SHRC057=Param\u00E8tres erron\u00E9s pour l'option d'expiration
SHRC056=Option de ligne de commande "%s" non reconnue
SHRC055=D\u00E9sactiver les mises \u00E0 jour incr\u00E9mentielles de cache
IREL001=
SHRC054=D\u00E9sactiver l'algorithme permettant de r\u00E9duire les conflits de stockage
IREL000=Code AOT de %1$s.jar g\u00E9n\u00E9r\u00E9 avec la VM %2$s ne s'ex\u00E9cute pas avec la VM %3$s.
SHRC053=D\u00E9sactiver le verrouillage local de table de hachage
SHRC052=D\u00E9sactiver la mise en cache locale des chemins d'acc\u00E8s aux classes
SHRC051=D\u00E9sactiver les mises \u00E0 jour dynamiques
SHRC050=Activer la sortie prolixe
JNCK029=Erreur JNI dans %s \: Cette fonction ne peut \u00EAtre appel\u00E9e \u00E0 l'int\u00E9rieur d'une section critique
JNCK028=Erreur JNI dans %s \: Cette fonction ne peut \u00EAtre appel\u00E9e quand une exception est en instance
JNCK027=Erreur JNI dans %s \: JNIEnv n'est pas l'\u00E9l\u00E9ment JNIEnv pour l'unit\u00E9 d'ex\u00E9cution active
JNCK026=Erreur JNI dans %s \: JNIEnv ne semble pas \u00EAtre une unit\u00E9 d'ex\u00E9cution valide, ou la m\u00E9moire a \u00E9t\u00E9 corrompue, ou il ne s'agit pas d'une machine virtuelle J9
JNCK025=Utilisez -Xcheck\:jni\:nonfatal pour poursuivre le traitement en cas d'erreurs.
JNCK024=Erreur JNI d\u00E9tect\u00E9e. Abandon du traitement.
JNCK023=Erreur JNI d\u00E9tect\u00E9e. Poursuite du traitement...
JNCK022=r\u00E9f\u00E9rence locale lib\u00E9r\u00E9e(?)
JNCK021=r\u00E9f\u00E9rence locale dans une autre unit\u00E9 d'ex\u00E9cution
JNCK020=r\u00E9f\u00E9rence du d\u00E9bogueur
SHRC049=Mode d\u00E9bogage v\u00E9rifiant tout le bytecode entrant
SHRC048=Dresser la liste de tous les \u00E9l\u00E9ments du cache
SHRC047=Afficher le r\u00E9capitulatif des statistiques de cache
SHRC046=Afficher tous les caches partag\u00E9s et leurs statistiques
SHRC045=D\u00E9truire les caches inutilis\u00E9s pendant <t> minutes
SHRC044=OPTION_MODIFIED_EQUALS"<modContext>"
SHRC043=Activer le partage de bytecode modifi\u00E9\n\t<modContext> est le descripteur utilisateur du type de modification\n\tLes JVM utilisant le m\u00EAme <modContext> doivent utiliser les m\u00EAmes modifications
SHRC042=D\u00E9truire tous les caches partag\u00E9s
SHRC041=D\u00E9truire le cache partag\u00E9 (utiliser le param\u00E8tre de nom ou la valeur par d\u00E9faut)
SHRC040=Indiquer le nom d'un cache partag\u00E9
JNCK019=r\u00E9f\u00E9rence globale faible
JNCK018=r\u00E9f\u00E9rence globale
JNCK017=r\u00E9f\u00E9rence locale
JNCK016=NULL
JNCK015=\thelp           imprimer cet \u00E9cran
JNCK014=\tpedantic       effectuer des v\u00E9rifications plus pouss\u00E9es (mais plus longues)
JNCK013=\tnovalist       ne pas v\u00E9rifier la r\u00E9utilisation de va_list
JNCK012=\tnoadvice       ne pas afficher de conseil
JNCK011=\tnowarn         ne pas afficher les avertissements
JNCK010=\tnonfatal       ne pas quitter lorsque des erreurs sont d\u00E9tect\u00E9es
SHRC039=Afficher l'aide partag\u00E9e g\u00E9n\u00E9rale
SHRC038=Syntaxe \:\n\njava -Xshareclasses[\:option,...]\n\nOptions valides comprises (avec br\u00E8ve description) \:\n\n
SHRC037=Mises \u00E0 jour incr\u00E9mentielles d\u00E9sactiv\u00E9es
SHRC036=R\u00E9duction des conflits de stockages concurrents d\u00E9sactiv\u00E9e
SHRC035=Mise en cache locale des chemins d'acc\u00E8s aux classes d\u00E9sactiv\u00E9e
SHRC034=V\u00E9rification de l'horodatage d\u00E9sactiv\u00E9e
SHRC033=Verrouillage des tables de hachage locales d\u00E9sactiv\u00E9
SHRC032=Le niveau de modification du cache de classes partag\u00E9es auquel vous tentez de vous connecter est erron\u00E9.
SHRC031=La version de JVM du cache de classes partag\u00E9es auquel vous tentez de vous connecter est incompatible.
SHRC030=L'en-t\u00EAte du cache de classes partag\u00E9es auquel vous tentez de vous connecter est incorrect.
JNCK009=\tnobounds       ne pas effectuer de v\u00E9rification de bornes sur les cha\u00EEnes et les tableaux
JNCK008=\ttrace          tracer toutes les fonctions JNI
JNCK007=\tverbose        tracer certaines fonctions et activit\u00E9s JNI
JNCK006=\tall            v\u00E9rifier les classes d'application et syst\u00E8me
JNCK005=Syntaxe \: -Xcheck\:jni\:[option[,option[,...]]]
JNCK004=jnichk - Utilitaire de v\u00E9rification JNI pour J9, version %s
JNCK003=Utilitaire de v\u00E9rification JNI \: impossible d'allouer un espace de stockage local de machine virtuelle
JNCK002=Utilitaire de v\u00E9rification JNI \: impossible d'ancrer l'\u00E9v\u00E9nement
JNCK001=Utilitaire de v\u00E9rification JNI install\u00E9. Utilisez -Xcheck\:jni\:help
JNCK000=-Xcheck\:jni\: Option non identifi\u00E9e --> '%s'
J9TI032=R\u00E9initialise les options de vidage de la machine virtuelle.
J9TI031=Indique qu'une unit\u00E9 d'ex\u00E9cution a trait\u00E9 l'\u00E9v\u00E9nement asynchrone
J9TI030=Annule l'\u00E9v\u00E9nement asynchrone sur une seule unit\u00E9 d'ex\u00E9cution ou sur toutes les unit\u00E9s d'ex\u00E9cution
