#Wed Nov 05 17:43:40 EST 2008
SHRC029=N\u00E3o h\u00E1 mem\u00F3ria suficiente no sistema
SHRC028=Permiss\u00E3o Negada
SHRC027=O nome do cache compartilhado \u00E9 muito longo
SHRC026=N\u00E3o \u00E9 poss\u00EDvel criar cache do tamanho pedido\: Verifique as configura\u00E7\u00F5es de SHMMAX e SHMMIN
SHRC025=erro ao conectar mem\u00F3ria compartilhada
SHRC024=erro de desconex\u00E3o de mem\u00F3ria compartilhada
SHRC023=O cache n\u00E3o existe
SHRC022=Erro ao criar a regi\u00E3o de mem\u00F3ria compartilhada
SHRC021=Foi retornado um c\u00F3digo de erro desconhecido
SHRC020=Ocorreu um erro ao abrir o sem\u00E1foro
J9TI029=Sinaliza o evento ass\u00EDncrono em um \u00FAnico encadeamento ou em todos os encadeamentos
J9TI028=Relata o fim de um dump de RAS.
J9TI027=Relata o in\u00EDcio de um dump de RAS.
J9TI026=Aciona um dump utilizando a configura\u00E7\u00E3o de RAS fornecida.
J9TI025=Permitir JNI direta na presen\u00E7a de eventos de entrada e sa\u00EDda de m\u00E9todo (resultando em um prov\u00E1vel relat\u00F3rio impreciso de entrada e sa\u00EDda)
J9TI024=Sa\u00EDda de m\u00E9todo sem o valor de retorno.
J9TI023=Obter informa\u00E7\u00F5es estendidas sobre o quadro para uma lista de encadeamento
J9TI022=Obter informa\u00E7\u00F5es estendidas sobre o quadro para todos os rastreios de pilha
J9TI021=Obter informa\u00E7\u00F5es estendidas sobre o quadro
J9VM066=incompatibilidade de tipo de argumento
J9TI020=Obt\u00E9m o ID de encadeamento de S.O. de um jthread
J9VM065=o objeto n\u00E3o \u00E9 uma inst\u00E2ncia da classe de declara\u00E7\u00E3o
J9VM064=setDumpOption requer %s
J9VM063=seekDumpAgent requer %s
J9VM062=removeDumpAgent requer %s
J9VM061=insertDumpAgent requer %s
J9VM060=runNamedDump(%1$s) requer %2$s
SHRC019=o tamanho do pedido \u00E9 muito pequeno
SHRC018=n\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria
SHRC017=C\u00F3digo de erro\: %d
SHRC016=Erro do Cache de Classe Compartilhado\:
SHRC015=Erro do Cache de Classe Compartilhado\: Sinalizador inv\u00E1lido
SHRC014=A remo\u00E7\u00E3o de %s de sem\u00E1foro do cache compartilhado falhou
SHRC013=A remo\u00E7\u00E3o de %s de mem\u00F3ria do cache compartilhado falhou
SHRC012=N\u00E3o \u00E9 poss\u00EDvel remover o cache compartilhado %s, pois ainda h\u00E1 JVMs conectados ao cache
SHRC011=Erro\: N\u00E3o \u00E9 poss\u00EDvel abrir o cache de classes compartilhado
SHRC010=O cache compartilhado "%s" foi destru\u00EDdo
J9TI019=Configura o modo de notifica\u00E7\u00E3o para eventos estendidos, permitindo seletividade em n\u00EDvel de encadeamento
J9TI018=Configura um m\u00E9todo para notifica\u00E7\u00E3o seletiva de entrada e sa\u00EDda.
J9TI017=Controla v\u00E1rias op\u00E7\u00F5es de VM e de compila\u00E7\u00E3o.
J9TI016=Permitir seq\u00FCenciamento na presen\u00E7a de eventos de entrada e sa\u00EDda de m\u00E9todo (resultando em um prov\u00E1vel relat\u00F3rio impreciso de entrada e sa\u00EDda)
J9TI015=Solicita um dump JLM.
J9TI014=Controla o JLM (Java Lock Monitor) (COM_IBM_JLM_START, COM_IBM_JLM_START_TIME_STAMP, COM_IBM_JLM_STOP, COM_IBM_JLM_STOP_TIME_STAMP).
J9VM059=-Xscmaxaot ser\u00E1 ignorado se -Xshareclasses n\u00E3o for especificado
J9TI013=Permite retornos de chamada para aloca\u00E7\u00F5es instrument\u00E1veis (as n\u00E3o relatadas por VMObjectAlloc).
J9VM058=-Xscminaot ser\u00E1 ignorado se -Xshareclasses n\u00E3o for especificado
J9TI012=Inclua uma op\u00E7\u00E3o -Xdump din\u00E2mica
J9VM057=Limite do cache de monitor excedido
J9TI011=Inclua uma op\u00E7\u00E3o -Xtrace din\u00E2mica
J9VM056=Vers\u00E3o principal
J9TI010=Entrada do m\u00E9todo com informa\u00E7\u00F5es estendidas sobre o tipo de m\u00E9todo.
J9VM055=Erro fatal\: A vers\u00E3o Principal de JXE \u00E9 diferente de %d
J9VM054=Falha em criar um encadeamento\: retVal %1$d, errno %2$d
J9VM053=Op\u00E7\u00E3o malformada %s localizada em -Xoptionsfile
J9VM052=\   -Xjni\:arrayCacheMax\=[<x>|unlimited] define o tamanho m\u00E1ximo da matriz em cache JNI\n
J9VM051=Uso\:\n
J9VM050=-Xjni\: op\u00E7\u00E3o n\u00E3o reconhecida --> '%s'
SHRC009=Cache compartilhado aberto\: %1$s de tamanho\: %2$d bytes
SHRC008=Cache compartilhado criado\: %1$s de tamanho\: %2$d bytes
SHRC007=Falha em remover o cache de classe compartilhado %s
SHRC006=O n\u00FAmero de cache expirado nos \u00FAltimos %1$d minutos \u00E9 %2$d
SHRC005=N\u00E3o existem caches de classe de compartilhamento
SHRC004=N\u00E3o \u00E9 poss\u00EDvel destruir o cache %s
SHRC003=\u00FAltima desconex\u00E3o
SHRC002=em uso
SHRC001=OS shmid
SHRC000=Cache Compartilhado
J9TI009=Indica o fim de uma fase de compila\u00E7\u00E3o de JIT. (N\u00E3o \u00E9 seguro para retorno de chamada)
J9TI008=Indica o in\u00EDcio de uma fase de compila\u00E7\u00E3o de JIT. (N\u00E3o \u00E9 seguro para retorno de chamada)
J9TI007=Obtenha o conjunto atual de recursos estendidos por meio de capabilities_ptr.
J9TI006=Elimine os recursos estendidos de capabilities_ptr.
J9TI005=Inclua os novos recursos estendidos a partir de capabilities_ptr.
J9TI004=Retorna por meio do capabilities_ptr os recursos estendidos dispon\u00EDveis neste momento.
J9VM049=Tempos de suspens\u00E3o de JLM n\u00E3o suportados
J9TI003=Agent_OnLoad falhou para a biblioteca %s
J9VM048=Tempos de suspens\u00E3o de JLM suportados
J9TI002=Agent_OnLoad n\u00E3o localizado na biblioteca %s
J9VM047=JLM n\u00E3o suportado
J9TI001=A biblioteca do agente %1$s n\u00E3o p\u00F4de ser aberta (%2$s)
J9VM046=JLM suportado
J9TI000=Sem mem\u00F3ria, est\u00E1 tentando carregar a biblioteca do agente %s
J9VM045=Monitores de sistema de tr\u00EAs camadas n\u00E3o suportados
J9VM044=Monitores de sistema de tr\u00EAs camadas suportados
J9VM043=-----------------------
J9VM042=Configura\u00E7\u00E3o de Encadeamento
J9VM041=n\u00FAmero incorreto de argumentos
J9VM040=estouro de pilha do sistema operacional
CFRE118=bytes extras ap\u00F3s EOF
CFRE117=o campo n\u00E3o pode ser final e vol\u00E1til
CFRE116=o bytecode invoke deve referenciar um Methodref
CFRE115=dimens\u00F5es da matriz > 255
CFRE114=o nome de campo \u00E9 inv\u00E1lido
CFRE113=EOF inesperado
CFRE112=o VM n\u00E3o suporta verifica\u00E7\u00E3o din\u00E2mica
CFRE111=UTF8 malformado
CFRE110=constante incompat\u00EDvel para campo
J9VM039=-Xscmx ser\u00E1 ignorado se -Xshareclasses n\u00E3o for especificado
J9VM038=-Xthr\: op\u00E7\u00E3o n\u00E3o reconhecida --> '%s'
J9VM037=Falha em alocar o monitor
J9VM036=dividir por zero
J9VM035=Imposs\u00EDvel alocar OutOfMemoryError
J9VM034=JVMRI requer um mecanismo de rastreio\: execute com o sinalizador -Xtrace
J9VM033=Erro fatal\: falha em inicializar %s
J9VM032=Erro fatal\: n\u00E3o \u00E9 poss\u00EDvel carregar %1$s\: %2$s
J9VM031=A classe requerida %2$.*1$s deveria estar no caminho de classe de inicializa\u00E7\u00E3o, mas foi localizada no caminho de classe do aplicativo em %4$.*3$s
J9VM030=UTF8 inv\u00E1lido utilizado na fun\u00E7\u00E3o JNI
CFRE109=assinatura de m\u00E9todo inv\u00E1lida
CFRE108=o \u00EDndice de m\u00E9todo do m\u00E9todo de inclus\u00E3o deve referir-se a um nome e tipo
CFRE107=deslocamento fora do intervalo no bytecode jump
CFRE106=m\u00E9todo duplicado
CFRE105=superClass deve ser uma classe
CFRE104=o campo pode ser no m\u00E1ximo um entre p\u00FAblico privado ou protegido
CFRE103=o m\u00E9todo abstrato n\u00E3o pode ser privado, est\u00E1tico, final, nativo, sincronizado ou restrito
CFRE102=assinatura de campo inv\u00E1lida
CFRE101=deslocamento fora do intervalo no bytecode switch
CFRE100=foram solicitadas excessivas dimens\u00F5es no bytecode multianewarray
J9VM029=\tem (M\u00E9todo Desconhecido)
J9VM028=\tem %2$.*1$s.%4$.*3$s (%6$.*5$s\:%7$u)
J9VM027=\tem %2$.*1$s.%4$.*3$s (%6$.*5$s)
J9VM026=\tem %2$.*1$s.%4$.*3$s (Origem Desconhecida)
J9VM025=\tem %2$.*1$s.%4$.*3$s (M\u00E9todo Nativo)
J9VM024=Exce\u00E7\u00E3o no encadeamento "%.*s"
J9VM023=Isto pode indicar que JAVA_HOME est\u00E1 incorreto ou que as bibliotecas de classes n\u00E3o est\u00E3o instaladas
J9VM022=Falha no mapa tempor\u00E1rio, resultado \= %p - interrompendo a VM
J9VM021=Sem mem\u00F3ria para mapa tempor\u00E1rio do interpretador - interrompendo a VM
J9VM020=Procurado em %.*s
J2JX110=O arquivo JAR %s j\u00E1 foi convertido
J9VM019=Erro fatal\: Imposs\u00EDvel localizar e inicializar a classe obrigat\u00F3ria %.*s
J9VM018=N\u00E3o foi poss\u00EDvel alocar mem\u00F3ria para o conjunto de tabelas de carregamento da biblioteca compartilhada
J9VM017=N\u00E3o foi poss\u00EDvel alocar mem\u00F3ria para a matriz de op\u00E7\u00F5es da linha de comandos
J9VM016=Erro de encerramento para a biblioteca %1$s(%2$d)\: %3$s
J9VM015=Erro de inicializa\u00E7\u00E3o para a biblioteca %1$s(%2$d)\: %3$s
J9VM014=Erro de encerramento na fun\u00E7\u00E3o %1$s(%2$d)\: %3$s
J9VM013=Erro de inicializa\u00E7\u00E3o na fun\u00E7\u00E3o %1$s(%2$d)\: %3$s
J9VM012=N\u00E3o \u00E9 poss\u00EDvel descarregar %1$s\: %2$s
J2JX109=\  -E xxx\=yyy                configura propriedade de sistema xxx como o valor da vari\u00E1vel de ambiente yyy no tempo de execu\u00E7\u00E3o
J9VM011=N\u00E3o \u00E9 poss\u00EDvel carregar %1$s\: %2$s
J2JX108=\  -g[\:lines,source,vars]    gera um subconjunto (lines, source e/ou vars) de informa\u00E7\u00F5es de depura\u00E7\u00E3o dentro do JXE
J9VM010=Falha em inicializar %s
J2JX107=\  -g\:nosym                  informa\u00E7\u00F5es de depura\u00E7\u00E3o embutidas em JXE
J2JX106=\  -g\:sym                    gera um arquivo .sym para depura\u00E7\u00E3o, nenhuma informa\u00E7\u00E3o de depura\u00E7\u00E3o dentro de JXE
J2JX105=\  -nog                      n\u00E3o gera informa\u00E7\u00F5es de depura\u00E7\u00E3o para JXE
J2JX104=\  -g                        igual a -g\:sym
J2JX103=N\u00E3o foi poss\u00EDvel compilar o m\u00E9todo\: %2$.*1$s/%4$.*3$s%6$.*5$s jitErr 0%7$x
J2JX102=N\u00E3o foi poss\u00EDvel compilar o m\u00E9todo nativo\: %2$.*1$s/%4$.*3$s%6$.*5$s
J2JX101=N\u00E3o foi poss\u00EDvel compilar o m\u00E9todo abstrato\: %2$.*1$s/%4$.*3$s%6$.*5$s
J2JX100=%s n\u00E3o \u00E9 suportado nesta configura\u00E7\u00E3o
J9VM009=J9VMDllMain falhou
J9VM008=J9VMDllMain n\u00E3o localizado
J9VM007=Op\u00E7\u00E3o de linha de comandos n\u00E3o reconhecida\: %s
J9VM006=Op\u00E7\u00E3o de linha de comandos inv\u00E1lida\: %s
J9VM005=Valor inv\u00E1lido para a vari\u00E1vel de ambiente\: %s
J9VM004=N\u00E3o \u00E9 poss\u00EDvel carregar a biblioteca requerida por\: %s
J9VM003=O compilador JIT "%s" n\u00E3o foi localizado. Ser\u00E1 utilizado o interpretador.
J9VM002=Arquivo de op\u00E7\u00F5es n\u00E3o localizado
J9VM001=Valor malformado para -Xservice
J9VM000=Valor malformado para IBM_JAVA_OPTIONS
EXEL091=\n  -Xcheck[\:op\u00E7\u00E3o[\:...]]  controla utiliza\u00E7\u00E3o de verifica\u00E7\u00E3o -Xcheck\:help para obter detalhes adicionais
EXEL090=\  -Xscmaxaot<x>   configura espa\u00E7o m\u00E1x. reservado de cache compartilhado para dados AOT como <x>
EXEL089=\  -Xscminaot<x>   configura espa\u00E7o m\u00EDn. reservado de cache compartilhado para dados AOT como <x>
EXEL088=
EXEL087=\  -Xjni\:<op\u00E7\u00F5es>               define op\u00E7\u00F5es JNI
EXEL086=\n  -Xtrace[\:op\u00E7\u00E3o,...]  controle de rastreio, utilize -Xtrace\:help para obter detalhes adicionais
EXEL085=\nAVISO\: O argumento da linha de comandos "%s" foi reprovado.\nAVISO\: Utilize ent\u00E3o "-jxe <caminho>".\n
EXEL084=N\u00E3o \u00E9 poss\u00EDvel fazer uma c\u00F3pia de backup do arquivo\: %s
EXEL083=N\u00E3o foi poss\u00EDvel abrir o arquivo\: %s
EXEL082=\  -Xlp<x>         configura tamanho de p\u00E1gina grande como <x>
EXEL081=vers\u00E3o de java "%1$s/%2$s"
EXEL080=vers\u00E3o de java "%s"
EXEL079=\  -Xscmx<x>       configura o tamanho do novo cache de classe compartilhado para <x>
EXEL078=\  -Xshareclasses[\:op\u00E7\u00F5es]  Ativa o compartilhamento de dados da classe (utilize a ajuda para obter detalhes)\n
EXEL077=\  -Xssi<x>        configura o incremento da pilha de encadeamento java para <x>
EXEL076=JIT  - %s\n
EXEL075=\  -Xquickstart    aumenta o tempo de inicializa\u00E7\u00E3o retardando otimiza\u00E7\u00F5es
EXEL074=Imposs\u00EDvel redirecionar o console para\: %1$s\:%2$d
EXEL073=Erro interno da VM\: Falha em criar Java VM
EXEL072=Erro de inicializa\u00E7\u00E3o da VM\: Sem mem\u00F3ria
EXEL071=Falha em localizar o nome de classe principal
EXEL070=A vers\u00E3o da imagem de ROM \u00E9 incorreta
EXEL069=Falha em localizar imagem de ROM
EXEL068=Erro interno da VM\: Falha em configurar o elemento da matriz para %s
EXEL067=Erro interno da VM\: Falha em criarjava/lang/String para o argumento %s
EXEL066=Erro interno da VM\: Falha em criar matriz de byte para o argumento %s
EXEL065=Erro interno da VM\: Falha em criar matriz de argumento
EXEL064=O m\u00E9todo main deve ser declarado public, static e void.
EXEL063=A classe %s n\u00E3o implementa main()
EXEL062=Erro interno da VM\: Falta de mem\u00F3ria ao converter a cadeia em caracteres UTF para o nome de classe %s
EXEL061=Erro interno da VM\: Falha em criar java/lang/String para o nome de classe %s
EXEL060=Erro interno da VM\: Falha em criar matriz de byte para o nome de classe %s
JVMP000=A tentativa para instrumentar %.*s atrav\u00E9s de JVMPI foi proibida
SHRC199=\ Armazenamento bem-sucedido de %2$.*1$s.
SHRC198=Armazenando c\u00F3digo AOT para ROMMethod 0x%1$p no cache compartilhado...
SHRC197=Localizando c\u00F3digo AOT para ROMMethod 0x%1$p no cache compartilhado...
SHRC196=[-Xshareclasses sa\u00EDda detalhada AOT ativada]
SHRC195=Ativar sa\u00EDda detalhada de AOT
SHRC194=\tpara ROMClass %2$.*1$s em 0x%3$p.
SHRC193=%1$d\: 0x%2$p AOT\: %4$.*3$s
SHRC192=O valor -Xscmaxaot \u00E9 maior do que o valor -Xscmx, portanto, ele foi configurado como ilimitado
SHRC191=O valor -Xscminaot \u00E9 maior do que o valor -Xscmx, portanto, ele foi configurado para ser igual ao valor -Xscmx
EXEL059=Erro interno da VM\: Falha em localizar a classe java/lang/String
SHRC190=O valor -Xscminaot n\u00E3o deve ser maior do que o valor -Xscmaxaot
EXEL058=Erro interno da VM\: Sem mem\u00F3ria
EXEL057=
EXEL056=IBM \u00E9 uma marca registrada da IBM Corp.\nJava e todas as marcas baseadas em Java e logotipos s\u00E3o marcas ou marcas\nregistradas da Sun Microsystems, Inc.\n
EXEL055=Destino\: %s
EXEL054=(c) Copyright IBM Corp. 1991, %s  Todos os Direitos Reservados
EXEL053=Materiais Licenciados - Propriedade da IBM\n\nJ9 - VM para a plataforma Java(TM), Vers\u00E3o %s
EXEL052=\nAVISO\: O argumento da linha de comandos "%s" foi reprovado.\nAVISO\: Utilize o -X equivalente.
EXEL051=\nAVISO\: O argumento da linha de comandos "%s" foi reprovado.\nAVISO\: Utilize "-classpath <caminho>" ou "-cp <caminho>".
EXEL050=\  -Xrdbginfo\:<host>\:<porta>      ativa o servidor de informa\u00E7\u00F5es de depura\u00E7\u00E3o remoto
SHRC189=N\u00BA de M\u00E9todos AOT      \= %d
SHRC188=Bytes de AOT          \= %d
SHRC187=Desativar armazenamento de dados AOT no cache compartilhado
SHRC186=\tParti\u00E7\u00E3o %.*s em ModContext %.*s
SHRC185=\tModContext %.*s
SHRC184=\tParti\u00E7\u00E3o %.*s
SHRC183=N\u00E3o \u00E9 poss\u00EDvel criar tabela hash em ScopeManagerImpl
SHRC182=N\u00E3o \u00E9 poss\u00EDvel criar monitor em ScopeManagerImpl
SHRC181=N\u00E3o \u00E9 poss\u00EDvel digitar o mutex de tabela hash ScopeManagerImpl
EXEL049=
SHRC180=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para entrada de tabela hash em ScopeManagerImpl
EXEL048=\  -Xrunjdwp\:<op\u00E7\u00F5es>           ativa o debug, op\u00E7\u00F5es padr\u00E3o JDWP
EXEL047=\n  -Xdbg\:<op\u00E7\u00F5es>               ativa o debug, op\u00E7\u00F5es padr\u00E3o JDWP
EXEL046=\  -Xlp                          ativa o suporte de p\u00E1gina grande
EXEL045=\  -Xnocompactgc                 desativa a compacta\u00E7\u00E3o
EXEL044=\  -Xcompactgc                   ativa a compacta\u00E7\u00E3o
EXEL043=\  -Xcompactexplicitgc           ativa a compacta\u00E7\u00E3o em todos os sistemas GCs
EXEL042=\  -Xnocompactexplicitgc         desativa a compacta\u00E7\u00E3o em um sistema GC
EXEL041=\  -Xalwaysclassgc               ativa o descarregamento de classe din\u00E2mico em todos os GCs
EXEL040=\  -Xclassgc                     ativa o descarregamento de classe din\u00E2mico
SHRC179=O segmento ROMClass foi corrompido. Erro ao ler ROMClass em 0x%p
SHRC178=
SHRC177=
SHRC176=
SHRC175=
SHRC174=
SHRC173=Configure o diret\u00F3rio para arquivos de controle de JVM (avan\u00E7ado)
SHRC172=N\u00E3o \u00E9 poss\u00EDvel criar o cache do tamanho solicitado devido a restri\u00E7\u00F5es do Sistema Operacional
SHRC171=O z/OS n\u00E3o pode criar cache do tamanho solicitado\: Verifique as configura\u00E7\u00F5es de BPXPRMxx do sistema z/OS
EXEL039=\  -Xnoclassgc                   desativa o descarregamento de classe din\u00E2mico
SHRC170=Especificar Nome de Cache Compartilhado\n\t(Utilize %%u para substituir nome do usu\u00E1rio)
EXEL038=\  -Xgcthreads<x>                configura o n\u00FAmero de encadeamentos GC
EXEL037=\nOs argumentos para as op\u00E7\u00F5es a seguir s\u00E3o expressos como n\u00FAmeros decimais.\n
EXEL036=\  -Xmaxf<x>       porcentagem m\u00E1xima de heap livre ap\u00F3s GC
EXEL035=\  -Xminf<x>       porcentagem m\u00EDnima de heap livre ap\u00F3s GC
ZIPS001=Imposs\u00EDvel abrir %s (Exporta\u00E7\u00E3o ausente)
EXEL034=Um valor 0,3 representa um pedido de 30%%\n
ZIPS000=Imposs\u00EDvel abrir %1$s (%2$s)
EXEL033=\nOs argumentos para as op\u00E7\u00F5es a seguir s\u00E3o expressos como decimal de 0 a 1.
EXEL032=\  -Xmaxe<x>       configura o tamanho m\u00E1ximo para expans\u00E3o de heap para <x>
EXEL031=\  -Xmine<x>       configura o tamanho m\u00EDnimo para expans\u00E3o de heap para <x>
EXEL030=\  -Xss<x>        configura o tamanho da pilha de encadeamento para <x>
SHRC169=Altera\u00E7\u00E3o detectada em %2$.*1$s...\n\t...classes armazenadas em cache %3$d marcadas como antigas
SHRC168=Total de bytes de classe compartilhada lidos\=%1$lld. Total de bytes armazenados\=%2$d
SHRC167=Desativa o compartilhamento de classe
SHRC166=Conectado ao cache "%1$s", size\=%2$d bytes
SHRC165=[-Xshareclasses sa\u00EDda detalhada de API Auxiliar ativada]
SHRC164=[-Xshareclasses sa\u00EDda de E/S detalhada ativada]
SHRC163=[-Xshareclasses sa\u00EDda detalhada ativada]
J9RI023=
SHRC162=Foi excedido o tempo limite de espera pelo mutex de cria\u00E7\u00E3o ao abrir mem\u00F3ria compartilhada
J9RI022=O JVMRI de inicializa\u00E7\u00E3o n\u00E3o pode alocar monitor de dump jvmri
SHRC161=Foi excedido o tempo limite de espera pelo mutex de cria\u00E7\u00E3o ao criar mem\u00F3ria compartilhada
EXEL029=\  -Xss<x>        configura o tamanho da pilha de encadeamento java m\u00E1ximo para <x>
J9RI021=jvmri->RunDumpRoutine n\u00E3o suportado.
SHRC160=Foi excedido o tempo limite de espera pelo mutex de cria\u00E7\u00E3o ao abrir o sem\u00E1foro
EXEL028=\  -Xiss<x>        configura o tamanho da pilha de encadeamento java inicial para <x>
J9RI020=jvmri->CreateThread n\u00E3o consegue alocar monitor privado
EXEL027=\  -Xmso<x>        configura o tamanho da pilha de encadeamento do S.O. para <x>
EXEL026=\  -Xmrx<x>         configura o tamanho m\u00E1ximo da configura\u00E7\u00E3o lembrada para <x>
EXEL025=\  -Xmr<x>         configura o tamanho da configura\u00E7\u00E3o lembrada para <x>
EXEL024=\  -Xmx<x>         configura a mem\u00F3ria m\u00E1xima para <x>
EXEL023=\  -Xms<x>           configura o tamanho de mem\u00F3ria inicial para <x>
EXEL022=\  -Xms<x>         configura o tamanho de espa\u00E7o antigo para <x>
EXEL021=\  -Xmoi<x>        configura o incremento de espa\u00E7o antigo para <x>
EXEL020=\  -Xmox<x>        configura o tamanho de espa\u00E7o antigo m\u00E1ximo antigo para <x>
SHRC159=Cache de classe compartilhada "%1$s" aberto
J9RI019=jvmri->InjectOutOfMemory n\u00E3o suportado.
SHRC158=Cache de classe compartilhada "%1$s" criado
J9RI018=jvmri->NotifySignal emitindo o sinal %d.
SHRC157=N\u00E3o \u00E9 poss\u00EDvel alocar %1$d bytes de mem\u00F3ria compartilhada solicitada \n\tM\u00E1ximo permitido de mem\u00F3ria compartilhada alocado com \u00EAxito (%2$d bytes) \n\t(Para aumentar a mem\u00F3ria compartilhada dispon\u00EDvel, modifique o valor SHMMAX do sistema)
J9RI017=N\u00E3o \u00E9 poss\u00EDvel alocar agente de dump em jvmri->SetOutOfMemoryHook, fun\u00E7\u00E3o n\u00E3o registrada.
SHRC156=Erro ao copiar nome do grupo para nome de cache
J9RI016=jvmri->SetOutOfMemoryHook foi chamado com retorno de chamada nulo, fun\u00E7\u00E3o n\u00E3o registrada.
SHRC155=Erro ao copiar nome do usu\u00E1rio para nome de cache
J9RI015=jvmri->RunDumpRoutine\: componentId est\u00E1 fora dos limites.
SHRC154=Caractere de escape %.*s inv\u00E1lido para nome de cache
J9RI014=jvmri->RunDumpRoutine\: imposs\u00EDvel recuperar dados do componente.
SHRC153=Especificar Nome de Cache Compartilhado\n\t(Utilize %%g para substituir nome do grupo e %%u para nome do usu\u00E1rio)
J9RI013=jvmri->ReleaseRasInfo\: a estrutura tem campo de tipo n\u00E3o suportado.
SHRC152=Sempre Iniciar a JVM Independentemente de Erros/Avisos
J9RI012=jvmri->ReleaseRasInfo foi chamado com a estrutura RasInfo nula.
SHRC151=Suprimir Todas as Mensagens
EXEL019=\  -Xmos<x>        configura o tamanho de espa\u00E7o antigo inicial para <x>
J9RI011=A estrutura RasInfo tem campo de tipo n\u00E3o suportado.
SHRC150=Ativar Sa\u00EDda Detalhada da API Auxiliar
EXEL018=\  -Xmo<x>         configura o tamanho de espa\u00E7o inicial/m\u00E1ximo antigo para <x>
J9RI010=jvmri->GetRasInfo n\u00E3o consegue alocar mem\u00F3ria.
EXEL017=\  -Xmo<x>         configura o tamanho de espa\u00E7o antigo para <x>
EXEL016=\  -Xmnx<x>        configura o novo tamanho de espa\u00E7o m\u00E1ximo para <x>
EXEL015=\  -Xmns<x>        configura o novo tamanho de espa\u00E7o inicial para <x>
EXEL014=\  -Xmn<x>         configura o novo tamanho de espa\u00E7o inicial/m\u00E1ximo para <x>
EXEL013=\  -Xmn<x>         configura o novo tamanho de espa\u00E7o para <x>
EXEL012=\  -Xmco<x>        configura o incremento do segmento de classe de ROM para <x>
EXEL011=\  -Xmca<x>        configura o incremento do segmento de classe de RAM para <x>
EXEL010=Valor com sufixo "k" (kilo) ou "m" (mega) ser\u00E3o fatorados de maneira adequada.\n
SHRC149=Ativar Sa\u00EDda Detalhada de Localiza\u00E7\u00E3o/Armazenamento
J9RI009=jvmri->GetRasInfo n\u00E3o consegue alocar mem\u00F3ria.
SHRC148=Permitir acesso de grupo ao cache (usu\u00E1rio \u00E9 o padr\u00E3o)
J9RI008=jvmri->GetRasInfo n\u00E3o consegue obter componentes.
SHRC147=O caractere %.*s n\u00E3o \u00E9 v\u00E1lido para nome de cache
J9RI007=jvmri->GetRasInfo n\u00E3o consegue alocar mem\u00F3ria.
SHRC146=Localizando a classe %1$s no cache compartilhado para cldr id %2$d com Token %4$.*3$s...
J9RI006=jvmri->GetRasInfo foi chamado com a estrutura RasInfo nula.
SHRC145=Localizando a classe %1$s no cache compartilhado para cldr id %2$d com URL %4$.*3$s...
J9RI005=O componente %s de jvmri->GetComponentDataArea n\u00E3o tem dataArea nesta vm.
SHRC144=Armazenando a classe %2$.*1$s no cache compartilhado para cldr id %3$d com Token %5$.*4$s...
J9RI004=jvmri->DynamicVerbosegc n\u00E3o suportado.
SHRC143=Armazenando a classe %2$.*1$s no cache compartilhado para cldr id %3$d com URL %5$.*4$s...
J9RI003=N\u00E3o \u00E9 poss\u00EDvel alocar agente de dump em jvmri->DumpRegister, fun\u00E7\u00E3o n\u00E3o registrada.
SHRC142=\tem 0x%1$p\t\t%2$x \!\= %3$x
J9RI002=jvmri->DumpRegister foi chamado com retorno de chamada nulo, fun\u00E7\u00E3o n\u00E3o registrada.
SHRC141=bytes incompat\u00EDveis\:
EXEL009=\nArgumentos para as seguintes op\u00E7\u00F5es s\u00E3o expressos em bytes.
J9RI001=Erro interno ao remover o agente de dump em jvmri->DumpDeregister, fun\u00E7\u00E3o pode n\u00E3o ter registro removido.
SHRC140=tamanho\:\t%1$d\t\t\t%2$d\n
EXEL008=\  -Xfuture        ativa verifica\u00E7\u00F5es mais r\u00EDgidas, antecipando o padr\u00E3o futuro
J9RI000=jvmri->CreateThread n\u00E3o pode alocar mem\u00F3ria de argumentos de encadeamento
EXEL007=\  -Xnoaot         n\u00E3o executa c\u00F3digo pr\u00E9-compilado
EXEL006=\  -Xnojit         desativa o JIT
EXEL005=\  -Xint           executa interpretado apenas (equivalente a -Xnojit -Xnoaot)
EXEL004=\n  -Xrun<library>[\:op\u00E7\u00F5es]  carregar biblioteca de agente nativo\n                            (obsoleto em favor de -agentlib)\n
EXEL003=\  -Xbootclasspath/a\:<caminho>  anexa <caminho> ao caminho de classe de auto-inicializa\u00E7\u00E3o
EXEL002=\  -Xbootclasspath/p\:<caminho>  pr\u00E9-anexa <caminho> ao caminho de classe de auto-inicializa\u00E7\u00E3o
EXEL001=\  -Xbootclasspath\:<caminho>    configura o caminho de classe de auto-inicializa\u00E7\u00E3o para <caminho>
EXEL000=As op\u00E7\u00F5es a seguir n\u00E3o s\u00E3o op\u00E7\u00F5es padr\u00E3o e est\u00E3o sujeitas a altera\u00E7\u00F5es sem aviso pr\u00E9vio.\n
JDBG021=op\u00E7\u00E3o de depura\u00E7\u00E3o n\u00E3o reconhecida
JDBG020=op\u00E7\u00E3o de depura\u00E7\u00E3o n\u00E3o reconhecida\: '%s'
SHRC139=\n\tROMClass sendo armazenado\tROMClass em cache
SHRC138=Foram localizados mais de um ROMClass \u00F3rf\u00E3os %.*s
SHRC137=MODO SEGURO\: Aviso\: ROMClass %.*s n\u00E3o corresponde a ROMClass em cache
SHRC136=N\u00E3o \u00E9 poss\u00EDvel criar o monitor em SH_ROMClassManagerImpl
SHRC135=Falha em criar tabela hash em SH_ROMClassManagerImpl
SHRC134=Falha em criar o conjunto em SH_ROMClassManagerImpl
SHRC133=N\u00E3o \u00E9 poss\u00EDvel digitar mutex da tabela hash ROMClassManager
SHRC132=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para entrada de tabela hash em ROMClassManagerImpl
SHRC131=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para o item da lista vinculada em ROMClassManagerImpl
SHRC130=Tentativa de alocar enquanto a confirma\u00E7\u00E3o ainda est\u00E1 pendente
JDBG019=lista de relocaliza\u00E7\u00F5es n\u00E3o classificadas %zx
JDBG018=ignorando op\u00E7\u00E3o de depura\u00E7\u00E3o n\u00E3o reconhecida
JDBG017=
JDBG016=falha na conex\u00E3o com a JVM
JDBG015=Servidor de resposta de depura\u00E7\u00E3o
JDBG014=n\u00E3o \u00E9 poss\u00EDvel alocar o conjunto vm->debuggerClassReferences
JDBG013=n\u00E3o \u00E9 poss\u00EDvel alocar o conjunto vm->debuggerReferences
JDBG012=falha em j9dbg_init_server
JDBG011=n\u00E3o \u00E9 poss\u00EDvel alocar debugServer
JDBG010=Exemplo\: java -Xrunjdwp\:transport\=dt_socket,address\=localhost\:8000\n
SHRC129=Tentativa de configurar readerCount como -1\!
SHRC128=SH_CompositeCache\:\:exitMutex falhou com c\u00F3digo de retorno %d
SHRC127=SH_CompositeCache\:\:enterMutex falhou com c\u00F3digo de retorno %d
SHRC126=Foi feito pedido para incluir muitos itens em ClasspathItem
SHRC125=N\u00E3o foi poss\u00EDvel alocar mem\u00F3ria para o buffer de cadeia em SH_CacheMap
SHRC124=O cache est\u00E1 %1$d%% cheio\n
SHRC123=%% Stale classes          \= %1$d%%\n
SHRC122=\# Stale classes          \= %d
SHRC121=\# Tokens                 \= %d
SHRC120=\# URLs                   \= %d
JDBG009=j9methodids\=y|n                 usar m\u00E9todo j9 ids              n\n
JDBG008=onuncaught\=y|n                  depurar em qq n\u00E3o-captura?      n
JDBG007=onthrow\=<nome_da_exce\u00E7\u00E3o>       depurar quando emitido          none
JDBG006=server\=y|n                      atender depurador?              n
JDBG005=address\=<escutar/anexar endere\u00E7o> spec de transporte              "localhost\:8888"
JDBG004=transport\=<nome>                spec de transporte              none
JDBG003=suspend\=y|n                     aguardar na inicializa\u00E7\u00E3o?      y
JDBG002=---------------------           ---------                       ------
JDBG001=Nome e Valor da Op\u00E7\u00E3o           Descri\u00E7\u00E3o                       Padr\u00E3o
JDBG000=-Xrunjdwp uso\: -Xrunjdwp\:[help]|[<op\u00E7\u00E3o>\=<valor>, ...]\n
SHRC119=\# Classpaths             \= %d
SHRC118=\# ROMClasses             \= %d
SHRC117=%% de metadados utilizado \= %1$d%%\n
SHRC116=Bytes de metadados       \= %d
SHRC115=bytes de ROMClass        \= %d
SHRC114=bytes livres             \= %d
SHRC113=tamanho do cache         \= %d
SHRC112=ponto de alloca\u00E7\u00E3o             \= 0x%p\n
SHRC111=endere\u00E7o final               \= 0x%p
SHRC110=\nendere\u00E7o base              \= 0x%p
EXEX026=\  -jxe <arquivo jxe>   coloca o arquivo jxe no caminho de classe e executa a classe\n                    de inicializa\u00E7\u00E3o localizada no arquivo jxe.
EXEX025=Uso\:\t%s [-jxe] [op\u00E7\u00F5es] <arquivo jxe> [args...]
EXEX024=O JXE %s n\u00E3o continha uma classe de inicializa\u00E7\u00E3o.
EXEX023=N\u00E3o foi poss\u00EDvel inicializar utilit\u00E1rios JXE.
EXEX022=
EXEX021=
EXEX020=
SHRC109=\!STALE\!
VERB026=Entrada de CP inv\u00E1lida\: %s (jxe endian oposto n\u00E3o suportado)
SHRC108=\t%.*s
VERB025=Entrada de CP inv\u00E1lida\: %s (cabe\u00E7alho de imagem jxe danificado)
SHRC107=\t%.*s
VERB024=Entrada de CP inv\u00E1lida\: %s (jxe n\u00E3o cont\u00E9m rom.classes)
SHRC106=%1$d\: 0x%2$p TOKEN
VERB023=Entrada de CP inv\u00E1lida\: %s (erro desconhecido)
SHRC105=%1$d\: 0x%2$p URL
VERB022=Entrada de CP inv\u00E1lida\: %s (tipo de arquivo desconhecido)
SHRC104=%1$d\: 0x%2$p CLASSPATH
VERB021=Entrada de CP inv\u00E1lida\: %s (tipo de arquivo n\u00E3o suportado)
SHRC103=\tToken 0x%p
VERB020=Entrada de CP inv\u00E1lida\: %s (arquivo danificado)
SHRC102=\tURL 0x%p
SHRC101=\t\u00CDndice %1$d no caminho de classe 0x%2$p
SHRC100=%1$d\: 0x%2$p ROMCLASS\: %4$.*3$s em 0x%5$p.
CDRT002=PC com Falha\: %1$p (offset %2$p), metaData \= %3$p
CDRT001=M\u00E9todo\: %2$.*1$s.%4$.*3$s%6$.*5$s (%7$p)
CDRT000=Imposs\u00EDvel localizar o mapa tempor\u00E1rio JIT - interrompendo a VM
EXEX019=
EXEX018=
EXEX017=Erro ao mapear jxe em flash
EXEX016=Par\u00E2metros jxespace inv\u00E1lidos
EXEX015=Erro de inicializa\u00E7\u00E3o da VM\: Sem mem\u00F3ria
EXEX014=Execute %s -help para uso
EXEX013=Erro interno da VM\: Falha em criar Java VM
EXEX012=A op\u00E7\u00E3o -jar n\u00E3o est\u00E1 dispon\u00EDvel para esta biblioteca de classes
EXEX011=
EXEX010=%s requer um par\u00E2metro
PORT019=N\u00E3o \u00E9 poss\u00EDvel criar diret\u00F3rio %s. As classes compartilhadas ser\u00E3o desativadas at\u00E9 que este diret\u00F3rio seja criado.
PORT018=Falha na Opera\u00E7\u00E3o\: %1$d (%2$s falhou\: %3$d)
PORT017=Falha na Opera\u00E7\u00E3o\: %d
VERB019=Entrada de CP inv\u00E1lida\: %s (falha de leitura de arquivo)
PORT016=Erro Interno %i
VERB018=Entrada de CP inv\u00E1lida\: %s (falha de E/S de arquivo)
PORT015=Imposs\u00EDvel resolver refer\u00EAncias da biblioteca compartilhada - uma biblioteca compartilhada de pr\u00E9-requisito pode estar ausente
VERB017=espa\u00E7o m\u00E1x. permitido de cache sc para AOT
PORT014=biblioteca compartilhada n\u00E3o localizada
VERB016=espa\u00E7o m\u00EDn. reservado de cache sc para AOT
PORT013=tabela de bibliotecas compartilhadas n\u00E3o localizada
VERB015=tamanho do cache de classe compartilhado
PORT012=Erro\: A fun\u00E7\u00E3o de 68K tem conjunto de bits PACE.
VERB014=m\u00E1ximo de mem\u00F3ria
PORT011=Sem mem\u00F3ria
VERB013=incremento do segmento de classe ROM
PORT010=Permiss\u00E3o negada
VERB012=incremento do segmento de classe RAM
VERB011=tamanho da pilha de encadeamento java
VERB010=tamanho m\u00E1ximo da pilha de encadeamento java
EXEX009=\  -verify          ative a verifica\u00E7\u00E3o do arquivo de classe.\n  -X               imprime a ajuda de op\u00E7\u00F5es que n\u00E3o s\u00E3o padr\u00E3o.
EXEX008=\  -verbose[\:class,gc,stack,sizes]\n                   ativa a sa\u00EDda detalhada (default\=class).\n
EXEX007=\  -jcl\:<config>[\:op\u00E7\u00F5es]\n                   especifica qual biblioteca compartilhada JCL utilizar (por exemplo\: cdc, cldc, ...).\n
EXEX006=\  -debug\:<op\u00E7\u00F5es> ativa debug, padr\u00E3o JDWP <op\u00E7\u00F5es>.\n
EXEX005=\  -D<prop>\=<val>   defina o valor de uma propriedade de sistema.\n
EXEX004=\  -jxespace\:<endere\u00E7o f\u00EDsico>,<tamanho>,<endere\u00E7o l\u00F3gico>\n                   mapeia a regi\u00E3o da mem\u00F3ria para jxes, (valores est\u00E3o em hexadecimal).\n  -jxeaddr\:<logicalAddr>\n                   executa um jxe diretamente da mem\u00F3ria, (endere\u00E7o est\u00E1 em hexadecimal).
EXEX003=\  -jxe\:<arquivo jxe>   execute o arquivo jxe denominado.
EXEX002=\n[op\u00E7\u00F5es]\n  -classpath <caminho>\n  -cp <caminho>       configure o caminho de classe para <caminho>.
EXEX001=Uso\:\t%s [op\u00E7\u00F5es] -jxe\:<arquivo jxe> [args...]
EXEX000=Uso\:\t%s [op\u00E7\u00F5es] classname [args...]
PORT009=Arquivo n\u00E3o localizado
PORT008=Arquitetura do m\u00F3dulo incorreta
PORT007=N\u00E3o \u00E9 um m\u00F3dulo
VERB009=incremento da pilha de encadeamento java
PORT006=Formato de m\u00F3dulo incorreto
VERB008=tamanho inicial da pilha de encadeamento java
PORT005=N\u00E3o foi poss\u00EDvel carregar o m\u00F3dulo
VERB007=tamanho da pilha de encadeamento do S.O.
PORT004=Falha de resolu\u00E7\u00E3o de s\u00EDmbolo
VERB006=Falha em inicializar
PORT003=O m\u00F3dulo dependente %s n\u00E3o p\u00F4de ser carregado
VERB005=Erro\: est\u00E1 faltando o nome do arquivo -Xverbosegclog
PORT002=Erro desconhecido ao carregar a biblioteca compartilhada
VERB004=Erro\: o n\u00FAmero de ciclos -Xverbosegclog deve ser maior que 0
PORT001=Falha em alocar mem\u00F3ria.
VERB003=Erro\: o n\u00FAmero de arquivos -Xverbosegclog deve ser maior que 0
PORT000=
VERB002=Pilha detalhada\: a utiliza\u00E7\u00E3o m\u00E1xima da pilha foi de %1$zd/%2$zd bytes em pilhas Java/C
VERB001=
VERB000=Pilha detalhada\: "%2$.*1$s" utilizou %3$zd/%4$zd bytes em pilhas Java/C
MECK002=Ocorreu um erro ao criar a estrutura de dados do site de chamada. As informa\u00E7\u00F5es do site de chamada n\u00E3o ser\u00E3o exibidas
MECK001=Op\u00E7\u00E3o -Xcheck\:memory n\u00E3o reconhecida\: %s
MECK000=Ocorreu um erro ao inicializar o utilit\u00E1rio -Xcheck\:memory
CFRE099=modificadores de m\u00E9todo ilegais
CFRE098=a assinatura de vari\u00E1vel local deve ser uma cadeia
CFRE097=duplicar entrada de classe interna no atributo
CFRE096=direcionar n\u00E3o-instru\u00E7\u00E3o em bytecode switch
CFRE095=as anota\u00E7\u00F5es devem ser interfaces
CFRE094=o bytecode instanceof deve referir-se a uma classe
CFRE093=o m\u00E9todo pode ser no m\u00E1ximo um entre p\u00FAblico privado ou protegido
CFRE092=assinatura inv\u00E1lida
CFRE091=o PC de in\u00EDcio do manipulador de exce\u00E7\u00F5es n\u00E3o \u00E9 uma instru\u00E7\u00E3o
CFRE090=o novo bytecode n\u00E3o pode criar matrizes
CFRE089=esperando nome e tipo
CFRE088=o nome da vari\u00E1vel local deve ser uma cadeia
CFRE087=o bytecode do m\u00E9todo de interface deve referenciar um InterfaceMethodref
CFRE086=o m\u00E9todo possui dois atributos Code
CFRE085=o nome interno deve ser uma cadeia
CFRE084=sem erro
CFRE083=a classe \u00E9 abstrata e final
CFRE082=<init> o m\u00E9todo n\u00E3o pode ser est\u00E1tico, final, sincronizado, nativo ou abstrato
CFRE081=o arquivo de origem deve ser um UTF8
CFRE080=a assinatura de m\u00E9todo \u00E9 inv\u00E1lida
J2JX099=Op\u00E7\u00E3o(\u00F5es) incompleta(s) na linha de comandos. Primeiro era\: %s
J2JX098=Argumento inv\u00E1lido [%1$s] para a op\u00E7\u00E3o\: %2$s
DUMP024=A prepara\u00E7\u00E3o do heap solicitada n\u00E3o foi executada porque o acesso exclusivo n\u00E3o foi solicitado ou n\u00E3o p\u00F4de ser obtido.
J2JX097=Op\u00E7\u00E3o(\u00F5es) n\u00E3o reconhecida(s) na linha de comandos. Primeiro era\: %s
DUMP023=A compacta\u00E7\u00E3o do heap solicitada n\u00E3o foi executada porque o acesso exclusivo n\u00E3o foi solicitado ou n\u00E3o p\u00F4de ser obtido.
J2JX096=Falha em localizar a fun\u00E7\u00E3o j9bcv_verifyCreateStackAttributes
DUMP022=O dump do heap solicitado n\u00E3o foi produzido porque o acesso exclusivo n\u00E3o foi solicitado ou n\u00E3o p\u00F4de ser obtido.
J2JX095=Falha em localizar a fun\u00E7\u00E3o j9bcv_verifyClassStructure
DUMP021=V\u00E1rios dumps do heap foram solicitados mas %%id est\u00E1 ausente no r\u00F3tulo do arquivo\: os dumps ser\u00E3o sobrescritos
J2JX094=Falha em abrir a DLL do verificador %1$s\: %2$s
DUMP020=O Dump %s foi gravado
J2JX093=Nenhum arquivo de classe especificado na linha de comandos
J2JX092=Erro interno com VM rec\u00E9m criada
J2JX091=Criou o Java VM com \u00EAxito
J2JX090=Tentando criar um Java VM para usar com AOT
CFRE079=o PC do manipulador de exce\u00E7\u00F5es \u00E9 inv\u00E1lido
CFRE078=o \u00EDndice da classe de m\u00E9todo de inclus\u00E3o deve referir-se a uma classe
CFRE077=as interfaces devem ser abstratas
CFRE076=n\u00FAmero m\u00E1gico inv\u00E1lido
CFRE075=assinatura de vari\u00E1vel local inv\u00E1lida
CFRE074=nenhum atributo Code especificado
CFRE073=atributo StackMap/StackMapTable localizado fora do atributo Code
CFRE072=entradas n\u00E3o classificadas no bytecode lookupswitch
CFRE071=a matriz de bytecode est\u00E1 vazia
CFRE070=PC de n\u00FAmero de linha inv\u00E1lido
DUMP019=JVM Solicitando Dump %s
DUMP018=O evento pedido n\u00E3o est\u00E1 dispon\u00EDvel\: execute com o sinalizador -Xdump\:dynamic
DUMP017=Interrompendo\: N\u00E3o \u00E9 poss\u00EDvel compactar o arquivo (%s)
DUMP016=Interrompendo\: N\u00E3o \u00E9 poss\u00EDvel criar o arquivo (%s)
J2JX089=Erro Interno\: n\u00E3o foi poss\u00EDvel localizar %1$s em %2$s
DUMP015=Interrompendo\: N\u00E3o \u00E9 poss\u00EDvel abrir ou ler (%s)
J2JX088=Erro Interno\: falha ao abrir %1$s\: %2$s
DUMP014=A\u00E7\u00E3o de VM n\u00E3o reconhecida\: ...%s
J2JX087=Erro Interno\: n\u00E3o foi poss\u00EDvel determinar o nome do execut\u00E1vel
DUMP013=Evento de Dump Processado "%1$s", detalhe "%3$.*2$s".
J2JX086=Foram gravados %1$i bytes para simbolizar o arquivo %2$s
DUMP012=Erro em %1$s Dump\: %2$s
J2JX085=Erro Interno\: c\u00F3digo de erro n\u00E3o suportado de cria\u00E7\u00E3o de classe rom %d
DUMP011=%1$s Dump de processo de spawn %2$d
J2JX084=
DUMP010=%1$s Dump gravado em %2$s
J2JX083=Incluindo %s em AOT
J2JX082=Excluindo %s de AOT
J2JX081=Erro\: %s
J2JX080=Erro de verifica\u00E7\u00E3o no m\u00E9todo %1$i (%3$.*2$s%5$.*4$s) em PC %6$i
CFRE069=comprimento do atributo maior do que os dados do atributo
CFRE068=o nome da classe \u00E9 inv\u00E1lido
CFRE067=tag de entrada do conjunto de constantes desconhecida
CFRE066=atributos InnerClasses m\u00FAltiplos
CFRE065=v\u00E1rios atributos de m\u00E9todos de inclus\u00E3o
CFRE064=o descritor deve ser uma cadeia UTF8
CFRE063=o bytecode invoke chama o m\u00E9todo inv\u00E1lido
CFRE062=o m\u00E1x. de locais \u00E9 menor do que o tamanho de argumentos
CFRE061=o nome deve ser uma cadeia UTF8
CFRE060=o PC de final do manipulador de exce\u00E7\u00F5es n\u00E3o \u00E9 uma instru\u00E7\u00E3o ou o final da matriz de bytecode
DUMP009=%s Dump n\u00E3o dispon\u00EDvel
DUMP008=usando '%s'
DUMP007=JVM Solicitando Dump %1$s utilizando '%2$s'
DUMP006=Processando Evento de Dump "%1$s",  detalhe "%3$.*2$s" - Aguarde.
J2JX079=Erro\: %1$s em %2$i
DUMP005=Execut\u00E1vel Faltando
J2JX078=A\u00E7\u00E3o recomendada\:
DUMP004=Nome de Arquivo Faltando
J2JX077=Arquivo de classe inv\u00E1lido
DUMP003=Dump Denominado n\u00E3o reconhecido\: %s
J2JX076=Arquivo de classe inv\u00E1lido\: %s
DUMP002=Campo de R\u00F3tulo n\u00E3o reconhecido\: %%%1$c
J2JX075=Nome da entrada muito longo\: %s
DUMP001=Evento de Dump n\u00E3o reconhecido\: ...%s
J2JX074=Tentativa de incluir entrada duplicada em JXE\: %s
DUMP000=Op\u00E7\u00E3o de Dump n\u00E3o reconhecida\: -Xdump\:%s
J2JX073=arquivo de processamento de diret\u00F3rio\: %s
J2JX072=N\u00E3o foi poss\u00EDvel abrir o diret\u00F3rio %s
J2JX071=Diret\u00F3rio de processamento\: %s
J2JX070=aumento de espa\u00E7o para\: %i bytes
CFRE059=o PC do manipulador de exce\u00E7\u00F5es n\u00E3o \u00E9 uma instru\u00E7\u00E3o
CFRE058=\u00EDndice de vari\u00E1vel local fora do intervalo no retorno da sub-rotina
CFRE057=o tipo de manipulador de exce\u00E7\u00F5es deve ser uma classe
CFRE056=contagem do argumento de bytecode invokeinterface incorreta
CFRE055=o PC de fim do manipulador de exce\u00E7\u00F5es \u00E9 inv\u00E1lido
CFRE054=o bytecode de campo deve fazer refer\u00EAncia a um Fieldref
CFRE053=o m\u00E9todo possui mais de 255 slots de argumentos
CFRE052=a classe externa deve ser uma classe
CFRE051=a constante da cadeia deve ser uma cadeia
CFRE050=o m\u00E9todo da interface deve ser p\u00FAblico e abstrato
J2JX069=tamanho estimado de mem\u00F3ria\: %i bytes
J2JX068=tamanho do arquivo\: %i bytes
J2JX067=Nenhuma classe v\u00E1lida localizada em %s
J2JX066=N\u00E3o foi poss\u00EDvel abrir o arquivo\: %s
J2JX065=Erro ao fechar o arquivo zip\: %s
J2JX064=Os valores v\u00E1lidos para a op\u00E7\u00E3o -precompileTarget s\u00E3o\:
J2JX063=Os padr\u00F5es s\u00E3o\:
J2JX062=classfile(s)                qualquer n\u00FAmero de arquivos que terminem com .class, .jar ou .zip\n                            ser\u00E3o examinados e inclu\u00EDdos no jxe\n
SHRC287=
J2JX061=Op\u00E7\u00F5es de compila\u00E7\u00E3o antecipadas\:\n  -[no]precompile           [n\u00E3o] marca todos os m\u00E9todos para pr\u00E9-compila\u00E7\u00E3o\n  -[no]precompileMethod xxx [n\u00E3o] marca m\u00E9todos nomeados para pr\u00E9-compila\u00E7\u00E3o\n  -[no]compileAheadOfTime   compila m\u00E9todo marcado antecipadamente\n  -precompileTarget xxx     gera jxe para arquitetura de destino e S.O. xxx\n  -precompileOptions xxx    transmite xxx para o mecanismo de pr\u00E9-compila\u00E7\u00E3o\n  -[no]precompileResolve    [n\u00E3o] tenta resolver refer\u00EAncias externas durante a pr\u00E9-compila\u00E7\u00E3o\n  -[no]stripBytecode        [n\u00E3o] extrai bytecode para m\u00E9todos compilados aot\n
SHRC286=Aberto cache de classe compartilhado %1$s no modo de leitura
J2JX060=\  -j2se                     utiliza esta op\u00E7\u00E3o ao usar o jar2jxe em um ambiente J2SE\n
SHRC285=Aberto cache persistente de classes compartilhado %1$s no modo de leitura
SHRC284=N\u00E3o \u00E9 poss\u00EDvel criar monitor no modo de leitura
CFRE049=o bytecode checkcast deve referir-se a uma classe
SHRC283=Abra o cache com permiss\u00F5es de leitura
CFRE048=\u00EDndice de vari\u00E1vel local fora do intervalo no armazenamento
SHRC282=O tamanho da p\u00E1gina do sistema operacional \u00E9 incompat\u00EDvel com este cache. Tentando recriar o cache.
CFRE047=a classe de interface pode ser apenas p\u00FAblica, abstrata ou de anota\u00E7\u00E3o
SHRC281=Tentando destruir todos os caches em cacheDir %s
CFRE046=preenchimento de bytecode switch incorreto
SHRC280=Listando todos os caches em cacheDir %s
CFRE045=\u00EDndice de conjunto de constantes fora do intervalo
CFRE044=o bytecode invokeinterface reservou o slot diferente de zero
CFRE043=o bytecode n\u00E3o pode ser ampliado
CFRE042=tamanho de matriz de bytecode > 65535
CFRE041=vers\u00E3o secund\u00E1ria inv\u00E1lida
CFRE040=comprimento do atributo menor que os dados do atributo
J2JX059=\  -[no]tools                o diret\u00F3rio de ferramentas [n\u00E3o] est\u00E1 inclu\u00EDdo na lista de diret\u00F3rio de extens\u00E3o
J2JX058=\  -padJxe                   preenche o jxe no final com xxx bytes extras
J2JX057=\  -[no]segmented            [n\u00E3o] gera v\u00E1rios jxes segmentados\n  -maxSegmentSize xxx       tamanho m\u00E1x. para qualquer jxe segmentado (n\u00FAmero hexadecimal)\n  -maxSegmentSize seg\=xxx   tamanho m\u00E1x. para jxe segmentado espec\u00EDfico (n\u00FAmero hexadecimal)\n  -locate xxx               localiza a imagem para o endere\u00E7o xxx (n\u00FAmero hexadecimal)\n  -locate seg\=xxx           localiza a imagem de um segmento para o endere\u00E7o hexadecimal xxx
J2JX056=\  -fileExtension xxx        trata arquivos que terminam com .xxx como arquivos .jar
J2JX055=\  -vmOption xxx             utiliza um vmOption xxx ao executar o jxe
J2JX054=\  -versionName xxx          configura o nome de vers\u00E3o do jxe para xxx
SHRC279=Recriar cache compartilhado na inicializa\u00E7\u00E3o
J2JX053=\  -description xxx          configura a descri\u00E7\u00E3o do jxe para xxx
SHRC278=Observe que o utilit\u00E1rio "%s" n\u00E3o pode operar no cache de classes incompat\u00EDvel "%s". Utilize uma JVM do n\u00EDvel correto.
J2JX052=\  -uuid xxx                 configura o UUID do jxe para xxx
SHRC277=Para executar o utilit\u00E1rio "%s" no cache de classes n\u00E3o persistente "%s", voc\u00EA tamb\u00E9m deve utilizar a subop\u00E7\u00E3o "nonpersistent"
J2JX051=\  -D xxx\=yyy                configura a propriedade de sistema xxx para yyy
SHRC276=Para executar o utilit\u00E1rio "%s" no cache de classes persistente "%s", n\u00E3o utilize a subop\u00E7\u00E3o "nonpersistent"
J2JX050=\  -startupClass xxx        configura a classe de inicializa\u00E7\u00E3o para xxx\n-noStartupClass           indica que o jxe n\u00E3o tem uma classe de inicializa\u00E7\u00E3o
SHRC275=Configurar o local dos arquivos de cache da JVM
SHRC274=Prote\u00E7\u00E3o de p\u00E1gina de mem\u00F3ria desativada para o cache
CFRE039=\u00EDndice de vari\u00E1vel local fora do intervalo no carregamento
SHRC273=Prote\u00E7\u00E3o de p\u00E1gina de mem\u00F3ria padr\u00E3o ativada com \u00EAxito para o cache
CFRE038=o m\u00E9todo possui dois atributos Exceptions
SHRC272=Prote\u00E7\u00E3o de p\u00E1gina de mem\u00F3ria completa ativada com \u00EAxito para o cache
CFRE037=temp cont\u00E9m um tipo incorreto
SHRC271=Subop\u00E7\u00E3o n\u00E3o reconhecida para a op\u00E7\u00E3o mprotect\=
CFRE036=direcionar n\u00E3o-instru\u00E7\u00E3o em bytecode jump
SHRC270=Configurar prote\u00E7\u00E3o de p\u00E1gina de mem\u00F3ria cache
CFRE035=o novo bytecode deve referir-se a uma classe
CFRE034=bytecode incompleto
CFRE033=o intervalo do manipulador de exce\u00E7\u00F5es est\u00E1 vazio
CFRE032=a superclasse da interface deve ser java.lang.Object
CFRE031=a exce\u00E7\u00E3o emitida deve ser uma classe
CFRE030=superclasse nula
J2JX049=\  -srcDir xxx              inclui todos os arquivos na \u00E1rvore de diret\u00F3rios xxx
J2JX048=\  -outputFormat xxx         configura o formato de sa\u00EDda para xxx (c, bin ou jar)
J2JX047=\  -o xxx                    configura nome de arquivo da sa\u00EDda base para xxx
J2JX046=\  -be                       gera sa\u00EDda de big-endian\n  -le                       gera sa\u00EDda de little-endian
J2JX045=\  -version                  imprime a vers\u00E3o deste programa
J2JX044=\  -[no]profile              [n\u00E3o] gera um arquivo .prf para tra\u00E7ado de perfil
SHRC269=O sistema n\u00E3o suporta prote\u00E7\u00E3o de p\u00E1gina de mem\u00F3ria
J2JX043=
SHRC268=[-Xshareclasses armazenamento em cache de entradas do caminho de classe de inicializa\u00E7\u00E3o desativado]
J2JX042=\  -[no]verify               [n\u00E3o] verifica o formato do arquivo de classe
SHRC267=Desativar armazenamento em cache de classes do caminho de classe de inicializa\u00E7\u00E3o
J2JX041=\  -q                        modo silencioso\n  -[no]logo                 [n\u00E3o] imprime mensagem de direitos autorais\n  -verbose                  modo detalhado
SHRC266=[-Xshareclasses armazenamento em cache de classes retransformadas ativado]
J2JX040=Uso\:\t%s [op\u00E7\u00F5es] classfile(s)\n\n[op\u00E7\u00F5es]\n  -help, -?                 imprimir uso
SHRC265=Classes de cache que s\u00E3o retransformadas atrav\u00E9s de JVMTI
SHRC264=N\u00E3o aproximar \u00E1reas de cache de limites da p\u00E1gina
CFRE029=o bytecode multianewarray deve referir-se a uma classe
SHRC263=Ativar p\u00E1ginas detalhadas de CompositeCache
CFRE028=o bytecode ldc* deve referir-se a uma constante
SHRC262=Bytes de dados         \= %d
CFRE027=o bytecode multianewarray deve referir-se a uma classe de matriz
SHRC261=Ativar sa\u00EDda detalhada interna de cadeia
CFRE026=tipo de bytecode newarray n\u00E3o reconhecido
SHRC260=Falha ao criar conjunto em ByteDataManager
CFRE025=o campo possui dois atributos ConstantValue
CFRE024=o nome da classe deve ser uma cadeia
CFRE023=conjunto de constantes vazio
CFRE022=thisClass deve ser uma classe
CFRE021=campo duplicado
CFRE020=o PC de in\u00EDcio do manipulador de exce\u00E7\u00F5es \u00E9 inv\u00E1lido
J2JX039=IBM \u00E9 uma marca registrada da IBM Corp.\nJava e todas as marcas e logotipos baseados em Java s\u00E3o marcas ou marcas\nregistradas da Sun Microsystems, Inc.
J2JX038=Materiais Licenciados - Propriedade da IBM
J2JX037=
J2JX036=Destino\: %s\n
J2JX035=(c) Copyright IBM Corp. 1991, 2005  Todos os Direitos Reservados
J2JX034=J9 Java(TM) JAR para JXE, Vers\u00E3o %s
SHRC259=N\u00E3o \u00E9 poss\u00EDvel digitar o mutex da tabela hash do Gerenciador
J2JX033=Erro Interno\: falha na constru\u00E7\u00E3o adequada da classe Error'd rom
SHRC258=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para entrada de tabela hash no Gerenciador
J2JX032=Aspas faltando na lista de par\u00E2metros
SHRC257=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para o item da lista vinculada no Gerenciador
J2JX031=leitura conclu\u00EDda do arquivo JAR\: %s
SHRC256=O cache compartilhado persistente "%1$s" foi destru\u00EDdo
J2JX030=Erro ao ler %1$s de %2$s
SHRC255=Erro ao atualizar arquivo de cache de classe compartilhado desde a \u00FAltima desconex\u00E3o na sa\u00EDda da JVM
SHRC254=Erro ao configurar comprimento do arquivo de cache de classe compartilhado
CFRE019=in\u00EDcio de PC de vari\u00E1vel local inv\u00E1lido
SHRC253=Erro ao gravar no arquivo de cache de classe compartilhado
CFRE018=a classe interna deve ser uma classe
SHRC252=Erro ao buscar no arquivo de cache de classe compartilhado
CFRE017=atributos StackMap/StackMapTable m\u00FAltiplos
SHRC251=N\u00E3o excluir automaticamente caches de diferentes buildIDs
CFRE016=\u00EDndice de vari\u00E1vel local fora do intervalo em incremento
SHRC250=O cache n\u00E3o pode ser aberto como de leitura uma vez que ele ainda n\u00E3o foi inicializado
CFRE015=as interfaces devem ser classes
CFRE014=Atributo de c\u00F3digo especificado para um m\u00E9todo nativo ou abstrato
CFRE013=comprimento de PC vari\u00E1vel local inv\u00E1lido
CFRE012=o valor constante deve ser um valor
CFRE011=o bytecode anewarray deve referir-se a uma classe
CFRE010=contagem negativa para pares de correspond\u00EAncia e deslocamento no bytecode lookupswitch
J2JX029=processando\: %s
J2JX028=Erro ao ler a entrada de %s
J2JX027=N\u00E3o foi poss\u00EDvel abrir ou ler %s
J2JX026=
J2JX025=Tentativa de incluir classe duplicada em JXE %s
J2JX024=arquivo de classe inclu\u00EDdo\: %s
SHRC249=Erro\: o modlevel do cabe\u00E7alho do arquivo de cache de classe compartilhado \u00E9 inv\u00E1lido
J2JX023=tentando incluir arquivo de classe\: %s
SHRC248=Erro\: a vers\u00E3o do cabe\u00E7alho do arquivo de cache de classe compartilhado \u00E9 inv\u00E1lida
J2JX022=%s \u00E9 inv\u00E1lido
SHRC247=Erro\: os dados de identifica\u00E7\u00E3o do cabe\u00E7alho do arquivo de cache de classe compartilhado s\u00E3o inv\u00E1lidos
J2JX021=N\u00E3o foi poss\u00EDvel carregar %1$s\: %2$s
SHRC246=%1$s
J2JX020=aumento no ncpRef [%1$x] de %2$u para %3$u entradas
SHRC245=Erro ao mapear o arquivo de cache de classe compartilhado
SHRC244=Erro ao obter comprimento do arquivo de cache de classe compartilhado
CFRE009=o campo de interface deve ser est\u00E1tico p\u00FAblico e final
SHRC243=Erro ao liberar o bloqueio de leitura de conex\u00E3o do arquivo de cache de classe compartilhado
CFRE008=alto < baixo no bytecode tableswitch
SHRC242=Erro ao atualizar o arquivo de cache de classe compartilhado desde a \u00FAltima desconex\u00E3o
CFRE007=a assinatura do campo \u00E9 inv\u00E1lida
SHRC241=Erro\: n\u00E3o \u00E9 poss\u00EDvel excluir o arquivo de cache de classe compartilhado
CFRE006=atributo StackMap/StackMapTable inv\u00E1lido
SHRC240=Erro\: n\u00E3o \u00E9 poss\u00EDvel adquirir bloqueio de grava\u00E7\u00E3o de conex\u00E3o do arquivo de cache de classe compartilhado
CFRE005=interface duplicada
CFRE004=bytecode desconhecido
CFRE003=vers\u00E3o principal inv\u00E1lida
CFRE002=o nome do m\u00E9todo \u00E9 inv\u00E1lido
CFRE001=%1$s; class\=%3$.*2$s, offset\=%4$u
CFRE000=%1$s; class\=%3$.*2$s, method\=%5$.*4$s%7$.*6$s, pc\=%8$u
J2SE000=\n
J2JX019=aumento no buffer [%1$x] de %2$u para %3$u
J2JX018=%s criado com \u00EAxito
J2JX017=Falha em gravar dados no arquivo\: %s
J2JX016=Falha em criar/limpar o arquivo\: %s
J2JX015=C\u00F3digo de erro desconhecido\: %d
J2JX014=Falha na inicializa\u00E7\u00E3o do AOT
SHRC239=Erro\: n\u00E3o \u00E9 poss\u00EDvel adquirir bloqueio de grava\u00E7\u00E3o do cabe\u00E7alho do arquivo de cache de classe compartilhado
J2JX013=Erro Interno\: Falha na invers\u00E3o do endian
J9CL015=Falha ao criar rastreio de pilha (muito provavelmente devido \u00E0 falta de mem\u00F3ria no S.O.)
SHRC238=Erro\: o cache de classe compartilhado n\u00E3o est\u00E1 conectado
J2JX012=O UUID fornecido \u00E9 inv\u00E1lido
J9CL014=%1$s\: op\u00E7\u00E3o n\u00E3o reconhecida --> '%2$s'
SHRC237=Aberto cache persistente de classes compartilhado %1$s
J2JX011=Erro Interno\: Entrada ZIP n\u00E3o fechada
J9CL013=Falha em alocar o monitor do S.O.
J9GC063=N\u00E3o \u00E9 poss\u00EDvel abrir nome do arquivo '%s' para grava\u00E7\u00E3o
SHRC236=Criado cache persistente de classes compartilhado %1$s
J2JX010=Erro Interno\: falha na leitura
J9CL012=
J9GC062=O valor %s deve ser uma pot\u00EAncia de dois
SHRC235=Erro ao adquirir bloqueio de leitura de conex\u00E3o de arquivo de cache de classe compartilhado
J9CL011=Falha em bifurcar o encadeamento do S.O.
J9GC061=tamanho m\u00E1ximo de espa\u00E7o de mem\u00F3ria com escopo definido
SHRC234=Erro ao adquirir bloqueio de leitura de conex\u00E3o de arquivo de cache de classe compartilhado
J9CL010=Falha em alocar JNIEnv
J9GC060=tamanho de espa\u00E7o de mem\u00F3ria permanente
SHRC233=Erro ao criar cabe\u00E7alho do arquivo de cache de classe compartilhado
SHRC232=N\u00E3o \u00E9 poss\u00EDvel criar monitor no modo de leitura
SHRC231=Erro ao configurar comprimento do arquivo de cache de classe compartilhado
SHRC230=Erro ao inicializar cabe\u00E7alho de dados do cache compartilhado
J2JX009=Erro Interno\: falha na busca
J2JX008=Erro Interno\: nenhuma entrada
J2JX007=Erro Interno\: Entrada Duplicada
J9CL009=Encadeamento j\u00E1 iniciado
J9GC059="A pol\u00EDtica metron\u00F4mica n\u00E3o \u00E9 permitida sem -Xrealtime"
J2JX006=Sem mem\u00F3ria
J9CL008=valor de tempo limite em nanossegundos fora do intervalo
J9GC058=Falha ao alocar espa\u00E7o de mem\u00F3ria permanente
J2JX005=Erro Interno\: incompatibilidade de tamanho
J9CL007=valor de tempo limite negativo
J9GC057=%1$s n\u00E3o pode ser maior do que %2$s
J2JX004=Erro Interno\: CRC MISMATCH
J9CL006=Nenhum dado de pr\u00E9-verifica\u00E7\u00E3o para java/lang/Object
J9GC056=tamanhos de p\u00E1ginas grandes dispon\u00EDveis\:
SHRC229=Erro\: o arquivo de cache de classe compartilhado possui um cabe\u00E7alho inv\u00E1lido
J2JX003=Erro Interno\: argumento de fun\u00E7\u00E3o inv\u00E1lido
J9CL005=Vers\u00E3o da biblioteca de classes incompat\u00EDvel\: requer VM v%1$i, encontrou-se v%2$i
J9GC055=tamanho de p\u00E1gina grande
SHRC228=Erro ao atualizar o cache de classe compartilhado desde a \u00FAltima conex\u00E3o
J2JX002=%1$d de %2$d m\u00E9todo(s) pr\u00E9-compilado(s) para o destino %3$s.
J9CL004=Vers\u00E3o da biblioteca de classes incompat\u00EDvel\: esperava-se JCL v%1$i, encontrou-se v%2$i
J9GC054=O Tamanho de P\u00E1gina grande %1$zu%2$s n\u00E3o \u00E9 um tamanho de p\u00E1gina suportado, utilizando ent\u00E3o %3$zu%4$s.
SHRC227=Erro ao adquirir bloqueio de grava\u00E7\u00E3o do cabe\u00E7alho de arquivo do cache de classe compartilhado
J2JX001=Recurso armazenado\: %s
J9CL003=Vers\u00E3o da biblioteca de classes incompat\u00EDvel\: JCL %1$x, VM %2$x
J9GC053=m\u00E1ximo de mem\u00F3ria
SHRC226=Erro ao abrir o arquivo de cache de classe compartilhado
J2JX000=Tentativa de incluir o arquivo de recursos duplicado [%s], arquivo ignorado.
J9CL002=As classes s\u00E3o de uma biblioteca diferente de J9 ou um JXE reduzido incorretamente
J9GC052=incremento do segmento de classe ROM
SHRC225=Erro ao obter caminho de arquivo de cache
J9CL001=Tentar executando com -jcl\:%s
J9GC051=incremento do segmento de classe RAM
SHRC224=Sem mem\u00F3ria para c\u00F3pia local de nome do cache
J9CL000=Biblioteca de classes incompat\u00EDvel
J9GC050=m\u00E1ximo de mem\u00F3ria virtual
SHRC223=O caches de classe compartilhado persistente n\u00E3o pode ser criado/utilizado, pois o bloqueio de arquivo n\u00E3o \u00E9 suportado
SHRC222=O cache de classe compartilhado persistente n\u00E3o pode ser criado/utilizado, pois o mapeamento de mem\u00F3ria n\u00E3o suporta os recursos necess\u00E1rios
SHRC221=Mensagem de erro de plataforma\: %1$s
SHRC220=C\u00F3digo de erro de camada da porta \= %1$d
J9GC049=tamanho configurado lembrado
J9GC048=incremento de espa\u00E7o antigo
J9GC047=tamanho m\u00E1ximo de espa\u00E7o antigo
J9GC046=tamanho de espa\u00E7o inicial antigo
SHRC219=[-Xshareclasses acesso de grupo ativado para novos caches]
J9GC045=tamanho de mem\u00F3ria inicial
SHRC218=[-Xshareclasses cache persistente desativado]
J9GC044=tamanho m\u00E1ximo de espa\u00E7o novo
SHRC217=[-Xshareclasses cache persistente ativado]
J9GC043=tamanho de novo espa\u00E7o inicial
SHRC216=Criar cache de classe compartilhado n\u00E3o-persistente
J9GC042=A soma de %1$s e %2$s \u00E9 muito pequena para %3$s
SHRC215=Criar cache de classe compartilhado persistente
J9GC041=Tipo fvtest desconhecido\: %s
SHRC214=N\u00E3o \u00E9 poss\u00EDvel digitar mutex de tabela hash ByteDataManager
J9GC040=Op\u00E7\u00E3o desconhecida\: %s
SHRC213=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para entrada de tabela hash em ByteDataManagerImpl
SHRC212=Armazenando dados de bytes para a chave %.*s no cache compartilhado...
SHRC211=Localizando dados de bytes para a chave %.*s no cache compartilhado...
SHRC210=[-Xshareclasses sa\u00EDda detalhada de dados de bytes ativada]
J9GC039=*** %1$s reprovado\: utilize %2$s no lugar ***
J9GC038=O valor de %s especificado \u00E9 muito grande
J9GC037=%1$s n\u00E3o suportado com valores diferentes de %2$zu
J9GC036=O valor de %1$s deve ser superior a %2$zu
SHRC209=Ativar sa\u00EDda detalhada de dados de bytes
J9GC035=%s deve ser seguido por um n\u00FAmero
SHRC208=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para conjunto de itens de tabela hash em CompiledMethodManagerImpl
J9GC034=O valor de %1$s deve estar entre %2$zu e %3$zu (inclusive)
SHRC207=N\u00E3o \u00E9 poss\u00EDvel digitar mutex de tabela hash CompiledMethodManager
J9GC033=O valor de %1$s deve estar entre %2$.2f e %3$.2f (inclusive)
SHRC206=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para entrada de tabela hash em CompiledMethodManagerImpl
J9GC032=A configura\u00E7\u00E3o do sistema n\u00E3o suporta a op\u00E7\u00E3o '%s'
SHRC205=Falha ao criar novo item de tabela hash em CompiledMethodManagerImpl
J9GC031=Erro de op\u00E7\u00E3o\: '%1$s' e '%2$s' n\u00E3o podem ser ambos especificados
SHRC204=N\u00E3o \u00E9 poss\u00EDvel criar o mutex da tabela hash no Gerenciador de classes compartilhado
J9GC030=O valor de %1$s de %2$.2f deve ser, pelo menos, %3$s menor que o valor de %4$s de %5$.2f
SHRC203=N\u00E3o \u00E9 poss\u00EDvel criar tabela hash no Gerenciador de classes compartilhado
SHRC202=Falha ao inicializar conjuntos no Gerenciador de classes compartilhado
SHRC201=\ Substitui\u00E7\u00E3o bem-sucedida de %2$.*1$s.
SHRC200=\ Localiza\u00E7\u00E3o bem-sucedida de %2$.*1$s.
J9GC029=Erro de op\u00E7\u00E3o\: '%s'
J9GC028=Op\u00E7\u00E3o muito grande\: '%s'
J9GC027=Op\u00E7\u00E3o malformada\: '%s'
J9GC026=-Xverbosegclog falhou na aloca\u00E7\u00E3o de estruturas internas
JNCK094=Erro de JNI em %1$s\: Os dados apontados pelo argumento \#%2$d foram modificados durante a execu\u00E7\u00E3o de %3$s. Os dados podem ter sido modificados por outro encadeamento ou por uma chamada aninhada. O resultado de %4$s pode estar incorreto e o VM pode se tornar inst\u00E1vel
J9GC025=
JNCK093=Erro de JNI em %s\: O m\u00E9todo n\u00E3o \u00E9 um construtor
J9GC024=A soma de %1$s e %2$s \u00E9 muito grande para heap
JNCK092=\tvalist         verifica o reuso de va_list
J9GC023=A soma de %1$s e %2$s deve ser igual a %3$s
JNCK091=Detectada recomenda\u00E7\u00E3o no quadro do manipulador de um evento JVMPI ou JVMTI\n
J9GC022=A soma de %1$s e %2$s \u00E9 muito grande para %3$s
JNCK090=Detectado aviso no quadro do manipulador de um evento JVMPI ou JVMTI\n
J9GC021=%1$s deve ser igual a %2$s
J9GC020=%s muito grande para heap
JITM007=C\u00F3digo AOT incompat\u00EDvel com configura\u00E7\u00F5es de JVMPI/JVMTI. Ignorando c\u00F3digo AOT no cache de classe compartilhado.
JITM006=O c\u00F3digo AOT no cache de classe compartilhado utiliza uma pol\u00EDtica de GC diferente da JVM atual. Ignorando c\u00F3digo AOT no cache de classe compartilhado.
JITM005=O c\u00F3digo AOT gerado com outro release de JVM n\u00E3o pode ser executado com este release de JVM. Ignorando c\u00F3digo AOT no cache de classe compartilhado.
JITM004=O c\u00F3digo AOT no cache de classe compartilhado n\u00E3o pode ser executado no processador atual. Ignorando c\u00F3digo AOT no cache de classe compartilhado.
JITM003=Falha durante a inicializa\u00E7\u00E3o do tempo de execu\u00E7\u00E3o de AOT. Ignorando c\u00F3digo AOT no cache de classe compartilhado.
JITM002=Falha ao armazenar c\u00F3digo AOT no cache de classe compartilhado. O cache de classe compartilhado pode estar danificado. Ignorando c\u00F3digo AOT no cache de classe compartilhado.
JITM001=N\u00E3o h\u00E1 mais espa\u00E7o para o c\u00F3digo AOT no cache de classe compartilhado. O novo c\u00F3digo AOT n\u00E3o ser\u00E1 gerado.
JITM000=Hardware N\u00E3o Suportado [%d].
JNCK089=Detectado erro no quadro do manipulador de um evento JVMPI ou JVMTI\n
JNCK088=Aviso de JNI em %1$s\: O argumento \#%2$d \u00E9 uma refer\u00EAncia fraca. Uma refer\u00EAncia fraca pode se tornar NULA a qualquer momento. A refer\u00EAncia deve ser promovida utilizando NewLocalRef ou NewGlobalRef e, em seguida, comparada com NULO antes de chamar %3$s
J9GC019=%1$s muito grande para %2$s
JNCK087=Erro de JNI em \#%1$s\: O argumento \#%2$d n\u00E3o \u00E9 java/lang/reflect/Method ou java/lang/reflect/Constructor
J9GC018=%1$s muito pequeno para %2$s
JNCK086=Aviso de JNI em %1$s\: O argumento \#%2$d n\u00E3o \u00E9 um java/nio/Buffer. %3$s retornar\u00E1 um c\u00F3digo de erro
J9GC017=%1$s muito pequeno, deve ser pelo menos %2$zu %3$sbytes
JNCK085=Orienta\u00E7\u00E3o detectada em JNI_OnLoad da biblioteca %.*s\n
J9GC016=Falha em alocar segmento subsistente no espa\u00E7o de mem\u00F3ria padr\u00E3o
JNCK084=Aviso detectado em JNI_OnLoad da biblioteca %.*s\n
J9GC015=Falha em alocar espa\u00E7o de mem\u00F3ria padr\u00E3o
JNCK083=Erro detectado em JNI_OnLoad da biblioteca %.*s\n
J9GC014=Falha em alocar segmentos de mem\u00F3ria da classe VM
JNCK082=A orienta\u00E7\u00E3o foi detectada no quadro mais externo de um encadeamento conectado\n
J9GC013=Falha em alocar segmentos de mem\u00F3ria de objeto VM
JNCK081=O aviso foi detectado no quadro mais externo de um encadeamento conectado\n
J9GC012=Falha em alocar segmentos de mem\u00F3ria VM
JNCK080=O erro foi detectado no quadro mais externo de um encadeamento conectado\n
J9GC011=Falha em inicializar o conjunto de espa\u00E7os de mem\u00F3ria
J9GC010=Falha em inicializar o gerenciamento do finalizador
VRFY040=verificador n\u00E3o conseguiu alocar mem\u00F3ria nativa
JNCK079=Orienta\u00E7\u00E3o detectada em %2$.*1$s.%4$.*3$s%6$.*5$s\n
JNCK078=Aviso detectado em %2$.*1$s.%4$.*3$s%6$.*5$s\n
J9GC009=Falha em inicializar o mutex para estat\u00EDsticas de GC
JNCK077=Erro detectado em %2$.*1$s.%4$.*3$s%6$.*5$s\n
J9GC008=Falha em inicializar extens\u00F5es do m\u00F3dulo
JNCK076=Erro interno de jnichk em %s\: Sem mem\u00F3ria
J9GC007=Falha em inicializar, n\u00E3o foi poss\u00EDvel analisar a linha de comandos
JNCK075=Erro interno de jnichk em %1$s\: Descritor n\u00E3o reconhecido 0x%2$x
J9GC006=Falha em inicializar, sem mem\u00F3ria
JNCK074=Orienta\u00E7\u00E3o de JNI em %s\: Parece que o buffer n\u00E3o foi modificado. Considere a possibilidade de utilizar JNI_ABORT, em vez de modo 0.
J9GC005=Falha em inicializar
JNCK073=Orienta\u00E7\u00E3o de JNI em %1$s\: JNI_ABORT foi especificado, mas n\u00E3o pode ser honrado porque os dados foram modificados.\n(CRC original\=0x%2$x, novo CRC\=0x%3$x).\nComo %4$s retornou o conte\u00FAdo real da matriz, as altera\u00E7\u00F5es n\u00E3o ser\u00E3o descartadas. Isto pode n\u00E3o ser o que voc\u00EA desejada.
J9GC004=Falha em instanciar o coletor de lixo global
JNCK072=Orienta\u00E7\u00E3o de JNI em %1$s\: JNI_COMMIT foi especificado, mas ser\u00E1 ignorado.\nComo %2$s retornou o conte\u00FAdo real da matriz, o buffer ser\u00E1 inv\u00E1lido ap\u00F3s esta chamada. Isto pode n\u00E3o ser o que voc\u00EA desejada.
J9GC003=Falha em instanciar o dispatcher de tarefas
JNCK071=Aviso de JNI\: A mem\u00F3ria em 0x%1$p, obtida por %2$s, n\u00E3o foi liberada antes de retornar de nativo. Provavelmente, seja uma fuga de mem\u00F3ria.
J9GC002=Falha em instanciar heap. %1$zu%2$s pedido
JNCK070=Aviso de JNI em %1$s\: Dados originais da matriz foram modificados entre %2$s e %3$s.\n(CRC original\=0x%4$x, novo CRC\=0x%5$x).\nComo %6$s retornou uma c\u00F3pia do conte\u00FAdo da matriz, o novo conte\u00FAdo ser\u00E1 perdido.
J9GC001=Falha em instanciar heap
J9GC000=Erro Interno, Sem Mem\u00F3ria
VRFY039=bytecode desconhecido
VRFY038=invokespecial em destino inv\u00E1lido
VRFY037=objeto n\u00E3o inicializado durante ramifica\u00E7\u00E3o de retrocesso
VRFY036=underflow de pilha
VRFY035=sem erro
SHRC099=%1$d\: 0x%2$p ORPHAN\: %4$.*3$s em 0x%5$p.
VRFY034=PC de destino inv\u00E1lido
SHRC098=\nEstat\u00EDsticas atuais para o cache %s\: \n
VRFY033=campo de tipo n\u00E3o compat\u00EDvel
SHRC097=O cache compartilhado "%s" est\u00E1 corrompido. Nenhum JVM novo ter\u00E1 permiss\u00E3o para conectar-se com o cache.\n\tJVMs existentes podem continuar a funcionar mas n\u00E3o podem atualizar o cache.
VRFY032=receptor inv\u00E1lido para <init>
SHRC096=O cache compartilhado "%s" est\u00E1 completo. Utilize -Xscmx para configurar o tamanho do cache.
VRFY031=tentativa para iinc n\u00E3o inteiro
SHRC095=As tentativas de chamar markStale nos itens de cache compartilhados falharam
VRFY030=tipo inv\u00E1lido na pilha
SHRC094=\u00D3rf\u00E3o localizado mas o ROMClass local foi transmitido para addROMClassToCache
SHRC093=Foi detectado um encerramento inesperado de outra JVM durante a atualiza\u00E7\u00E3o
SHRC092=Falha ADD ao ler cache
SHRC091=Leitura de dados corrompidos para o item 0x%p (dataType inv\u00E1lido)
SHRC090=Falha ao obter mutex de cache na inicializa\u00E7\u00E3o de SH_CacheMap
JNCK069=Aviso de JNI em %1$s\: Fim est\u00E1 fora do intervalo (%2$d + %3$d > %4$d)
JNCK068=Aviso de JNI em %1$s\: O in\u00EDcio ou \u00EDndice est\u00E1 fora do intervalo (%2$d >\= %3$d)
JNCK067=Aviso de JNI em %1$s\: Tamanho de regi\u00E3o negativo (%2$d) especificado
JNCK066=Aviso de JNI em %1$s\: In\u00EDcio ou \u00EDndice negativo (%2$d) especificado
JNCK065=Aviso JNI em %1$s\: Aumento autom\u00E1tico da capacidade de quadro de refer\u00EAncia local de %2$d para %3$d. %4$d refer\u00EAncias est\u00E3o em uso.\nUtilize EnsureLocalCapacity ou PushLocalFrame para aumentar explicitamente o quadro.
JNCK064=Aviso JNI em %1$s\: Aumento autom\u00E1tico fraco da capacidade do conjunto de refer\u00EAncia de %2$d para %3$d.\nIsto pode ser um indicador de fuga de mem\u00F3ria.
JNCK063=Aviso JNI em %1$s\: Aumento autom\u00E1tico da capacidade do conjunto de refer\u00EAncias global de %2$d para %3$d.\nIsto pode ser um indicador de fuga de mem\u00F3ria.
JNCK062=Aviso de JNI em %s\: Esta fun\u00E7\u00E3o n\u00E3o deve ser chamada dentro de uma se\u00E7\u00E3o cr\u00EDtica
JNCK061=Aviso de JNI em %1$s\: O argumento \#%2$d \u00E9 uma assinatura de campo malformada ("%3$s")
JNCK060=Aviso de JNI em %1$s\: O argumento \#%2$d \u00E9 uma assinatura de m\u00E9todo malformada ("%3$s")
VRFY029=returnAddress inv\u00E1lido para instru\u00E7\u00E3o ret
VRFY028=dimens\u00E3o inv\u00E1lida
VRFY027=o receptor \u00E9 incompat\u00EDvel com classe de declara\u00E7\u00E3o
VRFY026=EOF inesperado
VRFY025=acesso inv\u00E1lido a dados protegidos
SHRC089=N\u00E3o \u00E9 poss\u00EDvel criar mutex de atualiza\u00E7\u00E3o em SH_CacheMap
VRFY024=os argumentos n\u00E3o s\u00E3o de tipo compat\u00EDvel
SHRC088=Falha ao criar cache como ROMImageSegment em SH_CacheMap
VRFY023=par\u00E2metro tableswitch n\u00E3o inteiro
SHRC087=MarkStale falhou durante ClasspathManager\:\:update()
VRFY022=as sub-rotinas devem ser percorridas novamente para cada jsr
SHRC086=N\u00E3o \u00E9 poss\u00EDvel digitar o mutex da tabela hash ClasspathManager
VRFY021=emitido objeto que n\u00E3o pode ser emitido
SHRC085=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para o cabe\u00E7alho do item da lista vinculada
VRFY020=argumentos de chamada de tipo n\u00E3o compat\u00EDvel
SHRC084=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para o item da lista vinculada
SHRC083=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para a matriz identifiedClasspaths em SH_ClasspathManagerImpl2
SHRC082=N\u00E3o \u00E9 poss\u00EDvel criar identifiedMutex em SH_ClasspathManagerImpl2
SHRC081=N\u00E3o \u00E9 poss\u00EDvel criar cpeTableMutex em SH_ClasspathManagerImpl2
SHRC080=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para a entrada da tabela hash
JNCK059=Aviso de JNI em %1$s\: O argumento \#%2$d \u00E9 um identificador malformado ("%3$s")
JNCK058=Aviso de JNI em %1$s\: Depois de chamar %2$s, voc\u00EA deve verificar se h\u00E1 exce\u00E7\u00F5es utilizando ExceptionCheck, ExceptionClear ou ExceptionOccurred antes de chamar %3$s
JNCK057=Erro de JNI em %1$s\: N\u00E3o utilize %2$s para liberar mem\u00F3ria 0x%3$p adquirida utilizando %4$s
JNCK056=Erro de JNI em %1$s\: A mem\u00F3ria 0x%2$p foi obtida do objeto 0x%3$p, liberando de 0x%4$p
VMUT002=(erro de acesso)
JNCK055=Erro de JNI em %1$s\: O ponteiro 0x%2$p n\u00E3o foi retornado por nenhuma fun\u00E7\u00E3o da JNI ou j\u00E1 foi liberado
VMUT001=(encadeamento sem nome)
JNCK054=Erro de JNI em %1$s\: Op\u00E7\u00E3o de modo n\u00E3o reconhecida %2$d
VMUT000=(sem mem\u00F3ria)
JNCK053=Erro de JNI\: A se\u00E7\u00E3o cr\u00EDtica deve ser liberada antes da fun\u00E7\u00E3o ser retornada
JNCK052=Erro de JNI em %1$s\: A classe %3$.*2$s \u00E9 obsoleta
JNCK051=Erro interno de VM em %1$s\: Os bytes enviados %2$p s\u00E3o menores do que os bytes de refer\u00EAncia JNI %3$p
JNCK050=Erro de JNI em %s\: PopLocalFrame foi chamado sem um quadro local na pilha
VRFY019=falha de carregamento de classe
VRFY018=pilha m\u00E1x. excedida
VRFY017=<init> n\u00E3o chama este <init> ou super <init>
VRFY016=par\u00E2metro de bytecode shift n\u00E3o inteiro
VRFY015=v\u00E1rios retornos para um \u00FAnico jsr
SHRC079=N\u00E3o \u00E9 poss\u00EDvel criar a tabela hash em SH_ClasspathManagerImpl2
VRFY014=bytecode return incompat\u00EDvel com tipo de retorno
SHRC078=Falha ao criar o conjunto linkedListHdr em SH_ClasspathManagerImpl2
VRFY013=restri\u00E7\u00E3o de carregamento de classe violado
SHRC077=Falha ao criar o conjunto linkedListImpl em SH_ClasspathManagerImpl2
VRFY012=formato de pilha inconsistente
SHRC076=Localizando a classe %1$s no cache compartilhado para cldr id %2$d...
VRFY011=par\u00E2metro lookupswitch n\u00E3o inteiro
SHRC075=\ Falhou.
VRFY010=v\u00E1rios jsrs utilizam um \u00FAnico retorno
SHRC074=\ Com \u00CAxito.
SHRC073=Armazenando a classe %2$.*1$s no cache compartilhado para cldr id %3$d com URL %5$.*4$s (\u00EDndice %6$d)...
SHRC072=A op\u00E7\u00E3o da linha de comandos "%s" n\u00E3o \u00E9 reconhecida
SHRC071=A op\u00E7\u00E3o da linha de comandos "%s" requer a subop\u00E7\u00E3o
SHRC070=Atualiza\u00E7\u00F5es incrementais desativadas
JNCK049=Erro de JNI em %s\: reutiliza\u00E7\u00E3o de va_list detectada
JNCK048=Erro de JNI em %s\: Receptor n\u00E3o qualificado
JNCK047=Erro de JNI em %s\: Argumento clazz incorreto
JNCK046=Erro de JNI em %1$s\: O m\u00E9todo tem tipo de retorno incorreto ('%2$c')
JNCK045=Erro de JNI em %s\: O m\u00E9todo n\u00E3o \u00E9 est\u00E1tico
JNCK044=Erro de JNI em %s\: O m\u00E9todo \u00E9 est\u00E1tico
JNCK043=Erro de JNI em %1$s\: Argumento \#%2$d; imposs\u00EDvel localizar %3$s
JNCK042=Erro de JNI em %1$s\: O argumento \#%2$d n\u00E3o \u00E9 uma subclasse de %3$s
JNCK041=Erro de JNI em %1$s\: O argumento \#%2$d est\u00E1 fora do intervalo para um %3$s (0x%4$x > 0x%5$x)
JNCK040=Erro de JNI em %1$s\: O argumento \#%2$d est\u00E1 fora do intervalo para um %3$s (0x%4$x < 0x%5$x)
VRFY009=matriz de tipo n\u00E3o compat\u00EDvel
VRFY008=\u00EDndice de matriz n\u00E3o inteiro
VRFY007=m\u00E9todo final substitu\u00EDdo
VRFY006=tamanho de nova matriz n\u00E3o inteiro
VRFY005=tipo local n\u00E3o compat\u00EDvel
SHRC069=Redu\u00E7\u00E3o simult\u00E2nea de conten\u00E7\u00E3o de armazenamento desativada
VRFY004=jsr em seq\u00FC\u00EAncia encontrou excessivos jsrs
SHRC068=Armazenamento em cache local de caminhos de classe desativado
VRFY003=a classe n\u00E3o cont\u00E9m dados de pr\u00E9-verifica\u00E7\u00E3o
SHRC067=Verifica\u00E7\u00E3o do registro de data e hora desativada
VRFY002=seq\u00FC\u00EAncia de bytecode inv\u00E1lida
SHRC066=Bloqueio de tabelas hash locais desativado
VRFY001=%1$s; class\=%3$.*2$s, method\=%5$.*4$s%7$.*6$s
SHRC065=N\u00E3o \u00E9 poss\u00EDvel alocar o conjunto em shrinit
VRFY000=%1$s; class\=%3$.*2$s, method\=%5$.*4$s%7$.*6$s, pc\=%8$u
SHRC064=Falha ao criar configMonitor em shrinit
SHRC063=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para sharedClassConfig em shrinit
SHRC062=Erro ao copiar o nome do usu\u00E1rio no nome de cache padr\u00E3o
SHRC061=O nome do cache n\u00E3o deve ter mais de 64 caracteres. O cache n\u00E3o foi criado.
SHRC060=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para o buffer de cadeia em shrinit\:\:hookFindSharedClass
JNCK039=Erro de JNI em %1$s\: O argumento \#%2$d \u00E9 NULL
JNCK038=Erro de JNI em %1$s\: O argumento \#%2$d (0x%3$p) n\u00E3o \u00E9 uma refer\u00EAncia do objeto v\u00E1lida. Seu tipo \u00E9\: %4$s\n
JNCK037=Erro de JNI em %1$s\: O argumento \#%2$d (0x%3$p) n\u00E3o \u00E9 uma refer\u00EAncia local. Seu tipo \u00E9\: %4$s
JNCK036=Erro de JNI em %1$s\: O argumento \#%2$d (0x%3$p) n\u00E3o \u00E9 uma refer\u00EAncia global fraca. Seu tipo \u00E9\: %4$s
JNCK035=Erro de JNI em %1$s\: O argumento \#%2$d (0x%3$p) n\u00E3o \u00E9 uma refer\u00EAncia global. Seu tipo \u00E9\: %4$s
JNCK034=Erro de JNI em \#%1$s\: O argumento \#%2$d n\u00E3o \u00E9 %3$s
JNCK033=Erro de JNI em \#%1$s\: O argumento \#%2$d n\u00E3o \u00E9 jarray
JNCK032=Erro de JNI em %1$s\: O argumento \#%2$d n\u00E3o \u00E9 jobjectArray
JNCK031=Erro de JNI em %1$s\: O argumento \#%2$d \u00E9 NULL
JNCK030=Erro de JNI em %s\: Esta fun\u00E7\u00E3o n\u00E3o pode ser chamada enquanto o GC est\u00E1 desativado (provavelmente, ela foi chamada a partir de um evento JVMPI ou JVMTI)
JDTS000=Atendendo o transporte dt_socket no endere\u00E7o\: %d
SHRC059=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para ClasspathItem em shrinit\:\:hookFindSharedClass
SHRC058=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para ClasspathItem em shrinit\:\:hookStoreSharedClass
SHRC057=Par\u00E2metros incorretos para op\u00E7\u00E3o de expira\u00E7\u00E3o
SHRC056=A op\u00E7\u00E3o da linha de comandos "%s" n\u00E3o \u00E9 reconhecida
SHRC055=Desativar atualiza\u00E7\u00F5es de cache incrementais
IREL001=
SHRC054=Desativar algoritmo para reduzir a conten\u00E7\u00E3o de armazenamento
IREL000=O c\u00F3digo AOT de %1$s.jar gerado pela vers\u00E3o %2$s do JVM n\u00E3o \u00E9 compat\u00EDvel com a vers\u00E3o atual %3$s do JVM.
SHRC053=Desativar bloqueio da tabela hash local
SHRC052=Desativar armazenamento em cache de caminho de classe local
SHRC051=Desativar atualiza\u00E7\u00F5es din\u00E2micas
SHRC050=Ativar sa\u00EDda detalhada
JNCK029=Erro de JNI em %s\: Esta fun\u00E7\u00E3o n\u00E3o pode ser chamada dentro de uma se\u00E7\u00E3o cr\u00EDtica
JNCK028=Erro de JNI em %s\: Esta fun\u00E7\u00E3o n\u00E3o pode ser chamada quando uma exce\u00E7\u00E3o est\u00E1 pendente
JNCK027=Erro JNI em %s\: JNIEnv n\u00E3o \u00E9 o JNIEnv para o encadeamento ativo
JNCK026=Erro JNI em %s\: JNIEnv n\u00E3o parece ser um encadeamento v\u00E1lido, a mem\u00F3ria foi corrompida ou esta n\u00E3o \u00E9 uma m\u00E1quina virtual J9
JNCK025=Utilize -Xcheck\:jni\:nonfatal para continuar executando quando forem detectados erros.
JNCK024=Foi detectado erro de JNI. Interrompendo.
JNCK023=Foi detectado erro de JNI. Continuando...
JNCK022=refer\u00EAncia local liberada(?)
JNCK021=refer\u00EAncia local em outro encadeamento
JNCK020=refer\u00EAncia do depurador
SHRC049=Modo de depura\u00E7\u00E3o que verifica todos os bytecodes de entrada
SHRC048=Listar todos os elementos em cache
SHRC047=Imprimir resumo de estat\u00EDsticas de cache
SHRC046=Exibir todos os caches compartilhados e suas estat\u00EDsticas
SHRC045=Destruir caches que n\u00E3o foram utilizados por <t> minutos
SHRC044=OPTION_MODIFIED_EQUALS"<modContext>"
SHRC043=Ativar compartilhamento de bytecode modificado\n\t<modContext> \u00E9 um descritor de usu\u00E1rio que descreve o tipo de modifica\u00E7\u00E3o\n\tOs JVMs que usam o mesmo <modContext> devem usar as mesmas modifica\u00E7\u00F5es
SHRC042=Destruir todos os caches compartilhados
SHRC041=Destruir cache compartilhado (usar par\u00E2m. de nome ou padr\u00E3o)
SHRC040=Especificar nome de cache compartilhado
JNCK019=refer\u00EAncia global fraca
JNCK018=refer\u00EAncia global
JNCK017=refer\u00EAncia local
JNCK016=NULL
JNCK015=\thelp          imprime esta tela
JNCK014=\tpedantic      executa verifica\u00E7\u00F5es mais cuidadosas, mas mais lentas
JNCK013=\tnovalist      n\u00E3o verifica reutiliza\u00E7\u00E3o va_list
JNCK012=\tnoadvice       n\u00E3o exibe orienta\u00E7\u00E3o
JNCK011=\tnowarn         n\u00E3o exibe avisos
JNCK010=\tnonfatal       n\u00E3o sai quando erros s\u00E3o detectados
SHRC039=Imprimir ajuda compartilhada geral
SHRC038=Uso\:\n\njava -Xshareclasses[\:option,...]\n\nAs op\u00E7\u00F5es v\u00E1lidas inclu\u00EDdas (com breve resumo) s\u00E3o\:\n\n
SHRC037=Atualiza\u00E7\u00F5es incrementais desativadas
SHRC036=Redu\u00E7\u00E3o simult\u00E2nea de conten\u00E7\u00E3o de armazenamento desativada
SHRC035=Armazenamento em cache local de caminhos de classe desativado
SHRC034=Verifica\u00E7\u00E3o do time stamp desativada
SHRC033=Bloqueio de tabelas hash locais desativado
SHRC032=O Cache de Classe Compartilhado que voc\u00EA est\u00E1 conectando tem n\u00EDvel de modifica\u00E7\u00E3o incorreto.
SHRC031=O Cache de Classe Compartilhado que voc\u00EA est\u00E1 conectando tem vers\u00E3o de JVM incompat\u00EDvel.
SHRC030=O Cache de Classe Compartilhado que voc\u00EA est\u00E1 conectando tem cabe\u00E7alho inv\u00E1lido.
JNCK009=\tnobounds       n\u00E3o executa verifica\u00E7\u00E3o de limites em cadeias e matrizes
JNCK008=\ttrace          rastreia todas as fun\u00E7\u00F5es de JNI
JNCK007=\tverbose        rastreia determinadas fun\u00E7\u00F5es e atividades de JNI
JNCK006=\tall            verifica classes de aplicativo e de sistema
JNCK005=Uso\: -Xcheck\:jni\:[op\u00E7\u00E3o[,op\u00E7\u00E3o[,...]]]
JNCK004=jnichk - Utilit\u00E1rio de verifica\u00E7\u00E3o JNI para J9, Vers\u00E3o %s
JNCK003=Utilit\u00E1rio de verifica\u00E7\u00E3o JNI\: imposs\u00EDvel alocar mem\u00F3ria local VM
JNCK002=Utilit\u00E1rio de verifica\u00E7\u00E3o JNI\: imposs\u00EDvel registrar evento
JNCK001=Utilit\u00E1rio de verifica\u00E7\u00E3o JNI instalado. Utilize -Xcheck\:jni\:help para uso
JNCK000=-Xcheck\:jni\: op\u00E7\u00E3o n\u00E3o reconhecida --> '%s'
J9TI032=Reconfigure as op\u00E7\u00F5es de dump de VM.
J9TI031=Indica que um encadeamento processou o evento ass\u00EDncrono
J9TI030=Cancela o evento ass\u00EDncrono em um \u00FAnico encadeamento ou em todos os encadeamentos
