#Wed Nov 05 17:43:40 EST 2008
SHRC029=No hi ha prou mem\u00F2ria al sistema
SHRC028=Perm\u00EDs denegat
SHRC027=El nom de la mem\u00F2ria cache compartida \u00E9s massa llarg
SHRC026=No es pot crear la mem\u00F2ria cache de la grand\u00E0ria sol\u00B7licitada\: consulteu els valors de SHMMAX i SHMMIN
SHRC025=error en connectar la mem\u00F2ria compartida
SHRC024=error de desconnexi\u00F3 de mem\u00F2ria compartida
SHRC023=La mem\u00F2ria cache no existeix
SHRC022=Error en crear la regi\u00F3 de mem\u00F2ria compartida
SHRC021=S'ha retornat un codi d'error desconegut
SHRC020=S'ha produ\u00EFt un error en obrir el sem\u00E0for
J9TI029=Assenyala l'esdeveniment as\u00EDncron en un fil \u00FAnic o tots els fils
J9TI028=Informa del final d'un buidatge de RAS.
J9TI027=Informa de l'inici d'un buidatge de RAS.
J9TI026=Desencadena un buidatge que utilitza la configuraci\u00F3 de RAS subministrada.
J9TI025=Permet JNI directe en pres\u00E8ncia d'esdeveniments d'entrada i sortida (la qual cosa d\u00F3na com a resultat la possible notificaci\u00F3 imprecisa de l'entrada i sortida).
J9TI024=Sortida de m\u00E8tode sense valor de retorn.
J9TI023=Obt\u00E9 informaci\u00F3 de marc ampliada per a la llista de fils.
J9TI022=Obt\u00E9 informaci\u00F3 de marc ampliada per a totes les traces de piles.
J9TI021=Obt\u00E9 informaci\u00F3 de marc ampliada.
J9VM066=el tipus d'argument no coincideix
J9TI020=Obt\u00E9 l'ID de fil de sistema operatiu d'un jthread
J9VM065=l'objecte no \u00E9s una inst\u00E0ncia de classe de declaraci\u00F3
J9VM064=setDumpOption necessita %s
J9VM063=seekDumpAgent necessita %s
J9VM062=removeDumpAgent necessita %s
J9VM061=insertDumpAgent necessita %s
J9VM060=runNamedDump(%1$s) necessita %2$s
SHRC019=la longitud de la sol\u00B7licitud \u00E9s massa petita
SHRC018=no es pot assignar la mem\u00F2ria
SHRC017=Codi d'error\: %d
SHRC016=Error de la mem\u00F2ria cache compartida de classes\:
SHRC015=Error de la mem\u00F2ria cache compartida de classes\: identificador no v\u00E0lid
SHRC014=No s'ha pogut eliminar el sem\u00E0for de la mem\u00F2ria cache compartida %s
SHRC013=No s'ha pogut eliminat la mem\u00F2ria cache compartida %s
SHRC012=No es pot eliminar la mem\u00F2ria cache compartida %s ja que encara hi ha JVM connectades a la mem\u00F2ria cache
SHRC011=Error\: no es pot obrir la mem\u00F2ria cache compartida de classes
SHRC010=S'ha destru\u00EFt la mem\u00F2ria cau compartida "%s"
J9TI019=Estableix la modalitat de notificaci\u00F3 per a esdeveniments ampliats, la qual cosa permet la selectivitat de nivell de fil.
J9TI018=Estableix un m\u00E8tode per a la notificaci\u00F3 d'entrada i sortida selectiva.
J9TI017=Controla diverses VM i opcions de compilaci\u00F3.
J9TI016=Permet l'inlining en pres\u00E8ncia d'esdeveniments d'entrada i sortida de m\u00E8tode (la qual cosa d\u00F3na com a resultat la possible notificaci\u00F3 imprecisa de l'entrada i sortida).
J9TI015=Sol\u00B7licita el buidatge del Java Lock Monitor (JLM).
J9TI014=Controla el Java Lock Monitor (JLM) (COM_IBM_JLM_START, COM_IBM_JLM_START_TIME_STAMP, COM_IBM_JLM_STOP, COM_IBM_JLM_STOP_TIME_STAMP).
J9VM059=-Xscmaxaot es passa per alt si no s'especifica -Xshareclasses
J9TI013=Permet crides de resposta per a assignacions instrumentalitzables (les que notifica VMObjectAlloc).
J9VM058=-Xscminaot es passa per alt si no s'especifica -Xshareclasses
J9TI012=Afegeix una opci\u00F3 -Xdump din\u00E0mica
J9VM057=S'ha superat el l\u00EDmit de mem\u00F2ria cau de supervisi\u00F3
J9TI011=Afegeix una opci\u00F3 -Xtrace din\u00E0mica
J9VM056=Versi\u00F3 principal
J9TI010=Entrada de m\u00E8tode amb informaci\u00F3 ampliada sobre el tipus de m\u00E8tode.
J9VM055=Error molt greu\: la versi\u00F3 principal de JXE \u00E9s diferent de %d
J9VM054=No s'ha pogut crear un subproc\u00E9s\: retVal %1$d, errno %2$d
J9VM053=L'opci\u00F3 mal formada %s s'ha trobat a -Xoptionsfile
J9VM052=\   -Xjni\:arrayCacheMax\=[<x>|unlimited] estableix la grand\u00E0ria m\u00E0xima de la matriu en mem\u00F2ria cau JNI\n
J9VM051=\u00DAs\:\n
J9VM050=-Xjni\: opci\u00F3 no reconeguda --> '%s'
SHRC009=S'ha obert la mem\u00F2ria cau compartida\: %1$s mida\: %2$d bytes
SHRC008=S'ha creat la mem\u00F2ria cau compartida\: %1$s mida\: %2$d bytes
SHRC007=No s'ha pogut eliminar la mem\u00F2ria cache de classe compartida %s
SHRC006=El nombre de mem\u00F2ria cache ha caducat en els \u00FAltims %1$d minuts \u00E9s %2$d
SHRC005=No hi ha cap mem\u00F2ria cache de classe
SHRC004=No es pot destruir la mem\u00F2ria cache %s
SHRC003=\u00FAltima hora de desconnexi\u00F3
SHRC002=en \u00FAs
SHRC001=shmid del sistema operatiu
SHRC000=Mem\u00F2ria cache compartida
J9TI009=Indica el final d'una fase de compilaci\u00F3 JIT. (No hi ha seguretat de crida de retorn)
J9TI008=Indica l'inici d'una fase de compilaci\u00F3 JIT. (No hi ha seguretat de crida de retorn)
J9TI007=Obt\u00E9 el conjunt actual de possibilitats ampliades mitjan\u00E7ant capabilities_ptr.
J9TI006=Retira les possibilitats ampliades de capabilities_ptr.
J9TI005=Afegeix les noves possibilitats de capabilities_ptr.
J9TI004=Torna mitjan\u00E7ant capabilities_ptr les possibilitats disponibles en aquest moment.
J9VM049=No s'admeten temps de retenci\u00F3 de JLM
J9TI003=Falla l'Agent_OnLoad per a la biblioteca %s
J9VM048=S'admeten temps de retenci\u00F3 de JLM
J9TI002=No es troba l'Agent_OnLoad a la biblioteca %s
J9VM047=JLM no adm\u00E8s
J9TI001=No es pot obrir la biblioteca de l'agent %1$s (%2$s)
J9VM046=JLM adm\u00E8s
J9TI000=Sense mem\u00F2ria s'ha intentat carregar un agent de la biblioteca %s
J9VM045=No s'admeten supervisors de sistema de tres nivells
J9VM044=S'admeten supervisors de sistema de tres nivells
J9VM043=-----------------------
J9VM042=Configuraci\u00F3 de fils
J9VM041=nombre incorrecte d'arguments
J9VM040=desbordament de pila de sistema operatiu
CFRE118=bytes addicionals despr\u00E9s d'EOF
CFRE117=el camp no pot ser final i vol\u00E0til
CFRE116=el codi de bytes invoke ha de fer refer\u00E8ncia a una refer\u00E8ncia de m\u00E8tode
CFRE115=dimensions de matriu > 255
CFRE114=el nom de camp no \u00E9s v\u00E0lid
CFRE113=EOF inesperat
CFRE112=la VM no admet la verificaci\u00F3 din\u00E0mica
CFRE111=UTF8 de format incorrecte
CFRE110=constant incompatible per al camp
J9VM039=-Xscmx s'ignora si no s'ha especificat -Xshareclasses
J9VM038=-Xthr\: no es reconeix l'opci\u00F3 --> '%s'
J9VM037=No s'ha pogut assignar el monitor
J9VM036=divideix per zero
J9VM035=No es pot assignar OutOfMemoryError
J9VM034=JVMRI requereix motor de traces\: s'executa amb el senyalador -Xtrace
J9VM033=Error molt greu\: no s'ha pogut inicialitzar %s
J9VM032=Error molt greu\: no es pot carregar %1$s\: %2$s
J9VM031=La classe necess\u00E0ria %2$.*1$s ha d'estar al cam\u00ED d'acc\u00E9s de classes d'engegada, per\u00F2 s'ha trobat al cam\u00ED d'acc\u00E9s de classes de l'aplicaci\u00F3 a %4$.*3$s
J9VM030=UTF8 no v\u00E0lid a la funci\u00F3 JNI
CFRE109=signatura de m\u00E8tode no v\u00E0lid
CFRE108=l'\u00EDndex de m\u00E8todes del m\u00E8tode d'inclusi\u00F3 ha de fer refer\u00E8ncia a un nom i un tipus
CFRE107=difer\u00E8ncia fora de l'interval al codi de bytes jump
CFRE106=m\u00E8tode duplicat
CFRE105=la superclasse ha de ser una classe
CFRE104=el camp pot ser com a m\u00E0xim p\u00FAblic, privat o protegit
CFRE103=el m\u00E8tode abstracte no pot ser privat, est\u00E0tic, final, nadiu, sincronitzat o estricte
CFRE102=signatura de camp no v\u00E0lida
CFRE101=difer\u00E8ncia fora de l'interval al codi de bytes de commutador
CFRE100=massa dimensions sol\u00B7licitades al codi de bytes multianewarray
J9VM029=\ta (m\u00E8tode desconegut)
J9VM028=\ta %2$.*1$s.%4$.*3$s (%6$.*5$s\:%7$u)
J9VM027=\ta %2$.*1$s.%4$.*3$s (%6$.*5$s)
J9VM026=\ta %2$.*1$s.%4$.*3$s (origen desconegut)
J9VM025=\ta %2$.*1$s.%4$.*3$s (m\u00E8tode nadiu)
J9VM024=Excepci\u00F3 al fil "%.*s"
J9VM023=Aix\u00F2 pot indicar que JAVA_HOME \u00E9s incorrecte, o que les biblioteques de classe no s'han instal\u00B7lat
J9VM022=Ha fallat el mapatge de pila, resultat \= %p - s'avorta la VM
J9VM021=Sense mem\u00F2ria per la correlaci\u00F3 de piles d'int\u00E8rpret - avortant la VM
J9VM020=Cercat a %.*s
J2JX110=El fitxer JAR %s ja s'ha convertit
J9VM019=Error molt greu\: no es pot trobar ni inicialitzar la classe necess\u00E0ria %.*s
J9VM018=No s'ha pogut assignar mem\u00F2ria a l'agrupaci\u00F3 de taules carregades de la biblioteca compartida
J9VM017=No s'ha pogut assignar mem\u00F2ria per a la matriu d'opci\u00F3 de l\u00EDnia d'ordres
J9VM016=Error d'aturada a la biblioteca %1$s(%2$d)\: %3$s
J9VM015=Error d'inicialitzaci\u00F3 a la biblioteca %1$s(%2$d)\: %3$s
J9VM014=Error d'aturada a la funci\u00F3 %1$s(%2$d)\: %3$s
J9VM013=Error d'inicialitzaci\u00F3 a la funci\u00F3 %1$s(%2$d)\: %3$s
J9VM012=No es pot descarregar %1$s\: %2$s
J2JX109=\  -E xxx\=yyy                estableix la propietat del sistema xxx en el valor de la variable d'entorn yyy en temps d'execuci\u00F3
J9VM011=No es pot carregar %1$s\: %2$s
J2JX108=\  -g[\:lines,source,vars]    genera un subconjunt (l\u00EDnies, origen i/o variables) d'informaci\u00F3 de depuraci\u00F3 dins de JXE
J9VM010=No s'ha pogut inicialitzar %s
J2JX107=\  -g\:nosym                  incrusta informaci\u00F3 de depuraci\u00F3 dins de JXE
J2JX106=\  -g\:sym                    genera un fitxer .sym per a la depuraci\u00F3, no inclou informaci\u00F3 de depuraci\u00F3 dins de JXE
J2JX105=\  -nog                      no genera informaci\u00F3 de depuraci\u00F3 per a JXE
J2JX104=\  -g                        igual que -g\:sym
J2JX103=No s'ha pogut compilar el m\u00E8tode\: %2$.*1$s/%4$.*3$s%6$.*5$s jitErr 0%7$x
J2JX102=No s'ha pogut compilar el m\u00E8tode nadiu\: %2$.*1$s/%4$.*3$s%6$.*5$s
J2JX101=No s'ha pogut compilar el m\u00E8tode abstracte\: %2$.*1$s/%4$.*3$s%6$.*5$s
J2JX100=%s no s'admet en aquesta configuraci\u00F3
J9VM009=Ha fallat J9VMDllMain
J9VM008=No es troba J9VMDllMain
J9VM007=No es reconeix l'opci\u00F3 de l\u00E7inia d'ordres\: %s
J9VM006=Opci\u00F3 no v\u00E0lida per a l'opci\u00F3 de l\u00EDnia d'ordres\: %s
J9VM005=Valor no v\u00E0lid per a la variable d'entorn\: %s
J9VM004=No s'ha pogut carregar la biblioteca que requeria\: %s
J9VM003=No s'ha trobat el compilador JIT "%s". S'utilitzar\u00E0 l'interpretador.
J9VM002=No s'ha trobat el fitxer d'opcions
J9VM001=Valor malformat per a -Xservice
J9VM000=Valor mal format per a IBM_JAVA_OPTIONS
EXEL091=\n  -Xcheck[\:option[\:...]]  comprovaci\u00F3 de control, utilitzeu -Xcheck\:help per obtenir m\u00E9s informaci\u00F3
EXEL090=\  -Xscmaxaot<x>   estableix l'espai de mem\u00F2ria cau m\u00E0xim de classe compartida perm\u00E8s per a dades AOT en <x>
EXEL089=\  -Xscminaot<x>   estableix l'espai de mem\u00F2ria cau m\u00EDnima de classe compartida reservat per a dades AOT en <x>
EXEL088=
EXEL087=\  -Xjni\:<options>               set JNI options
EXEL086=\n   -Xtrace[\:option,...]  tra\u00E7a de control, utilitzeu -Xtrace\:help per obtenir m\u00E9s informaci\u00F3
EXEL085=\nAV\u00CDS\: S'ha desaprovat l'argument de la l\u00EDnia d'ordres "%s".\nAV\u00CDS\: Utilitzeu "-jxe <path>".\n
EXEL084=No es pot fer una c\u00F2pia de seguretat del fitxer\: %s
EXEL083=No s'ha pogut obrir el fitxer\: %s
EXEL082=\  -Xlp<x>    estableix la mida de p\u00E0gina gran en<x>
EXEL081=java versi\u00F3 "%1$s/%2$s"
EXEL080=java versi\u00F3 "%s"
EXEL079=\  -Xscmx<x>       estableix la mida de la nova mem\u00F2ria cach\u00E9 de la classe compartida en <x>
EXEL078=\  -Xshareclasses[\:opcions] permet compartir dades de classe (utilitzar l'ajuda per veure detalls)\n
EXEL077=\  -Xssi<x>        estableix l'increment de pila de fils java en <x>
EXEL076=JIT  - %s\n
EXEL075=\  -Xquickstart    millora el temps d'engegada gr\u00E0cies a les optimitzacions de retards
EXEL074=No es pot readre\u00E7ar la consola d'E/S a\: %1$s\:%2$d
EXEL073=Error intern de VM\: no s'ha pogut crear la VM de Java
EXEL072=Error d'engegada de VM\: sense mem\u00F2ria
EXEL071=No s'ha pogut trobar el nom de classe principal
EXEL070=La imatge ROM \u00E9s una d'una versi\u00F3 err\u00F2nia
EXEL069=No s'ha pogut trobar la imatge ROM
EXEL068=Error intern de VM\: no s'ha pogut establir l'element de la matriu per %s
EXEL067=Error intern de VM\: no s'ha pogut crear java/lang/String per l'argument %s
EXEL066=Error intern de VM\: no s'ha pogut crear la matriu d'octets per l'argument %s
EXEL065=Error intern de VM\: no s'ha pogut crear la matriu d'arguments
EXEL064=El m\u00E8tode main s'ha de declarar p\u00FAblic, est\u00E0tic i nul.
EXEL063=La classe %s no implementa main()
EXEL062=Error VM intern\: sense mem\u00F2ria per convertir s\u00E8ries a car\u00E0cters UTF per a nom de classe %s
EXEL061=Error intern de VM\: no s'ha pogut crear java/lang/String pel nom de classe %s
EXEL060=Error intern de VM\: no s'ha pogut crear la matrius d'octets pel nom de classe %s
JVMP000=S'ha intentat instrumentalitzar %.*s a trav\u00E9s de JVMPI i no estava autoritzat.
SHRC199=\ S'ha emmagatzemat correctament %2$.*1$s.
SHRC198=S'est\u00E0 emmagatzemant el codi d'AOT per a ROMMethod 0x%1$p a la mem\u00F2ria cau compartida...
SHRC197=S'est\u00E0 cercant el codi d'AOT per a ROMMethod 0x%1$p a la mem\u00F2ria cau compartida...
SHRC196=[-Xshareclasses sortida detallada habilitada d'AOT]
SHRC195=Habilitar sortida verbal d'AOT
SHRC194=\tper a ROMClass %2$.*1$s a 0x%3$p.
SHRC193=%1$d\: 0x%2$p AOT\: %4$.*3$s
SHRC192=El valor de -Xscmaxaot \u00E9s m\u00E9s gran que el valor de -Xscmx, de manera que s'ha establert en il\u00B7limitat
SHRC191=El valor de -Xscminaot \u00E9s m\u00E9s gran que el valor de -Xscmx, de manera que s'ha establert en un valor igual a -Xscmx
EXEL059=Error intern de VM\: no s'ha pogut trobar la classe java/lang/String
SHRC190=El valor de -Xscminaot no ha de ser m\u00E9s gran que el valor de -Xscmaxaot
EXEL058=Error intern de VM\: sense mem\u00F2ria
EXEL057=
EXEL056=IBM \u00E9s una marca registrada d'IBM Corp.\nJava i totes les marques i logotips basats en Java s\u00F3n marques registrades\n o comercials de Sun Microsystems, Inc.\n
EXEL055=Destinaci\u00F3\: %s
EXEL054=(c) Copyright IBM Corp. 1991, %s  Reservats tots els drets
EXEL053=Materials sota llic\u00E8ncia - Propietat d'IBM\n\nJ9 - VM per la plataforma Java(TM), Versi\u00F3 %s
EXEL052=\nAV\u00CDS\: S'ha desaprovat l'argument de la l\u00EDnia d'ordres "%s".\nAV\u00CDS\: Utilitzeu l'equivalent de -X.
EXEL051=\nAV\u00CDS\: S'ha desaprovat l'argument de la l\u00EDnia d'ordres "%s".\nAV\u00CDS\: \u00DAs de "-classpath <via>" o "-cp <via>".
EXEL050=\  -Xrdbginfo\:<host>\:<port>      habilita el servidor d'informaci\u00F3 de depuracions remot
SHRC189=N\u00FAm. de m\u00E8todes d'AOT   \= %d
SHRC188=Bytes d'AOT        \= %d
SHRC187=Inhabilita l'emmagatzemament de dades d'AOT a la mem\u00F2ria cau compartida
SHRC186=\tPartici\u00F3 %.*s a ModContext %.*s
SHRC185=\tModContext %.*s
SHRC184=\tPartici\u00F3 %.*s
SHRC183=No es pot crear la taula d'aleatoritzaci\u00F3 a ScopeManagerImpl
SHRC182=No es pot crear el supervisor a ScopeManagerImpl
SHRC181=No es pot escriure el mutex de la taula d'aleatoritzaci\u00F3 ScopeManagerImpl
EXEL049=
SHRC180=No es pot assignar mem\u00F2ria per a l'entrada de la taula d'aleatoritzaci\u00F3 a ScopeManagerImpl
EXEL048=\  -Xrunjdwp\:<options>           habilita la depuraci\u00F3, les opcions est\u00E0ndard de JDWP
EXEL047=\n  -Xdbg\:<options>               habilita la depuraci\u00F3, les opcions est\u00E0ndard de JDWP
EXEL046=\  -Xlp                          habilita el suport de p\u00E0gines grans
EXEL045=\  -Xnocompactgc                 inhabilita la compactaci\u00F3
EXEL044=\  -Xcompactgc                   habilita la compactaci\u00F3
EXEL043=\  -Xcompactexplicitgc           habilita la compactaci\u00F3 a tots els sistemes GC
EXEL042=\  -Xnocompactexplicitgc         inhabilita la compactaci\u00F3 a un sistema GC
EXEL041=\  -Xalwaysclassgc               habilita la desc\u00E0rrega de classes din\u00E0miques a cada GC
EXEL040=\  -Xclassgc                     habilita la desc\u00E0rrega de classes din\u00E0miques
SHRC179=El segment ROMClass est\u00E0 malm\u00E8s. Error en llegir ROMClass a 0x%p
SHRC178=
SHRC177=
SHRC176=
SHRC175=
SHRC174=
SHRC173=Establiu el directori dels fitxers de control JVM (opcions avan\u00E7ades)
SHRC172=No s'ha pogut crear mem\u00F2ria cau de la grand\u00E0ria sol\u00B7licitada degut a restriccions del sistema operatiu
SHRC171=El z/OS no pot crear la mem\u00F2ria cau de la mida sol\u00B7licitada\: comproveu els par\u00E0metres BPXPRMxx del sistema z/OS
EXEL039=\  -Xnoclassgc                   inhabilita la desc\u00E0rrega de classes din\u00E0miques
SHRC170=Especifiqueu el nom de la mem\u00F2ria cau compartida\n \t(Utilitzeu %%u per substituir el nom d'usuari)
EXEL038=\  -Xgcthreads<x>                estableix un nombre de fils GC
EXEL037=\nEls arguments de les seg\u00FCents opcions s'expressen en nombres decimals\n
EXEL036=\  -Xmaxf<x>       percentatge m\u00E0xim de l'\u00E0rea d'emmagatzematge lliura despr\u00E9s de GC
EXEL035=\  -Xminf<x>       percentatge m\u00EDnim de l'\u00E0rea d'emmagatzematge lliura despr\u00E9s de GC
ZIPS001=No es pot obrir %s (falta l'exportaci\u00F3)
EXEL034=Un valor de 0,3 representa una sol\u00B7licitud del 30%%.\n
ZIPS000=No es pot obrir %1$s (%2$s)
EXEL033=\nEls arguments de les seg\u00FCents opcions s'expressen com a decimals del 0 a l'1.
EXEL032=\  -Xmaxe<x>       estableix la grand\u00E0ria m\u00E0xima per l'expansi\u00F3 de l'\u00E0rea d'emmagatzematge a <x>
EXEL031=\  -Xmine<x>       estableix la grand\u00E0ria m\u00EDnima per l'expansi\u00F3 de l'\u00E0rea d'emmagatzematge a <x>
EXEL030=\  -Xss<x>         estableix la grand\u00E0ria de la pila de fils en <x>
SHRC169=Canvi detectat a %2$.*1$s...\n\t...S'han detectat %3$d classes en mem\u00F2ria cau estancades
SHRC168=Bytes totals de classe compartida llegits\=%1$lld. Bytes totals emmagatzemats\=%2$d
SHRC167=Inhabilita l'\u00FAs compartit de classes
SHRC166=Connectat a la mem\u00F2ria cau "%1$s", mida\=%2$d bytes
SHRC165=[-Xshareclasses sortida detallada d'API d'ajuda habilitada]
SHRC164=[-Xshareclasses sortida d'E/S detallada habilitada]
SHRC163=[-Xshareclasses sortida detallada habilitada]
J9RI023=
SHRC162=L'espera del mutex de creaci\u00F3 en obrir la mem\u00F2ria compartida el sem\u00E0for ha superat el temps m\u00E0xim
J9RI022=la inicialitzaci\u00F3 de JVMRI no pot assignar el supervisor de buidatge jvmri
SHRC161=L'espera del mutex de creaci\u00F3 en crear la mem\u00F2ria compartida el sem\u00E0for ha superat el temps m\u00E0xim
EXEL029=\  -Xss<x>         estableix la grand\u00E0ria m\u00E0xima de la pila de fils java en <x>
J9RI021=jvmri->RunDumpRoutine no est\u00E0 suportat.
SHRC160=L'espera del mutex de creaci\u00F3 en obrir el sem\u00E0for ha superat el temps m\u00E0xim
EXEL028=\  -Xiss<x>        estableix la grand\u00E0ria de la pila de fils java inicials en <x>
J9RI020=jvmri->CreateThread no pot assignar el supervisor privat
EXEL027=\  -Xmso<x>        estableix la grand\u00E0ria de la pila de fils del sistema operatiu en <x>
EXEL026=\  -Xmrx<x>        estableix la grand\u00E0ria m\u00E0xima del conjunt recordat en <x>
EXEL025=\  -Xmr<x>         estableix la grand\u00E0ria del conjunt recordat en <x>
EXEL024=\  -Xmx<x>         estableix el m\u00E0xim de mem\u00F2ria en <x>
EXEL023=\  -Xms<x>         estableix la grand\u00E0ria de la mem\u00F2ria inicial en <x>
EXEL022=\  -Xms<x>         estableix la grand\u00E0ria de l'antic espai en <x>
EXEL021=\  -Xmoi<x>        estableix l'increment de l'antic espai en <x>
EXEL020=\  -Xmox<x>        estableix la grand\u00E0ria de l'antic espai m\u00E0xim en <x>
SHRC159=S'ha obert la mem\u00F2ria cau de classe compartida "%1$s"
J9RI019=jvmri->InjectOutOfMemory no est\u00E0 suportat.
SHRC158=S'ha creat la mem\u00F2ria cau de classe compartida "%1$s"
J9RI018=jvmri->NotifySignal que activa la senyal %d.
SHRC157=No es poden assignar %1$d bytes de mem\u00F2ria compartida sol\u00B7licitats\n\tS'ha assignat correctament la mem\u00F2ria compartida m\u00E0xima (%2$d bytes) \n\t(Per augmentar la mem\u00F2ria compartida disponible, modifiqueu el valor SHMMAX del sistema)
J9RI017=No s'ha pogut assignar l'agent de buidatge a jvmri->SetOutOfMemoryHook, func no registrada.
SHRC156=Error en copiar el nom de grup al nom de la mem\u00F2ria cau
J9RI016=S'ha cridat a jvmri->SetOutOfMemoryHook amb una crida de retorn nul\u00B7la, func no registrada.
SHRC155=Error en copiar el nom d'usuari al nom de la mem\u00F2ria cau
J9RI015=jvmri->RunDumpRoutine\: el componentId es troba fora del l\u00EDmits.
SHRC154=El car\u00E0cter d'escapament %.*s no \u00E9s v\u00E0lid per al nom de mem\u00F2ria cau
J9RI014=jvmri->RunDumpRoutine\: no es pot recuperar les dades del component.
SHRC153=Especifiqueu el nom de la mem\u00F2ria cau compartida\n \t(Utilitzeu %%g per substituir el nom de grup i %%u per al nom d'usuari)
J9RI013=jvmri->ReleaseRasInfo\: l'estructura t\u00E9 un camp de tipus no suportat.
SHRC152=Inicia sempre JVM independentment d'errors/avisos
J9RI012=S'ha cridat a jvmri->ReleaseRasInfo amb una estructura RasInfo nul\u00B7la.
SHRC151=Suprimieix tots els missatges
EXEL019=\  -Xmos<x>        estableix la grand\u00E0ria de l'antic espai inicial en <x>
J9RI011=L'estructura RasInfo t\u00E9 un camp de tipus no suportat.
SHRC150=Habilita sortida detallada d'API d'ajuda
EXEL018=\  -Xmo<x>         estableix la grand\u00E0ria de l'antic espai inicial/m\u00E0xim en <x>
J9RI010=jvmri->GetRasInfo no pot assignar mem\u00F2ria.
EXEL017=\  -Xmo<x>         estableix la grand\u00E0ria de l'antic espai en <x>
EXEL016=\  -Xmnx<x>        estableix la grand\u00E0ria del nou espai m\u00E0xim en <x>
EXEL015=\  -Xmns<x>        estableix la grand\u00E0ria del nou espai inicial en <x>
EXEL014=\  -Xmn<x>         estableix la grand\u00E0ria del nou espai inicial/m\u00E0xim en <x>
EXEL013=\  -Xmn<x>         estableix la grand\u00E0ria del nou espai en <x>
EXEL012=\  -Xmco<x>        estableix l'increment del segment de la classe ROM en <x>
EXEL011=\  -Xmca<x>        estableix l'increment del segment de la classe RAM en <x>
EXEL010=Els valors amb els sufixos "k" (kilo) o "m" (mega) es multiplicaran en conseq\u00FC\u00E8ncia.\n
SHRC149=Habilita sortida detallada de cerca/emmagatzemament
J9RI009=jvmri->GetRasInfo no pot assignar mem\u00F2ria.
SHRC148=Permetre l'acc\u00E9s del grup a la mem\u00F2ria cache (a l'usuari \u00E9s per defecte)
J9RI008=jvmri->GetRasInfo no pot obtenir components.
SHRC147=El car\u00E0cter %.*s no \u00E9s v\u00E0lid pel nom de la mem\u00F2ria cache
J9RI007=jvmri->GetRasInfo no pot assignar mem\u00F2ria.
SHRC146=Cercant la classe %1$s a la mem\u00F2ria cache compartida per l'ID de cldr %2$d amb la senyal %4$.*3$s...
J9RI006=S'ha cridat a jvmri->GetRasInfo amb una estructura RasInfo nul\u00B7la.
SHRC145=Cercant la classe %1$s a la mem\u00F2ria cache compartida per l'ID de cldr %2$d amb la URL %4$.*3$s...
J9RI005=El component %s de jvmri->GetComponentDataArea no t\u00E9 cap dataArea a sota d'aquesta vm.
SHRC144=Emmagatzemant la classe %2$.*1$s a la mem\u00F2ria cache compartida per l'ID de cldr %3$d amb la senyal %5$.*4$s...
J9RI004=jvmri->DynamicVerbosegc no suportat.
SHRC143=Emmagatzemant la classe %2$.*1$s a la mem\u00F2ria cache compartida per l'ID de cldr %3$d amb la URL %5$.*4$s...
J9RI003=No s'ha pogut assignar l'agent de buidatge a jvmri->DumpRegister, func no registrada.
SHRC142=\ta 0x%1$p\t\t%2$x \!\= %3$x
J9RI002=S'ha cridat a jvmri->DumpRegister amb una crida de retorn nul\u00B7la, func no registrada.
SHRC141=octets no coincidents\:
EXEL009=\nEls arguments de les seg\u00FCents opcions s'expressen en octets.
J9RI001=Error intern en eliminar l'agent de buidatge a jvmri->DumpDeregister, func podria no registrar-se.
SHRC140=grand\u00E0ria\:\t%1$d\t\t\t%2$d\n
EXEL008=\  -Xfuture        habilita les comprovacions m\u00E9s estrictes, que anticipen futurs valors per defecte
J9RI000=jvmri->CreateThread no pot assignar mem\u00F2ria d'args de fils
EXEL007=\  -Xnoaot         no executa el codi compilat pr\u00E8viament
EXEL006=\  -Xnojit         inhabilita JIT
EXEL005=\  -Xint           executa nom\u00E9s all\u00F2 interpretat (equivalent a -Xnojit -Xnoaot)
EXEL004=\n  -Xrun<library>[\:options]  carregar biblioteca d'agent nadiua\n                            (obsolet en favor de -agentlib)\n
EXEL003=\  -Xbootclasspath/a\:<via>  afegir <via> a la classpath d'enceb
EXEL002=\  -Xbootclasspath/p\:<via>  deduir <via> per la classpath d'enceb
EXEL001=\  -Xbootclasspath\:<via>    estableix la classpath d'enceb en <via>
EXEL000=Les seg\u00FCents opcions s\u00F3n no est\u00E0ndard i estan subjectes a canvis sense avisos previs.\n
JDBG021=no es reconeix l'opci\u00F3 de depuraci\u00F3
JDBG020=no es reconeix l'opci\u00F3 de depuraci\u00F3\: '%s'
SHRC139=\n\tROMClass s'est\u00E0 emmagatzemant\tROMClass a la mem\u00F2ria cache
SHRC138=S'ha trobat m\u00E9s d'una ROMClass orfe per %.*s
SHRC137=MODALITAT SEGURA\: Av\u00EDs\: ROMClass %.*s no coincideix amb ROMClass a la mem\u00F2ria cache
SHRC136=No es pot crear el supervisor a SH_ROMClassManagerImpl
SHRC135=No s'ha pogut crear la taula d'aleatoritzaci\u00F3 a SH_ROMClassManagerImpl
SHRC134=No s'ha pogut crear l'agrupaci\u00F3 a SH_ROMClassManagerImpl
SHRC133=No es pot escriure el mutex de la taula d'aleatoritzaci\u00F3 de ROMClassManager
SHRC132=No es pot assignar mem\u00F2ria per a l'entrada de la taula d'aleatoritzaci\u00F3 a ROMClassManagerImpl
SHRC131=No es pot assignar mem\u00F2ria per a l'element de la llista vinculada a ROMClassManagerImpl
SHRC130=S'ha intentat assignar mentre el comprom\u00EDs encara est\u00E0 pendent
JDBG019=llista de reubicaci\u00F3 no ordenada %zx
JDBG018=ignorant l'opci\u00F3 de depuraci\u00F3 no reconeguda
JDBG017=
JDBG016=Error en adjuntar la JVM
JDBG015=Depurar el servidor de respostes
JDBG014=no es pot assignar l'agrupaci\u00F3 vm->debuggerClassReferences
JDBG013=no es pot assignar l'agrupaci\u00F3 vm->debuggerReferences
JDBG012=ha fallat j9dbg_init_server
JDBG011=no es pot assignar debugServer
JDBG010=Exemple\: java -Xrunjdwp\:transport\=dt_socket,address\=localhost\:8000\n
SHRC129=S'ha intentat establir readerCount en -1\!
SHRC128=SH_CompositeCache\:\:exitMutex ha donat un error amb codi de retorn %d
SHRC127=SH_CompositeCache\:\:enterMutex ha donat un error amb codi de retorn %d
SHRC126=S'ha realitzat una sol\u00B7licitud per afegir massa elements a ClasspathItem
SHRC125=No s'ha pogut assignar mem\u00F2ria per a la mem\u00F2ria interm\u00E8dia de s\u00E8ries a SH_CacheMap
SHRC124=La mem\u00F2ria cache est\u00E0 %1$d%% plena\n
SHRC123=%% Classes desfasades  \= %1$d%%\n
SHRC122=\# Classes desfasades  \= %d
SHRC121=\# Senyals         \= %d
SHRC120=\# URL           \= %d
JDBG009=j9methodids\=y|n                 usar els ID del m\u00E8tode j9                n\n
JDBG008=onuncaught\=y|n                  depuraci\u00F3 no captada?          n
JDBG007=onthrow\=<nom excepci\u00F3>        depuraci\u00F3 generada                  none
JDBG006=server\=y|n                      escolta pel depurador?            n
JDBG005=address\=<adre\u00E7a d'escolta/connexi\u00F3> transport espec.                  "localhost\:8888"
JDBG004=transport\=<nom>                 espec. de transport               none
JDBG003=suspend\=y|n                     espera l'engegada?                s
JDBG002=---------------------           -----------                     ------------
JDBG001=Nom i valor d'opci\u00F3             Descripci\u00F3                      Per defecte
JDBG000=-Xrunjdwp \u00FAs\: -Xrunjdwp\:[help]|[<option>\=<valor>, ...]\n
SHRC119=\# Classpaths     \= %d
SHRC118=\# ROMClasses     \= %d
SHRC117=Metadades %% utilitzades  \= %1$d%%\n
SHRC116=Octets de metadades   \= %d
SHRC115=Octets de ROMClass   \= %d
SHRC114=octets lliures       \= %d
SHRC113=grand\u00E0ria de mem\u00F2ria cache       \= %d
SHRC112=allocPtr                   \= 0x%p\n
SHRC111=endAddress                 \= 0x%p
SHRC110=\nbaseAddress                \= 0x%p
EXEX026=\  -jxe <fitxer_jxe>   col\u00B7loca el fitxer_jxe a la classpath i executa la classe\n                    d'inici que es troba a fitxer_jxe.
EXEX025=\u00DAs\:\t%s [-jxe] [opcions] <fitxer_jxe> [arguments...]
EXEX024=El JXE %s no contenia una classe d'inici.
EXEX023=No es poden inicialitzar utilitats JXE.
EXEX022=
EXEX021=
EXEX020=
SHRC109=DESFASAT\!
VERB026=Entrada de CP no v\u00E0lida\: %s (jxe endian oposat no adm\u00E8s)
SHRC108=\t%.*s
VERB025=Entrada de CP no v\u00E0lida\: %s (cap\u00E7alera d'imatge malmesa de jxe)
SHRC107=\t%.*s
VERB024=Entrada de CP no v\u00E0lida\: %s (falten rom.classes a jxe)
SHRC106=%1$d\: 0x%2$p SENYAL
VERB023=Entrada de CP no v\u00E0lida\: %s (error desconegut)
SHRC105=%1$d\: 0x%2$p URL
VERB022=Entrada de CP no v\u00E0lida\: %s (tipus de fitxer desconegut)
SHRC104=%1$d\: 0x%2$p CLASSPATH
VERB021=Entrada de CP no v\u00E0lida\: %s (tipus de fitxer no adm\u00E8s)
SHRC103=\tSenyal 0x%p
VERB020=Entrada de CP no v\u00E0lida\: %s (fitxer malm\u00E8s)
SHRC102=\tURL 0x%p
SHRC101=\t\u00CDndex %1$d a la classpath 0x%2$p
SHRC100=%1$d\: 0x%2$p ROMCLASS\: %4$.*3$s a 0x%5$p.
CDRT002=PC amb errors\: %1$p (despla\u00E7ament %2$p), metaData \= %3$p
CDRT001=M\u00E8tode\: %2$.*1$s.%4$.*3$s%6$.*5$s (%7$p)
CDRT000=No es pot localitzar la correlaci\u00F3 de pila JIT - avortant VM
EXEX019=
EXEX018=
EXEX017=Error en correlacionar jxe a flash
EXEX016=Par\u00E0metres jxespace no v\u00E0lids.
EXEX015=Error d'engegada de VM\: sense mem\u00F2ria
EXEX014=Executar %s -help pel seu \u00FAs
EXEX013=Error intern de VM\: no s'ha pogut crear la VM de Java
EXEX012=L'opci\u00F3 -jar no est\u00E0 disponible per aquesta biblioteca de classes
EXEX011=
EXEX010=%s requereix un par\u00E0metre
PORT019=No es pot el directori %s. Les classes compartides s'inhabilitaran fins que es cre\u00EF aquest directori.
PORT018=L'operaci\u00F3 ha fallat\: %1$d (%2$s ha fallat\: %3$d)
PORT017=L'operaci\u00F3 ha fallat\: %d
VERB019=Entrada de CP no v\u00E0lida\: %s (error de lectura de fitxer)
PORT016=Error intern %i
VERB018=Entrada de CP no v\u00E0lida\: %s (error d'E/S de fitxer)
PORT015=No s'han pogut resoldre les refer\u00E8ncies a la biblioteca compartida\: deu faltar un prerequisit de la biblioteca compartida.
VERB017=espai de mem\u00F2ria cau SC m\u00E0xim perm\u00E8s per a AOT
PORT014=No s'ha trobat la biblioteca compartida.
VERB016=espai de mem\u00F2ria cau SC reservat per a AOT
PORT013=No s'ha trobat la taula de la biblioteca.
VERB015=mida de la mem\u00F2ria cau de classe compartida
PORT012=Error\: la funci\u00F3 68K t\u00E9 un conjunt de bits PACE.
VERB014=M\u00E0xim de mem\u00F2ria
PORT011=Sense mem\u00F2ria
VERB013=Increment del segment de la classe ROM
PORT010=Perm\u00EDs denegat
VERB012=Increment del segment de la classe RAM
VERB011=Grand\u00E0ria de la pila de fils java
VERB010=Grand\u00E0ria m\u00E0xima de la pila de fils java
EXEX009=\  -verify          habilita la verificaci\u00F3 de classes.\n  -X               imprimeix l'ajuda d'opcions no est\u00E0ndard.
EXEX008=\  -verbose[\:class,gc,stack,sizes]\n                   habilita una sortida verbosa (per defecte\=classe).\n
EXEX007=\  -jcl\:<config>[\:opcions]\n                   especifica quina biblioteca compartida JCL cal utilitzar (per ex. cdc, cldc, ...).\n
EXEX006=\  -debug\:<opcions> habilita la depuraci\u00F3, l'est\u00E0ndard <opcions>.\n
EXEX005=\  -D<prop>\=<val>   estableix el valor d'una propietat del sistema.\n
EXEX004=\  -jxespace\:<Adre\u00E7af\u00EDsica>,<grand\u00E0ria>,<Adre\u00E7al\u00F2gica>\n                   correlaciona la regi\u00F3 de la mem\u00F2ria per jxes, (els valors estan en valor hexadecimal).\n  -jxeaddr\:<Adre\u00E7al\u00F2gica>\n                   executa jxe directament des de la mem\u00F2ria, (les adreces estan en valor hexadecimal).
EXEX003=\  -jxe\:<Fitxerjxe>   executa el fitxer anomenat jxe.
EXEX002=\n[opcions]\n  -classpath <via d'acc\u00E9s>\n  -cp <via d'acc\u00E9s>       estableix la classpath a <via d'acc\u00E9s>.
EXEX001=\u00DAs\:\t%s [opcions] -jxe\:<fitxer_jxe> [args...]
EXEX000=\u00DAs\:\t%s [opcions] nom_classe [args...]
PORT009=No s'ha trobat el fitxer
PORT008=Arquitectura del m\u00F2dul incorrecta
PORT007=No \u00E9s un m\u00F2dul
VERB009=Increment de la pila de fils java
PORT006=Format de m\u00F2dul incorrecte
VERB008=grand\u00E0ria inicial de la pila de fils java
PORT005=No s'ha pogut carregar el m\u00F2dul
VERB007=Grand\u00E0ria de la pila del fil del sistema operatiu
PORT004=Error en la resoluci\u00F3 del s\u00EDmbol
VERB006=No s'ha pogut inicialitzar
PORT003=No s'ha pogut carregar el m\u00F2dul dependent %s
VERB005=Error\: falta el nom de fitxer -Xverbosegclog
PORT002=S'ha produ\u00EFt un error desconegut en carregar la biblioteca compartida.
VERB004=Error\: el nombre -Xverbosegclog de cicles ha de ser superior a 0
PORT001=No s'ha pogut assignar mem\u00F2ria.
VERB003=Error\: el nombre de fitxers -Xverbosegclog ha de ser superior a 0
PORT000=
VERB002=Pila verbal\: l'\u00FAs de la pila m\u00E0xima va ser de %1$zd/%2$zd bytes a piles Java/C
VERB001=
VERB000=Pila detallada\: "%2$.*1$s" utilitzava %3$zd/%4$zd bytes a piles Java/C
MECK002=S'ha produ\u00EFt un error en crear l'estructura de dades del lloc de crida. No se'n mostrar\u00E0 la informaci\u00F3.
MECK001=No es reconeix l'opci\u00F3 -Xcheck\:memory\: %s
MECK000=S'ha produ\u00EFt un error en iniciar la utilitat -Xcheck\:memory.
CFRE099=modificadors de m\u00E8tode no permesos
CFRE098=la signatura de variable local ha de ser una s\u00E8rie
CFRE097=entrada de classe inner duplicada a l'atribut de classe InnerClasses
CFRE096=la destinaci\u00F3 no \u00E9s una instrucci\u00F3 en un codi de bytes de commutador
CFRE095=les anotacions han de ser interf\u00EDcies
CFRE094=el codi de bytes instanceof ha de fer refer\u00E8ncia a una classe
CFRE093=el m\u00E8tode pot ser com a m\u00E0xim p\u00FAblic, privat o protegit
CFRE092=signatura no v\u00E0lida
CFRE091=el PC d'inici del manejador d'excepcions no \u00E9s una instrucci\u00F3
CFRE090=el nou codi de bytes no pot crear matrius
CFRE089=s'espera un nom i un tipus
CFRE088=el nom de variable local ha de ser una s\u00E8rie
CFRE087=el codi de bytes del m\u00E8tode d'interf\u00EDcie ha de fer refer\u00E8ncia a una refer\u00E8ncia de m\u00E8tode d'interf\u00EDcie
CFRE086=el m\u00E8tode t\u00E9 dos atributs de codi
CFRE085=inner name ha de ser una s\u00E8rie
CFRE084=sense error
CFRE083=la classe \u00E9s abstracta i final
CFRE082=el m\u00E8tode <init> no pot ser est\u00E0tic, final, sincronitzat, nadiu ni abstracte
CFRE081=el fitxer d'origen ha de ser UTF8
CFRE080=signatura de m\u00E8tode no v\u00E0lida
J2JX099=Opci\u00F3 o opcions no completes la l\u00EDnia d'ordre. La primera era\: %s
J2JX098=Argument no v\u00E0lid [%1$s] per a la opci\u00F3\: %2$s
DUMP024=La preparaci\u00F3 de pila sol\u00B7licitada no s'ha produ\u00EFt ja que no s'ha sol\u00B7licitat l'acc\u00E9s exclusiu o no s'ha pogut obtenir.
J2JX097=Opci\u00F3 o opcions no reconegudes a la l\u00EDnia d'ordre. La primera era\: %s
DUMP023=La compactaci\u00F3 de pila sol\u00B7licitada no s'ha produ\u00EFt ja que no s'ha sol\u00B7licitat l'acc\u00E9s exclusiu o no s'ha pogut obtenir.
J2JX096=No s'ha pogut trobar la funci\u00F3 j9bcv_verifyCreateStackAttributes
DUMP022=El buidatge de pila sol\u00B7licitat no s'ha produ\u00EFt ja que no s'ha sol\u00B7licitat l'acc\u00E9s exclusiu o no s'ha pogut obtenir.
J2JX095=No s'ha pogut trobar la funci\u00F3 j9bcv_verifyClassStructure
DUMP021=S'han sol\u00B7licitat diversos buidatges de pila, per\u00F2 falta %%id de l'etiqueta de fitxer\: els buidatges es sobreescriuran
J2JX094=No s'ha pogut verificar la DLL %1$s\: %2$s
DUMP020=El buidatge %s s'ha enregistrat
J2JX093=No s'han especificat fitxers de classe a la l\u00EDnia d'ordres
J2JX092=Error intern amb la VM acabada de crear
J2JX091=S'ha creat correctament la Java VM
J2JX090=S'ha intentat crear una Java VM per usar amb AOT
CFRE079=PC de manejador d'excepcions no v\u00E0lid
CFRE078=l'\u00EDndex de classe de m\u00E8tode d'inclusi\u00F3 ha de fer refer\u00E8ncia a una classe
CFRE077=les interf\u00EDcies han de ser abstractes
CFRE076=n\u00FAmero m\u00E0gic incorrecte
CFRE075=signatura de variable local no v\u00E0lida
CFRE074=no s'ha especificat cap atribut de codi
CFRE073=atribut de mapatge de pila/mapatge de pila detectat fora de l'atribut de codi
CFRE072=entrades no ordenades al codi de bytes lookupswitch
CFRE071=matriu de codis de bytes buida
CFRE070=PC de n\u00FAmero de l\u00EDnia no v\u00E0lid
DUMP019=JVM que sol\u00B7licita buidatge %s
DUMP018=L'esdeveniment sol\u00B7licitat no est\u00E0 disponible\: executeu-lo amb l'indicador -Xdump\:dynamic
DUMP017=Avortant\: No es pot comprimir el fitxer (%s)
DUMP016=Avortant\: No es pot crear el fitxer (%s)
J2JX089=Error intern\: no es pot trobar %1$s a %2$s
DUMP015=Avortant\: No es pot obrir o llegir (%s)
J2JX088=Error intern\: no es pot obrir %1$s\: %2$s
DUMP014=No es reconeix l'acci\u00F3 VM\: ...%s
J2JX087=Error intern\: no s'ha pogut determinar el nom d'executable
DUMP013=Esdeveniment de buidatge processat "%1$s", detall "%3$.*2$s".
J2JX086=S'han escrit %1$i octets al fitxer de s\u00EDmbols %2$s
DUMP012=Error al buidatge %1$s\: %2$s
J2JX085=Error intern\: codi d'error no suportat des de la classe rom de creaci\u00F3 %d
DUMP011=El buidatge %1$s ha generat el proc\u00E9s %2$d
J2JX084=
DUMP010=Buidatge %1$s enregistrat a %2$s
J2JX083=Inclusi\u00F3 de %s a AOT
J2JX082=Exclusi\u00F3 de %s des de AOT
J2JX081=Error\: %s
J2JX080=Error de verificaci\u00F3 al m\u00E8tode %1$i (%3$.*2$s%5$.*4$s) al PC %6$i
CFRE069=longitud de l'atribut superior a les dades de l'atribut
CFRE068=nom de classe no v\u00E0lid
CFRE067=etiqueta d'entrada d'agrupaci\u00F3 de constants desconeguda
CFRE066=diversos atributs InnerClasses
CFRE065=diversos atributs de m\u00E8tode d'inclusi\u00F3
CFRE064=el descriptor ha de ser una s\u00E8rie UTF8
CFRE063=el codi de bytes invoke crida un m\u00E8tode no v\u00E0lid
CFRE062=locals m\u00E0xims inferiors a la mida d'arguments
CFRE061=el nom ha de ser una s\u00E8rie UTF8
CFRE060=el PC de final del manejador d'excepcions no \u00E9s una instrucci\u00F3 o el final de la matriu de codis de bytes
DUMP009=El buidatge %s no est\u00E0 disponible
DUMP008=es fa servir '%s'
DUMP007=JVM que sol\u00B7licita buidatge %1$s mitjan\u00E7ant '%2$s'
DUMP006=Processant esdeveniment de buidatge "%1$s", detall "%3$.*2$s" - Espereu.
J2JX079=Error\: %1$s a %2$i
DUMP005=Falta el fitxer executable
J2JX078=Acci\u00F3 recomanada\:
DUMP004=Falta el nom de fitxer
J2JX077=Fitxer de classe no v\u00E0lid
DUMP003=No es reconeix el buidatge anomenat\: %s
J2JX076=Fitxer de classe no v\u00E0lid\: %s
DUMP002=Camp d'etiqueta no reconegut\: %%%1$c
J2JX075=El nom de l'entrada \u00E9s massa llarg\: %s
DUMP001=Incid\u00E8ncia de buidatge no reconeguda\: ...%s
J2JX074=S'ha intentat afegir l'entrada duplicada a JXE\: %s
DUMP000=Opci\u00F3 de buidatge no reconeguda\: -Xdump\:%s
J2JX073=fitxer de processament de dir\: %s
J2JX072=No s'ha pogut obrir el directori %s
J2JX071=Directori de processament\: %s
J2JX070=s'incrementa l'espai a\: %i octets
CFRE059=el PC de manejador d'excepcions no \u00E9s una instrucci\u00F3
CFRE058=\u00EDndex de variables locals fora de l'interval al retorn de subrutina
CFRE057=el tipus de manejador d'excepcions ha de ser una classe
CFRE056=recompte d'arguments de codi de bytes invokeinterface incorrecte
CFRE055=el PC de final del manejador d'excepci\u00F3 no \u00E9s v\u00E0lid
CFRE054=el codi de bytes de camp ha de fer refer\u00E8ncia a una refer\u00E8ncia de camp
CFRE053=el m\u00E8tode t\u00E9 m\u00E9s de 255 ranures d'arguments
CFRE052=la classe externa ha de ser una classe
CFRE051=la constant de s\u00E8rie ha de ser una s\u00E8rie
CFRE050=el m\u00E8tode d'interf\u00EDcie ha de ser p\u00FAblic i abstracte
J2JX069=grand\u00E0ria de mem\u00F2ria estimada\: %i octets
J2JX068=grand\u00E0ria del fitxer\: %i octets
J2JX067=No s'ha trobat cap classe v\u00E0lida a %s
J2JX066=No s'ha pogut obrir el fitxer\: %s
J2JX065=Error en tancar el fitxer zip\: %s
J2JX064=Els valors v\u00E0lids per a l'opci\u00F3 -precompileTarget s\u00F3n\:
SHRC289=
J2JX063=Els valors predeterminats s\u00F3n\:
SHRC288=La mem\u00F2ria cau de classe compartida oberta %1$s \u00E9s nom\u00E9s de lectura
J2JX062=fitxer(s) de classe         qualsevol nombre de fitxers que finalitzen amb .class, .jar, o .zip\n                            s'examinaran i s'afegiran al jxe\n
SHRC287=La mem\u00F2ria cau persistent de classe compartida %1$s \u00E9s nom\u00E9s de lectura
J2JX061=Opcions de compilaci\u00F3 avan\u00E7ades\:\n  -[no]precompile           [no] marca tots els m\u00E8todes per a la precompilaci\u00F3\n  -[no]precompileMethod xxx [no] marca el m\u00E8todes amb nom per a la precompilaci\u00F3\n  -[no]compileAheadOfTime   compila el m\u00E8tode marcat de forma avan\u00E7ada\n  -precompileTarget xxx     genera jxe per a l'arquitectura de destinaci\u00F3 i el SO xxx\n  -precompileOptions xxx    passa xxx al motor de precompilaci\u00F3\n  -[no]precompileResolve    [no] intenta resoldre refer\u00E8ncies externes durant la precompilaci\u00F3\n  -[no]stripBytecode        [no] separa el codi d'octet per als m\u00E8todes compilats aot\n
SHRC286=No s'ha pogut crear una mem\u00F2ria cau en modalitat de nom\u00E9s lectura
J2JX060=\  -j2se                     useu aquesta opci\u00F3 quan useu jar2jxe en un entorn J2SE\n
SHRC285=Obre la mem\u00F2ria cau amb permisos de nom\u00E9s lectura
SHRC284=La grand\u00E0ria de la p\u00E0gina del sistema operatiu \u00E9s incompatible amb aquesta mem\u00F2ria cau. Intentant tornar a crear la mem\u00F2ria cau.
CFRE049=el codi de bytes checkcast ha de fer refer\u00E8ncia a una classe
SHRC283=Intentant destruir totes les mem\u00F2ries cau de cacheDir %s
CFRE048=\u00EDndex de variables locals fora de l'interval al magatzem
SHRC282=Enumeraci\u00F3 de totes les mem\u00F2ries cau a cacheDir %s
CFRE047=la classe d'interf\u00EDcie nom\u00E9s pot ser p\u00FAblica, abstracta o anotaci\u00F3
SHRC281=Tornar a crear una mem\u00F2ria cau compartida a l'inici
CFRE046=separaci\u00F3 de codi de bytes de switch incorrecte
SHRC280=Tingueu en compte que la utilitat "%s" no pot funcionar en una mem\u00F2ria cau de classe incompatible "%s". Utilitzeu una JVM al nivell correcte.
CFRE045=\u00EDndex d'agrupaci\u00F3 de constants fora de l'interval
CFRE044=la ranura reservada de codi de bytes invokeinterface no \u00E9s zero
CFRE043=el codi de bytes no es pot eixamplar
CFRE042=mida de matriu de codis de bytes > 65535
CFRE041=versi\u00F3 inferior incorrecta
CFRE040=longitud de l'atribut inferior a les dades de l'atribut
J2JX059=\  -[no]tools                el directori d'eines [no] s'afegeix a la llista de directoris d'extensi\u00F3.
J2JX058=\  -padJxe                   afegeix al final de l'jxe xxx octets addicionals
J2JX057=\  -[no]segmented            [no] genera jxes amb segments m\u00FAltiples\n  -maxSegmentSize xxx       grand\u00E0ria m\u00E0xima per a qualsevol jxe segmentat (n\u00FAmero hex.)\n  -maxSegmentSize seg\=xxx   grand\u00E0ria m\u00E0xima per a jxe segmentats espec\u00EDfics (n\u00FAmero hex.)\n  -locate xxx               localitza la imatge de l'adre\u00E7a xxx (n\u00FAmero hex.)\n  -locate seg\=xxx           localitza la imatge d'un segment a l'adre\u00E7a hex. xxx
J2JX056=\  -fileExtension xxx        tracta els fitxers que finalitzen amb .xxx com a fitxers .jar
J2JX055=\  -vmOption xxx             utilitza una vmOption xxx quan s'executa jxe
J2JX054=\  -versionName xxx          estableix el nom de versi\u00F3 del jxe en xxx
SHRC279=Per executar la utilitat "%s" a la mem\u00F2ria cau de classe no persistent "%s", tamb\u00E9 cal utilitzar la subopci\u00F3 "nonpersistent"
J2JX053=\  -description xxx          estableix la descripci\u00F3 del jxe en xxx
SHRC278=Per executar la utilitat "%s" a la mem\u00F2ria cau de classe persistent "%s", no utilitzeu la subopci\u00F3 "nonpersistent"
J2JX052=\  -uuid xxx                 estableix el UUID del jxe en xxx
SHRC277=Estableix la ubicaci\u00F3 dels fitxers de mem\u00F2ria cau de JVM
J2JX051=\  -D xxx\=yyy                estableix la propietat del sistema xxx a yyy
SHRC276=S'ha inhabilitat la protecci\u00F3 de p\u00E0gina de mem\u00F2ria per a la mem\u00F2ria cau
J2JX050=\  -startupClass xxx         estableix la classe d'inici en xxx\n  -noStartupClass           indica que el jxe no disposa d'una classe d'inici
SHRC275=S'ha habilitat correctament la protecci\u00F3 de p\u00E0gina de mem\u00F2ria per defecte per a la mem\u00F2ria cau
SHRC274=S'ha habilitat correctament tota la protecci\u00F3 de p\u00E0gina de mem\u00F2ria per a la mem\u00F2ria cau
CFRE039=\u00EDndex de variables locals fora de l'interval a c\u00E0rrega
SHRC273=Subopci\u00F3 de l'opci\u00F3 mprotect\= no reconeguda
CFRE038=el m\u00E8tode t\u00E9 dos atributs d'excepcions
SHRC272=Configurar la protecci\u00F3 de p\u00E0gina de mem\u00F2ria de mem\u00F2ria cau
CFRE037=temp cont\u00E9 un tipus incorrecte
SHRC271=El sistema no admet la protecci\u00F3 de p\u00E0gina de mem\u00F2ria
CFRE036=la destinaci\u00F3 no \u00E9s una instrucci\u00F3 en un codi de bytes jump
SHRC270=[-Xshareclasses mem\u00F2ria cau d'entrades bootclasspath inhabilitada]
CFRE035=el nou codi de bytes ha de fer refer\u00E8ncia a una classe
CFRE034=codi de bytes incomplets
CFRE033=l'interval de manejadors d'excepcions \u00E9s buit
CFRE032=la superclasse d'interf\u00EDcie ha de ser java.lang.Object
CFRE031=l'excepci\u00F3 emesa ha de ser una classe
CFRE030=superclasse nul\u00B7la
J2JX049=\  -srcDir xxx               inclou tots els fitxers a l'arbre de resultats xxx
J2JX048=\  -outputFormat xxx         estableix el format de resultats en xxx (c, bin, o jar)
J2JX047=\  -o xxx                    estableix el nom de fitxer de resultats base en xxx
J2JX046=\  -be                       genera resultats en big endian\n  -le                       genera resultats en little endian
J2JX045=\  -version                  imprimeix la versi\u00F3 d'aquest programa
J2JX044=\  -[no]profile              [no] genera un fitxer .prf per a crear perfil
SHRC269=Inhabilita mem\u00F2ria cau de classes bootclasspath
J2JX043=
SHRC268=[-Xshareclasses mem\u00F2ria cau de classes transformades de nou habilitada]
J2JX042=\  -[no]verify               [no] verifica el format del fitxer de classe
SHRC267=Classes de mem\u00F2ria cau que es tornen a transformar a trav\u00E9s de JVMTI
J2JX041=\  -q                        modalitat silenciosa\n  -[no]logo                 [no] imprimeix el missatge de copyright\n  -verbose                  modalitat detallada
SHRC266=No ajusta les \u00E0rees de mem\u00F2ria cau als l\u00EDmits de la p\u00E0gina
J2JX040=\u00DAs\:\t%s [opcions] fitxer(s) de classe\n\n[opcions]\n  -help, -?                 imprimeix l'\u00FAs
SHRC265=Habilita p\u00E0gines detallades de CompositeCache
SHRC264=Bytes de dades     \= %d
CFRE029=el codi de bytes multianewarray ha de fer refer\u00E8ncia a una classe
SHRC263=Habilita sortida detallada interna de la s\u00E8rie
CFRE028=el codi de bytes ldc* ha de fer refer\u00E8ncia a una constant
SHRC262=No s'ha pogut crear l'agrupaci\u00F3 a ByteDataManager
CFRE027=el codi de bytes multianewarray ha de fer refer\u00E8ncia a una classe de matriu
SHRC261=No es pot escriure el mutex de la taula d'aleatoritzaci\u00F3 de Manager
CFRE026=tipus de codi de bytes newarray no reconegut
SHRC260=No es pot assignar mem\u00F2ria per a l'entrada de la taula d'aleatoritzaci\u00F3 a Manager
CFRE025=el camp t\u00E9 dos atributs ConstantValue
CFRE024=el nom de classe ha de ser una s\u00E8rie
CFRE023=agrupaci\u00F3 de constants buida
CFRE022=thisClass ha d'\u00E9sser una classe
CFRE021=camp duplicat
CFRE020=el PC d'inici del manejador d'excepcions no \u00E9s v\u00E0lid
J2JX039=IBM \u00E9s una marca registrada d'IBM Corp.\nJava i totes les marques i logotips basats en Java s\u00F3n marques registrades\n o comercials de Sun Microsystems, Inc.
J2JX038=Materials sota llic\u00E8ncia - Propietat d'IBM
J2JX037=
J2JX036=Destinaci\u00F3\: %s\n
J2JX035=(c) Copyright IBM Corp. 1991, 2005  Reservats tots els drets
J2JX034=J9 Java(TM) JAR to JXE, Versi\u00F3 %s
SHRC259=No es pot assignar mem\u00F2ria a l'\u00EDtem de llista enlla\u00E7at al gestor
J2JX033=Error intern\: ha fallat la compilaci\u00F3 correcta de la classe rom d'error
SHRC258=La mem\u00F2ria cau compartida persistent "%1$s" s'ha eliminat
J2JX032=Cometes desequilibrades a la llista de par\u00E0metres
SHRC257=Error en actualitzar la data de darrera desconnexi\u00F3 del fitxer de mem\u00F2ria cau de class compartides a la sortida de la JVM
J2JX031=ha finalitzat la lectura del fitxer JAR\: %s
SHRC256=Error en establir la longitud del fitxer de mem\u00F2ria cau de class compartides
J2JX030=Error de lectura de %1$s de %2$s
SHRC255=Error en escriure la cap\u00E7alera al fitxer de mem\u00F2ria cau de les class compartides
SHRC254=Error en cercar al fitxer de mem\u00F2ria cau de class compartides
CFRE019=inici de PC variable local no v\u00E0lid
SHRC253=Error en alliberar el bloqueig d'escriptura de cap\u00E7alera de fitxer de mem\u00F2ria cau de les classes compartides
CFRE018=la classe inner ha de ser una classe
SHRC252=Error\: no es pot adquirir el bloqueig d'escriptura de cap\u00E7alera del fitxer de mem\u00F2ria cau de les classes compartides
CFRE017=diversos atributs StackMap/StackMapTable
SHRC251=No suprimir autom\u00E0ticament mem\u00F2ries cau de diferents buildID
CFRE016=\u00EDndex de variables locals fora de l'interval en increment
SHRC250=No es pot obrir la mem\u00F2ria cau en modalitat de nom\u00E9s lectura donat que encara no s'ha inicialitzat
CFRE015=les interf\u00EDcies han de ser classes
CFRE014=Atribut de codi especificat per a un m\u00E8tode nadiu o abstracte
CFRE013=longitud de PC variable local no v\u00E0lid
CFRE012=el valor constant ha de ser un valor
CFRE011=el codi de bytes anewarray ha de fer refer\u00E8ncia a una clase
CFRE010=recompte negatiu per a parelles de coincid\u00E8ncia i despla\u00E7ament al codi de bytes lookupswitch
J2JX029=processant\: %s
J2JX028=Error en llegir l'entrada de %s
J2JX027=No s'ha pogut obrir o llegir %s
J2JX026=
J2JX025=S'ha intentat afegir la classe duplicada a JXE %s
J2JX024=s'ha afegit el fitxer de classe\: %s
SHRC249=Error\: modlevel de cap\u00E7alera de fitxer de class compartides no \u00E9s v\u00E0lid
J2JX023=s'ha intentat afegir el fitxer de classe\: %s
SHRC248=Error\: la versi\u00F3 de cap\u00E7alera del fitxer de mem\u00F2ria cau de class compartides no \u00E9s v\u00E0lida
J2JX022=%s no \u00E9s v\u00E0lid
SHRC247=Error\: eyecatcher de cap\u00E7alera de fitxer de class compartides no \u00E9s v\u00E0lid
J2JX021=No s'ha pogut carregar %1$s\: %2$s
SHRC246=S'ha connectat la mem\u00F2ria cau persistent de classes compartides %1$s
J2JX020=ncpRef [%1$x] creix de %2$u entrades a %3$u entrades
SHRC245=Error en mapar el fitxer de mem\u00F2ria cau de class compartides
SHRC244=Error en obtenir la longitud de fitxer de mem\u00F2ria cau de class compartides
CFRE009=el camp d'interf\u00EDcie ha de ser public static i final
SHRC243=Error en alliberar el bloqueig de lectura de connexi\u00F3 del fitxer de mem\u00F2ria cau de les class compartides
CFRE008=alt < baix al codi de byte tableswitch
SHRC242=Error en actualitzar la data de darrera desconnexi\u00F3 del fitxer de mem\u00F2ria cau de class compartides
CFRE007=la signatura de camp no \u00E9s v\u00E1lida
SHRC241=Error\: no es pot suprimir el fitxer de mem\u00F2ria cau de les class compartides
CFRE006=atribut StackMap/StackMapTable no v\u00E0lid
SHRC240=Error\: no es pot adquirir el bloqueig d'escriptura de connexi\u00F3 del fitxer de mem\u00F2ria cau de les class compartides
CFRE005=interf\u00EDcie duplicada
CFRE004=codi de byte desconegut
CFRE003=versi\u00F3 principal incorrecta
CFRE002=el nom de m\u00E8tode no \u00E9s v\u00E0lid
CFRE001=%1$s; class\=%3$.*2$s, offset\=%4$u
CFRE000=%1$s; class\=%3$.*2$s, method\=%5$.*4$s%7$.*6$s, pc\=%8$u
J2SE000=\n
J2JX019=la mem\u00F2ria interm\u00E8dia [%1$x] creix de %2$u a %3$u
J2JX018=%s creat satisfact\u00F2riament
J2JX017=No s'ha pogut escriure les dades en el fitxer\: %s
J2JX016=No s'ha pogut crear/esborrar el fitxer\: %s
J2JX015=Codi d'error desconegut\: %d
J2JX014=Ha fallat la inicialitzaci\u00F3 d'AOT
SHRC239=Error\: no es pot adquirir el bloqueig d'escriptura de cap\u00E7alera del fitxer de mem\u00F2ria cau de les class compartides
J2JX013=Error intern\: ha fallat la rotaci\u00F3 Endian
J9CL015=Error en crear la tra\u00E7a de pila (m\u00E9s probable a causa de la manca de mem\u00F2ria del sistema operatiu)
SHRC238=Error\: la mem\u00F2ria cau de class compartides no est\u00E0 connectada
J2JX012=L'UUID proporcionat no \u00E9s v\u00E0lid
J9CL014=%1$s\: no es reconeix l'opci\u00F3 --> '%2$s'
SHRC237=S'ha obert la mem\u00F2ria cau persistent de classes compartides %1$s
J2JX011=Error intern\: l'entrada ZIP no s'ha tancat
J9CL013=No s'ha pogut assignar el supervisor del sistema operatiu
J9GC063=No es pot obrir el nom de fitxer '%s' per escriure-hi
SHRC236=S'ha creat la mem\u00F2ria cau persistent de classes compartides %1$s
J2JX010=Error intern\: error en llegir
J9CL012=
J9GC062=El valor %s ha de ser una pot\u00E8ncia de dos
SHRC235=Error en adquirir el bloqueig de lectura de connexi\u00F3 del fitxer de mem\u00F2ria cau de les class compartides
J9CL011=No s'ha pogut fer un proc\u00E9s fork al fil del sistema operatiu
J9GC061=mida m\u00E0xima d'espai de mem\u00F2ria en l'\u00E0mbit
SHRC234=Error en adquirir el bloqueig de lectura de connexi\u00F3 del fitxer de mem\u00F2ria cau de les class compartides
J9CL010=No s'ha pogut assignar JNIEnv
J9GC060=mida d'espai de mem\u00F2ria permanent
SHRC233=Error en crear la cap\u00E7alera de fitxer de mem\u00F2ria cau de class compartides
SHRC232=No s'ha pogut crear una mem\u00F2ria cau en modalitat de nom\u00E9s lectura
SHRC231=Error en establir la longitud de fitxer de mem\u00F2ria cau de class compartides
SHRC230=Error en inicialitzar la cap\u00E7alera de dades de mem\u00F2ria cau compartides
J2JX009=Error intern\: ha fallat la cerca
J2JX008=Error intern\: no hi ha entrades
J2JX007=Error intern\: entrada duplicada
J9CL009=El fil ja s'ha iniciat
J9GC059="La pol\u00EDtica de metr\u00F2nom no es permet sense -Xrealtime"
J2JX006=Sense mem\u00F2ria
J9CL008=el valor de temps d'espera en nanosegons est\u00E0 fora de l'interval
J9GC058=No s'ha pogut assignar espai de mem\u00F2ria permanent
J2JX005=Error intern\: no coincid\u00E8ncia de grand\u00E0ria
J9CL007=el valor de temps d'espera \u00E9s negatiu
J9GC057=%1$s no ha de ser m\u00E9s gran que %2$s
J2JX004=Error intern\: no coincid\u00E8ncia de CRC
J9CL006=No hi ha dades de verificaci\u00F3 pr\u00E8via per java/lang/Object
J9GC056=mides de p\u00E0gina gran disponibles\:
SHRC229=Error\: el fitxer de mem\u00F2ria cau de class compartides t\u00E9 una cap\u00E7alera no v\u00E0lida
J2JX003=Error intern\: argument de funci\u00F3 incorrecte
J9CL005=Versi\u00F3 de la biblioteca de classes incompatible\: cal VM v%1$i, es troba v%2$i
J9GC055=mida de p\u00E0gina gran
SHRC228=Error en actualitzar la data de darrera connexi\u00F3 de la mem\u00F2ria cau de class compartides
J2JX002=S'han precompilat %1$d de %2$d m\u00E8todes per a la destinaci\u00F3 %3$s.
J9CL004=Versi\u00F3 de la biblioteca de classes incompatible\: JCL v%1$i esperat, v%2$i trobat
J9GC054=La mida de p\u00E0gina gran %1$zu%2$s no \u00E9s una mida de p\u00E0gina admesa; s'utilitzar\u00E0 %3$zu%4$s
SHRC227=Error en adquirir el bloqueig d'escriptura de cap\u00E7alera de fitxer de mem\u00F2ria cau de les class compartides
J2JX001=Recurs emmagatzemat\: %s
J9CL003=Versi\u00F3 de la biblioteca de classes incompatible\: JCL %1$x, VM %2$x
J9GC053=M\u00E0xim de mem\u00F2ria
SHRC226=Error en obrir el fitxer de mem\u00F2ria cau de class compartides
J2JX000=S'ha intentat afegir un fitxer de recurs duplicat [%s], s'ignora el fitxer.
J9CL002=Les classes s\u00F3n de la biblioteca no J9 o JXE s'ha redu\u00EFt de forma incorrecta
J9GC052=Increment del segment de la classe ROM
SHRC225=Error en obtenir el cam\u00ED d'acc\u00E9s de fitxer de mem\u00F2ria cau
J9CL001=Proveu d'executar amb -jcl\:%s
J9GC051=Increment del segment de la classe RAM
SHRC224=Mem\u00F2ria insuficient per a la c\u00F2pia local del nom de mem\u00F2ria cau
J9CL000=Biblioteca de classes incompatible
J9GC050=mem\u00F2ria temporal m\u00E0xima
SHRC223=Les mem\u00F2ries cau de class compartides persistents no es poden crear/utilitzar perqu\u00E8 el bloqueig de fitxer no s'admet
SHRC222=Les mem\u00F2ries cau de class compartides persistents no es poden crear/utilitzar no admet les possibilitats necess\u00E0ries
SHRC221=Missatge d'error de plataforma\: %1$s
SHRC220=Codi d'error de capa de port \= %1$d
J9GC049=mida establerta conservada
J9GC048=increment d'espai antic
J9GC047=mida m\u00E0xima d'espai antic
J9GC046=mida inicial d'espai antic
SHRC219=[-Xshareclasses acc\u00E9s de grup habilitat per a noves mem\u00F2ries cau]
J9GC045=mida de mem\u00F2ria inicial
SHRC218=[-Xshareclasses mem\u00F2ria cau persistent inhabilitada]
J9GC044=mida m\u00E0xima de nou espai
SHRC217=[-Xshareclasses mem\u00F2ria cau persistent habilitada]
J9GC043=mida inicial de nou espai
SHRC216=Crea mem\u00F2ria cau de class compartides no persistents
J9GC042=La suma de %1$s i %2$s \u00E9s massa petita per a %3$s
SHRC215=Crea mem\u00F2ria cau de class compartides persistents
J9GC041=No es coneix el tipus fvtest\: %s
SHRC214=No es pot escriure el mutex de la taula d'aleatoritzaci\u00F3 de ByteDataManager
J9GC040=Opci\u00F3 desconeguda\: %s
SHRC213=No es pot assignar mem\u00F2ria per l'entrada de la taula d'aleatoritzaci\u00F3 a ByteDataManagerImpl
SHRC212=S'estan emmagatzemant les dades de bytes per a la clau %.*s a la mem\u00F2ria cau compartida...
SHRC211=S'estan cercant les dades de bytes per a la clau %.*s a la mem\u00F2ria cau compartida...
SHRC210=[-Xshareclasses sortida detallada de dades de bytes habilitada]
J9GC039=*** %1$s desaprovat\: en el seu lloc, feu servir %2$s ***
J9GC038=El valor %s especificat \u00E9s massa llarg
J9GC037=%1$s no est\u00E0 suportat amb altres valors que no siguin %2$zu
J9GC036=El valor %1$s ha de ser superior a %2$zu
SHRC209=Habilita sortida detallada de dades de bytes
J9GC035=%s ha d'anar seguida d'un n\u00FAmero
SHRC208=No es pot assignar mem\u00F2ria per l'agrupaci\u00F3 d'\u00EDtems de la taula d'aleatoritzaci\u00F3 a CompiledMethodManagerImpl
J9GC034=El valor %1$s ha d'estar entre %2$zu i %3$zu (inclusiu)
SHRC207=No es pot escriure el mutex de la taula d'aleatoritzaci\u00F3 de CompiledMethodManager
J9GC033=El valor %1$s ha d'estar entre %2$.2f i %3$.2f (inclusiu)
SHRC206=No es pot assignar mem\u00F2ria per l'entrada de la taula d'aleatoritzaci\u00F3 a CompiledMethodManagerImpl
J9GC032=La configuraci\u00F3 del sistema no d\u00F3na suport a l'opci\u00F3 '%s'
SHRC205=No s'ha pogut crear un nou \u00EDtem de taula d'aleatoritzaci\u00F3 a CompiledMethodManagerImpl.
J9GC031=Error de l'opci\u00F3\: '%1$s' i '%2$s', ambd\u00F3s no es poden especificar
SHRC204=No es pot crear el mutex de la taula d'aleatoritzaci\u00F3 al gestor de classes compartides
J9GC030=El valor %1$s de %2$.2f ha de ser, com a m\u00EDnim, %3$s menys que el valor %4$s de %5$.2f
SHRC203=No es pot crear la taula d'aleatoritzaci\u00F3 al gestor de classes compartides
SHRC202=No s'han pogut inicialitzar les agrupacions al gestor de classes compartides
SHRC201=\ S'ha substitu\u00EFt correctament %2$.*1$s.
SHRC200=\ S'ha trobat correctament %2$.*1$s.
J9GC029=Error de l'opci\u00F3\: '%s'
J9GC028=Opci\u00F3 massa gran\: '%s'
J9GC027=Opci\u00F3 mal formada\: '%s'
J9GC026=-Xverbosegclog no ha pogut assignar estructures internes
JNCK094=Error JNI a %1$s\: les dades a les quals apunta l'argument \#%2$d s'han modificat durant l'execuci\u00F3 de %3$s. Un altre fil o una crida imbricada ha modificat les dades. El resultat de %4$s pot ser incorrecte i la VM pot esdevenir inestable
J9GC025=La suma de %1$s i %2$s
JNCK093=Error JNI a %s\: el m\u00E8tode no \u00E9s un constructor
J9GC024=La suma de %1$s i %2$s \u00E9s massa gran per l'\u00E0rea d'emmagatzematge
JNCK092=\tvalist         comprova la reutilitzaci\u00F3 de va_list
J9GC023=La suma de %1$s i %2$s ha de ser igual a %3$s
JNCK091=Consell detectat al marc del manejador d'un esdeveniment JVMPI o JVMTI\n
J9GC022=La suma de %1$s i %2$s \u00E9s massa gran per %3$s
JNCK090=Av\u00EDs detectat al marc del manejador d'un esdeveniment JVMPI o JVMTI\n
J9GC021=%1$s ha de ser igual a %2$s
J9GC020=%s massa gran per l'\u00E0rea d'emmagatzematge
JITM007=Codi AOT incompatible amb els valors JVMPI/JVMTI. Es passar\u00E0 per alt el codi AOT a la mem\u00F2ria cau de classe compartida.
JITM006=El codi AOT de la mem\u00F2ria cau de classe compartida utilitza una pol\u00EDtica GC diferent que la JVM actual. Es passar\u00E0 per alt el codi AOT a la mem\u00F2ria cau de classe compartida.
JITM005=El codi AOT generat amb una altra versi\u00F3 de JVM no es pot executar amb aquesta versi\u00F3 de JVM. Es passar\u00E0 per alt el codi AOT a la mem\u00F2ria cau de classe compartida.
JITM004=El codi AOT a la mem\u00F2ria cau de classe compartida al processador actual. Es passar\u00E0 per alt el codi AOT a la mem\u00F2ria cau de classe compartida.
JITM003=Error durant la inicialitzaci\u00F3 de temps d'execuci\u00F3 d'AOT. Es passar\u00E0 per alt el codi AOT a la mem\u00F2ria cau de classe compartida.
JITM002=Error en emmagatzemar el codi AOT a la mem\u00F2ria cau de classe compartida. La mem\u00F2ria cau de classe compartida pot estar malmesa. Es passar\u00E0 per alt el codi AOT a la mem\u00F2ria cau de classe compartida.
JITM001=No queda espai per a codi AOT a la mem\u00F2ria cau de classe compartida. No es generar\u00E0 el nou codi AOT.
JITM000=Maquinari no suportat [%d].
JNCK089=Error detectat al marc del manejador d'un esdeveniment JVMPI o JVMTI\n
JNCK088=Av\u00EDs de JNI a %1$s\: l'argument \#%2$d \u00E9s una refer\u00E8ncia feble. Una refer\u00E8ncia feble pot ser NULL en qualsevol moment. Cal promoure la refer\u00E8ncia utilitzant NewLocalRef o NewGlobalRef i comparar-se amb NULL abans de cridar %3$s
J9GC019=%1$s \u00E9s massa gran per %2$s
JNCK087=Error JNI a %1$s\: l'argument \#%2$d no \u00E9s una java/lang/reflect/Method o java/lang/reflect/Constructor
J9GC018=%1$s \u00E9s massa petit per %2$s
JNCK086=Av\u00EDs JNI a %1$s\: l'argument \#%2$d no \u00E9s una java/nio/Buffer. %3$s retornar\u00E0 un codi d'error.
J9GC017=%1$s \u00E9s massa petit, ha de ser, com a m\u00EDnim, %2$zu %3$sbytes
JNCK085=Consell detectat a JNI_OnLoad de la biblioteca %.*s\n
J9GC016=No s'ha pogut assignar un segment de supervivent a l'espai de mem\u00F2ria per defecte
JNCK084=Av\u00EDs detectat a JNI_OnLoad de la biblioteca %.*s\n
J9GC015=No s'ha pogut assignar l'espai de mem\u00F2ria per defecte
JNCK083=Error detectat a JNI_OnLoad de la biblioteca %.*s\n
J9GC014=No s'ha pogut assignar els segments de mem\u00F2ria de classe VM
JNCK082=Consell detectat al marc m\u00E9s extern d'un fil adjunt\n
J9GC013=No s'ha pogut assignar els segments de mem\u00F2ria d'objectes VM
JNCK081=Av\u00EDs detectat al marc m\u00E9s extern d'un fil adjunt\n
J9GC012=No s'ha pogut assignar els segments de mem\u00F2ria VM
JNCK080=Error detectat al marc m\u00E9s extern d'un fil adjunt\n
J9GC011=No s'ha pogut inicialitzar l'agrupaci\u00F3 d'espais de mem\u00F2ria
J9GC010=No s'ha pogut inicialitzar la gesti\u00F3 del finalitzador
VRFY040=
JNCK079=Consell detectat a %2$.*1$s.%4$.*3$s%6$.*5$s\n
JNCK078=Av\u00EDs detectat a %2$.*1$s.%4$.*3$s%6$.*5$s\n
J9GC009=No s'ha pogut inicialitzar el mutex per les estad\u00EDstiques GC
JNCK077=Error detectat a %2$.*1$s.%4$.*3$s%6$.*5$s\n
J9GC008=No s'ha pogut inicialitzar les extensions de m\u00F2dul
JNCK076=Error intern de jnichk a %s\: mem\u00F2ria insuficient
J9GC007=No s'ha pogut inicialitzar, analitzant la l\u00EDnia d'ordres
JNCK075=Error intern de jnichk a %1$s\: descriptor no reconegut 0x%2$x
J9GC006=No s'ha pogut inicialitzar, sense mem\u00F2ria
JNCK074=Consell JNI a %s\: la mem\u00F2ria interm\u00E8dia sembla que no s'ha modificat. Considereu la possibilitat d'utilitzar JNI_ABORT enlloc de mode 0.
J9GC005=No s'ha pogut inicialitzar
JNCK073=Consell JNI a %1$s\: s'ha especificat JNI_ABORT, per\u00F2 no \u00E9s correcte perqu\u00E8 s'han modificat dades.\n(CRC original\=0x%2$x, CRC nou\=0x%3$x).\nCom que %4$s ha retornat els continguts actuals de la matriu, no es descartaran els canvis. Probablement no \u00E9s el que voleu.
J9GC004=No s'ha pogut particularitzar el recollidor d'escombraries globals
JNCK072=Consell JNI a %1$s\: s'ha especificat JNI_COMMIT, per\u00F2 s'ignorar\u00E0.\nCom que %2$s ha retornat els continguts actuals de la matriu, la mem\u00F2ria interm\u00E8dia ser\u00E0 no v\u00E0lida despr\u00E9s de la crida. Probablement no \u00E9s el que voleu.
J9GC003=No s'ha pogut particularitzar l'expenedor de tasques
JNCK071=Av\u00EDs JNI\: la mem\u00F2ria a 0x%1$p adquirida per %2$s no s'ha alliberat abans de retornar de la nadiua. Probablement s'ha produ\u00EFt per una p\u00E8rdua de mem\u00F2ria.
J9GC002=No s'ha pogut particularitzar l'\u00E0rea d'emmagatzematge.%1$zu%2$s sol\u00B7licitat
JNCK070=Av\u00EDs JNI a %1$s\: les dades de la matriu original s'han modificat entre %2$s i %3$s.\n(CRC original\=0x%4$x, CRC nou\=0x%5$x).\nCom que %6$s ha retornat una c\u00F2pia dels continguts de la matriu, els continguts nous es perdran.
J9GC001=No s'ha pogut particularitzar l'\u00E0rea d'emmagatzematge
J9GC000=Error intern, sense mem\u00F2ria
VRFY039=codi de byte desconegut
VRFY038=invokespecial a destinaci\u00F3 no v\u00E0lida
VRFY037=objecte no inicialitzat durant bifurcaci\u00F3 regressiva
VRFY036=flux insuficient de pila
VRFY035=sense error
SHRC099=%1$d\: 0x%2$p ORPHAN\: %4$.*3$s a 0x%5$p.
VRFY034=PC de destinaci\u00F3 no v\u00E0lid
SHRC098=\nEstad\u00EDstiques actuals de la mem\u00F2ria cache %s\: \n
VRFY033=el camp no \u00E9s del tipus compatible
SHRC097=La mem\u00F2ria cau compartida "%s" est\u00E0 malmesa. No es permetr\u00E0 a cap JVM nova connectar-se amb la mem\u00F2ria cau.\n
VRFY032=receptor incorrecte per a <init>
SHRC096=La mem\u00F2ria cau compartida "%s" est\u00E0 plena. Utilitzeu -Xscmx per establir la grand\u00E0ria de la mem\u00F2ria cau.
VRFY031=l'intent de iinc no \u00E9s un enter
SHRC095=Els intents de cridar markStale en elements de mem\u00F2ria cau compartits no han tingut \u00E8xit
VRFY030=tipus incorrecte a la pila
SHRC094=S'ha trobat un valor orfe per\u00F2 la classe ROMClass local s'ha enviat a addROMClassToCache
SHRC093=S'ha detectat una finalitzaci\u00F3 no esperada d'una altra JVM durant l'actualitzaci\u00F3
SHRC092=Error ADD en llegir la mem\u00F2ria cau
SHRC091=Llegir dades malmeses de l'element 0x%p (tipus de dades no v\u00E0lid)
SHRC090=No es pot obtenir el mutex de mem\u00F2ria cau a l'inici de SH_CacheMap
JNCK069=Av\u00EDs JNI a %1$s\: el final \u00E9s fora de l'interval (%2$d + %3$d > %4$d)
JNCK068=Av\u00EDs JNI a %1$s\: l'inici o l'\u00EDndex s\u00F3n fora de l'interval (%2$d) >\= %3$d)
JNCK067=Av\u00EDs JNI a %1$s\: s'ha especificat una longitud negativa de regi\u00F3 (%2$d)
JNCK066=Av\u00EDs JNI a %1$s\: s'ha especificat un inici o \u00EDndex negatiu (%2$d)
JNCK065=Av\u00EDs JNI a %1$s\: La capacitat de marc de refer\u00E8ncia local ha crescut de %2$d a %3$d. Les refer\u00E8ncies %4$d estan en \u00FAs.\nUtilitzeu EnsureLocalCapacity o PushLocalFrame per fer que el marc augmenti espec\u00EDficament.
JNCK064=Av\u00EDs JNI a %1$s\: La capacitat d'agrupaci\u00F3 de refer\u00E8ncia feble global ha crescut autom\u00E0ticament de %2$d a %3$d.\nProbablement s'ha produ\u00EFt per una p\u00E8rdua de mem\u00F2ria.
JNCK063=Av\u00EDs JNI a %1$s\: La capacitat d'agrupaci\u00F3 de refer\u00E8ncia global ha crescut autom\u00E0ticament de %2$d a %3$d.\nProbablement s'ha produ\u00EFt per una p\u00E8rdua de mem\u00F2ria.
JNCK062=Av\u00EDs JNI a %s\: no es pot cridar aquesta funci\u00F3 dins d'una secci\u00F3 cr\u00EDtica.
JNCK061=Av\u00EDs JNI a %1$s\: l'argument \#%2$d \u00E9s una signatura de camp mal formada ("%3$s")
JNCK060=Av\u00EDs JNI a %1$s\: l'argument \#%2$d \u00E9s un m\u00E8tode de signatura mal format ("%3$s")
VRFY029=returnAddress no v\u00E0lida per a la instrucci\u00F3 ret
VRFY028=dimensi\u00F3 incorrecta
VRFY027=receptor incompatible amb classe declarant
VRFY026=EOF inesperat
VRFY025=acc\u00E9s incorrecte a dades protegides
SHRC089=No es pot crear el mutex de renovaci\u00F3 a SH_CacheMap
VRFY024=els arguments no s\u00F3n del tipus compatible
SHRC088=No es pot crear la mem\u00F2ria cau com a ROMImageSegment a SH_CacheMap
VRFY023=el par\u00E0metre tableswitch no \u00E9s enter
SHRC087=Error MarkStale durant ClasspathManager\:\:update()
VRFY022=les subrutines s'han de reprendre per cada jsr
SHRC086=No es pot escriure el mutex de la taula d'aleatoritzaci\u00F3 ClasspathManager
VRFY021=objecte llan\u00E7at no es pot llan\u00E7ar
SHRC085=No es pot assignar mem\u00F2ria per a la cap\u00E7alera de l'element de la llista vinculada
VRFY020=els arguments d'invocaci\u00F3 no s\u00F3n del tipus compatible
SHRC084=No es pot assignar mem\u00F2ria per a l'element de la llista vinculada
SHRC083=No es pot assignar mem\u00F2ria per a la matriu identifiedClasspaths a SH_ClasspathManagerImpl2
SHRC082=No es pot crear identifiedMutex a SH_ClasspathManagerImpl2
SHRC081=No es pot crear cpeTableMutex a SH_ClasspathManagerImpl2
SHRC080=No es pot assignar mem\u00F2ria per a l'entrada de taules d'aleatoritzaci\u00F3
JNCK059=Av\u00EDs JNI a %1$s\: l'argument \#%2$d \u00E9s un identificador mal format ("%3$s")
JNCK058=Av\u00EDs JNI a %1$s\: despr\u00E9s de cridar a %2$s, heu de comprovar les excepcions usant ExceptionCheck, ExceptionClear o ExceptionOccurred abans de cridar a %3$s
JNCK057=Error JNI a %1$s\: no utilitzeu %2$s per alliberar mem\u00F2ria 0x%3$p adquirida utilitzant %4$s
JNCK056=Error JNI a %1$s\: s'ha obtingut mem\u00F2ria 0x%2$p de l'objecte 0x%3$p, alliberant-la de 0x%4$p
VMUT002=(error d'acc\u00E9s)
JNCK055=Error JNI a %1$s\: cap funci\u00F3 JNI ha tornat el punter 0x%2$p, o ja s'ha alliberat
VMUT001=(fil sense nom)
JNCK054=Error JNI a %1$s\: l'opci\u00F3 de modalitat %2$d no es reconeix
VMUT000=(mem\u00F2ria insuficient)
JNCK053=Error JNI\: la secci\u00F3 cr\u00EDtica s'ha d'alliberar abans del retorn de la funci\u00F3
JNCK052=Error JNI a %1$s\: la classe %3$.*2$s \u00E9s obsoleta
JNCK051=Error VM intern a %1$s\: Els %2$p bytes inserits s\u00F3n inferiors als bytes %3$p de refer\u00E8ncia JNI
JNCK050=Error JNI a %s\: s'ha cridat a PopLocalFrame sense un marc local a la pila
VRFY019=c\u00E0rrega de classe fallida
VRFY018=pila m\u00E0xima superada
VRFY017=<init> no crida aquest <init> o s\u00FAper <init>
VRFY016=el par\u00E0metre de moviment de codi de byte no \u00E9s un enter
VRFY015=diversos retorns per un \u00FAnic jsr
SHRC079=No es pot crear la taula d'aleatoritzaci\u00F3 a SH_ClasspathManagerImpl2
VRFY014=codi de bytes de retorn no compatible amb el tipus de retorn
SHRC078=Error en crear l'agrupaci\u00F3 linkedListHdr a SH_ClasspathManagerImpl2
VRFY013=infracci\u00F3 de restricci\u00F3 de c\u00E0rrega de classe
SHRC077=Error en crear l'agrupaci\u00F3 linkedListImpl a SH_ClasspathManagerImpl2
VRFY012=forma de pila incoherent
SHRC076=Cercant la classe %1$s a la mem\u00F2ria cache compartida per l'ID de cldr %2$d...
VRFY011=el par\u00E0metre lookupswitch no \u00E9s un enter
SHRC075=\ ha fallat.
VRFY010=diversos jsr utilitzen un retorn \u00FAnic
SHRC074=\ correcte.
SHRC073=Emmagatzemant la classe %2$.*1$s a la mem\u00F2ria cache compartida per l'ID de cldr %3$d amb la URL %5$.*4$s (\u00EDndex %6$d)...
SHRC072=Opci\u00F3 de l\u00EDnia d'ordres "%s" no reconeguda
SHRC071=Opci\u00F3 de l\u00EDnia d'ordres "%s" requereix una subopci\u00F3
SHRC070=Actualitzacions incrementals inhabilitades
JNCK049=Error JNI a %s\: s'ha detectat un \u00FAs repetit de va_list
JNCK048=Error JNI a %s\: el receptor no \u00E9s comprensible
JNCK047=Error JNI a %s\: l'argument clazz \u00E9s incorrecte
JNCK046=Error JNI a %1$s\: el m\u00E8tode t\u00E9 un tipus de retorn incorrecte ('%2$c')
JNCK045=Error JNI a %s\: el m\u00E8tode no \u00E9s est\u00E0tic
JNCK044=Error JNI a %s\: el m\u00E8todes \u00E9s est\u00E0tic
JNCK043=Error JNI a %1$s\: argument \#%2$d; no es pot trobar %3$s
JNCK042=Error JNI a %1$s\: l'argument \#%2$d no \u00E9s una subclasse de %3$s
JNCK041=Error JNI a %1$s\: l'argument \#%2$d queda fora de l'\u00E0mbit d'un %3$s (0x%4$x > 0x%5$x)
JNCK040=Error JNI a %1$s\: l'argument \#%2$d queda fora de l'\u00E0mbit d'un %3$s (0x%4$x < 0x%5$x)
VRFY009=la matriu no \u00E9s del tipus compatible
VRFY008=l'\u00EDndex de matrius no \u00E9s enter
VRFY007=m\u00E8tode final substitu\u00EFt
VRFY006=la nova mida de matriu no \u00E9s un enter
VRFY005=local no \u00E9s del tipus compatible
SHRC069=Reducci\u00F3 de contenci\u00F3 d'emmagatzematge concurrent inhabilitada
VRFY004=l'inlining jsr ha trobat massa jsr
SHRC068=Mem\u00F2ria cau local de classpaths inhabilitats
VRFY003=la classe no cont\u00E9 dades de verificaci\u00F3 pr\u00E8via
SHRC067=Comprovaci\u00F3 de la indicaci\u00F3 hor\u00E0ria inhabilitada
VRFY002=seq\u00FCencia de codi de bytes no v\u00E0lida
SHRC066=Bloqueig de les taules d'aleatoritzaci\u00F3 locals inhabilitades
VRFY001=%1$s; class\=%3$.*2$s, method\=%5$.*4$s%7$.*6$s
SHRC065=No es pot assignar una agrupaci\u00F3 a shrinit
VRFY000=%1$s; class\=%3$.*2$s, method\=%5$.*4$s%7$.*6$s, pc\=%8$u
SHRC064=Error en crear configMonitor a shrinit
SHRC063=No es pot assignar mem\u00F2ria per a sharedClassConfig a shrinit
SHRC062=Error en copiar el nom d'usuari al nom de la mem\u00F2ria cau per defecte
SHRC061=El nom de la mem\u00F2ria cache no hauria de ser tenir una longitud superior a 64 car\u00E0cters. No s'ha creat la mem\u00F2ria cache.
SHRC060=No es pot assignar mem\u00F2ria per a la mem\u00F2ria interm\u00E8dia de s\u00E8ries a shrinit\:\:hookFindSharedClass
JNCK039=Error JNI a %1$s\: l'argument \#%2$d \u00E9s NULL
JNCK038=Error JNI a %1$s\: l'argument \#%2$d (0x%3$p) no \u00E9s una refer\u00E8ncia d'objecte v\u00E0lid. El seu tipus \u00E9s\: %4$s\n
JNCK037=Error JNI a %1$s\: l'argument \#%2$d (0x%3$p) no \u00E9s una refer\u00E8ncia local. El seu tipus \u00E9s\: %4$s
JNCK036=Error JNI a %1$s\: l'argument \#%2$d (0x%3$p) no \u00E9s una refer\u00E8ncia global feble. El seu tipus \u00E9s\: %4$s
JNCK035=Error JNI a %1$s\: l'argument \#%2$d (0x%3$p) no \u00E9s una refer\u00E8ncia global. El seu tipus \u00E9s\: %4$s
JNCK034=Error JNI a %1$s\: l'argument \#%2$d no \u00E9s un %3$s
JNCK033=Error JNI a %1$s\: l'argument \#%2$d no \u00E9s una jarray
JNCK032=Error JNI a %1$s\: l'argument \#%2$d no \u00E9s una jobjectArray
JNCK031=Error JNI a %1$s\: l'argument \#%2$d \u00E9s NULL
JNCK030=Error JNI a %s\: no es pot cridar aquesta funci\u00F3 mentre GC est\u00E0 inhabilitat (probablement s'ha cridat des d'una incid\u00E8ncia JVMPI o JVMTI)
JDTS000=Recepci\u00F3 del transport dt_socket a l'adre\u00E7a\: %d
SHRC059=No es pot assignar mem\u00F2ria per a ClasspathItem a shrinit\:\:hookFindSharedClass
SHRC058=No es pot assignar mem\u00F2ria per a ClasspathItem a shrinit\:\:hookStoreSharedClass
SHRC057=Par\u00E0metres erronis per l'opci\u00F3 expire
SHRC056=No es reconeix l'opci\u00F3 de la l\u00EDnia d'ordres "%s"
SHRC055=Inhabilitar les actualitzaciones de mem\u00F2ria cache incrementals
IREL001=
SHRC054=Inhabilitar l'algoritme per reduir la contenci\u00F3 d'emmagatzematge
IREL000=El codi AOT de %1$s.jar generat amb la VM %2$s no s'executa amb la VM %3$s.
SHRC053=Inhabilitar el blocatge de la taula d'aleatoritzaci\u00F3 local
SHRC052=Inhabilita la mem\u00F2ria cau de classpath local
SHRC051=Desconnectar les actualitzacions din\u00E0miques
SHRC050=Habilitar sortida verbosa
JNCK029=Error JNI a %s\: no es pot cridar aquesta funci\u00F3 dins d'una secci\u00F3 cr\u00EDtica.
JNCK028=Error JNI a %s\: no es pot cridar aquesta funci\u00F3 quan hi ha una excepci\u00F3 pendent.
JNCK027=Error JNI a %s\: JNIEnv no \u00E9s la JNIEnv del fil actiu
JNCK026=Error JNI a %s\: no sembla que JNIEnv sigui un fil v\u00E0lid, que la mem\u00F2ria estigui malmesa ni que es tracti d'una m\u00E0quina virtual J9
JNCK025=\u00DAs -Xcheck\:jni\:nonfatal per continuar l'execuci\u00F3 quan es detecten errors.
JNCK024=S'ha detectat un error JNI. Avortant.
JNCK023=S'ha detectat un error JNI. Continuant...
JNCK022=refer\u00E8ncia global alliberada(?)
JNCK021=refer\u00E8ncia local en un altre fil
JNCK020=refer\u00E8ncia del depurador
SHRC049=Modalitat de depuraci\u00F3 que comprova tots els codis de bits entrants
SHRC048=Llistar tots els elements de la mem\u00F2ria cache
SHRC047=Imprimir el resum de les estad\u00EDstiques de la mem\u00F2ria cache
SHRC046=Mostrar totes les mem\u00F2ries cache compartides i les seves estad\u00EDstiques
SHRC045=Destruir les mem\u00F2ries cache que no s'han fet servir durant <t> mins
SHRC044=OPTION_MODIFIED_EQUALS"<modContext>"
SHRC043=Permetre compartir el codi d'octets modificat\n \t<modContext> \u00E9s un descriptor d'usuari que descriu el tipus de modificaci\u00F3\n\tLes JVM que utilitzen el mateix <modContext> han de fer servir les mateixes modificacions
SHRC042=Destruir totes les mem\u00F2ries cache compartides
SHRC041=Destruir la mem\u00F2ria cache compartida (parm de nom d'\u00FAs o per defecte)
SHRC040=Especificar nom de la mem\u00F2ria cache compartida
JNCK019=refer\u00E8ncia global feble
JNCK018=refer\u00E8ncia global
JNCK017=refer\u00E8ncia local
JNCK016=NULL
JNCK015=\thelp           imprimeix aquesta pantalla
JNCK014=\tpedantic       realitza unes comprovacions m\u00E9s profundes per\u00F2 m\u00E9s lentes
JNCK013=\tnovalist       no comprova la reutilitzaci\u00F3 de llista va
JNCK012=\tnoadvice       no mostra consell
JNCK011=\tnowarn         no mostra avisos
JNCK010=\tnonfatal       no surt quan es detectin errors
SHRC039=Imprimir l'ajuda general compartida
SHRC038=\u00DAs\:\n\njava -Xshareclasses[\:opci\u00F3,...]\n\nLes opcions v\u00E0lides incloses (amb un breu resum) s\u00F3n\: \n\n
SHRC037=Inhabilitades les actualitzacions incrementals
SHRC036=Inhabilitada la reducci\u00F3 de contenci\u00F3 d'emmagatzematge simultani
SHRC035=La mem\u00F2ria cau local de les classpaths est\u00E0 inhabilitada
SHRC034=Inhabilitada la comprovaci\u00F3 de la indicaci\u00F3 de l'hora
SHRC033=Blocatge de taules hash locals inhabilitat
SHRC032=La mem\u00F2ria cache compartida de classes a la que us esteu connectant t\u00E9 un nivell de modificaci\u00F3 erroni.
SHRC031=La mem\u00F2ria cache compartida de classes a la que us esteu connectant t\u00E9 una versi\u00F3 de JVM no compatible.
SHRC030=La mem\u00F2ria cache compartida de classes a la que us esteu connectant t\u00E9 una cap\u00E7alera no v\u00E0lida.
JNCK009=\tnobounds       no porta a terme comprovaci\u00F3 de l\u00EDmits en s\u00E8ries ni matrius
JNCK008=\ttrace          rastreja totes les funcions de JNI
JNCK007=\tverbose        rastreja determinades funcions i activitats de JNI
JNCK006=\tall            comprova l'aplicaci\u00F3 i les classes del sistema
JNCK005=\u00DAs\:  -Xcheck\:jni\:[opci\u00F3[,opci\u00F3[,...]]]
JNCK004=jnichk - Programa d'utilitat JNI per al J9, Versi\u00F3 %s
JNCK003=Programa d'utilitat de comprovaci\u00F3 JNI\: no es assignar l'emmagatzemament local de la VM
JNCK002=Programa d'utilitat de comprovaci\u00F3 JNI\: no es pot enlla\u00E7ar la incid\u00E8ncia
JNCK001=El programa d'utilitat de comprovaci\u00F3 JNI est\u00E0 instal\u00B7lat. Useu -Xcheck\:jni\:help per a l'\u00FAs
JNCK000=-Xcheck\:jni\: opci\u00F3 no reconeguda --> '%s'
J9TI032=Restableix les opcions de buidatge de la VM.
J9TI031=Indica que un fil ha processat l'esdeveniment as\u00EDncron
J9TI030=Cancel\u00B7la l'esdeveniment as\u00EDncron en un fil \u00FAnic o tots els fils
